hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
/*
; stm32N657_bsec.
; ===============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_bsec equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// BSEC address definitions
// ------------------------

typedef struct {
	volatile	uint32_t	FVR0;
	volatile	uint32_t	FVR1;
	volatile	uint32_t	FVR2;
	volatile	uint32_t	FVR3;
	volatile	uint32_t	FVR4;
	volatile	uint32_t	FVR5;
	volatile	uint32_t	FVR6;
	volatile	uint32_t	FVR7;
	volatile	uint32_t	FVR8;
	volatile	uint32_t	FVR9;
	volatile	uint32_t	FVR10;
	volatile	uint32_t	FVR11;
	volatile	uint32_t	FVR12;
	volatile	uint32_t	FVR13;
	volatile	uint32_t	FVR14;
	volatile	uint32_t	FVR15;
	volatile	uint32_t	FVR16;
	volatile	uint32_t	FVR17;
	volatile	uint32_t	FVR18;
	volatile	uint32_t	FVR19;
	volatile	uint32_t	FVR20;
	volatile	uint32_t	FVR21;
	volatile	uint32_t	FVR22;
	volatile	uint32_t	FVR23;
	volatile	uint32_t	FVR24;
	volatile	uint32_t	FVR25;
	volatile	uint32_t	FVR26;
	volatile	uint32_t	FVR27;
	volatile	uint32_t	FVR28;
	volatile	uint32_t	FVR29;
	volatile	uint32_t	FVR30;
	volatile	uint32_t	FVR31;
	volatile	uint32_t	FVR32;
	volatile	uint32_t	FVR33;
	volatile	uint32_t	FVR34;
	volatile	uint32_t	FVR35;
	volatile	uint32_t	FVR36;
	volatile	uint32_t	FVR37;
	volatile	uint32_t	FVR38;
	volatile	uint32_t	FVR39;
	volatile	uint32_t	FVR40;
	volatile	uint32_t	FVR41;
	volatile	uint32_t	FVR42;
	volatile	uint32_t	FVR43;
	volatile	uint32_t	FVR44;
	volatile	uint32_t	FVR45;
	volatile	uint32_t	FVR46;
	volatile	uint32_t	FVR47;
	volatile	uint32_t	FVR48;
	volatile	uint32_t	FVR49;
	volatile	uint32_t	FVR50;
	volatile	uint32_t	FVR51;
	volatile	uint32_t	FVR52;
	volatile	uint32_t	FVR53;
	volatile	uint32_t	FVR54;
	volatile	uint32_t	FVR55;
	volatile	uint32_t	FVR56;
	volatile	uint32_t	FVR57;
	volatile	uint32_t	FVR58;
	volatile	uint32_t	FVR59;
	volatile	uint32_t	FVR60;
	volatile	uint32_t	FVR61;
	volatile	uint32_t	FVR62;
	volatile	uint32_t	FVR63;
	volatile	uint32_t	FVR64;
	volatile	uint32_t	FVR65;
	volatile	uint32_t	FVR66;
	volatile	uint32_t	FVR67;
	volatile	uint32_t	FVR68;
	volatile	uint32_t	FVR69;
	volatile	uint32_t	FVR70;
	volatile	uint32_t	FVR71;
	volatile	uint32_t	FVR72;
	volatile	uint32_t	FVR73;
	volatile	uint32_t	FVR74;
	volatile	uint32_t	FVR75;
	volatile	uint32_t	FVR76;
	volatile	uint32_t	FVR77;
	volatile	uint32_t	FVR78;
	volatile	uint32_t	FVR79;
	volatile	uint32_t	FVR80;
	volatile	uint32_t	FVR81;
	volatile	uint32_t	FVR82;
	volatile	uint32_t	FVR83;
	volatile	uint32_t	FVR84;
	volatile	uint32_t	FVR85;
	volatile	uint32_t	FVR86;
	volatile	uint32_t	FVR87;
	volatile	uint32_t	FVR88;
	volatile	uint32_t	FVR89;
	volatile	uint32_t	FVR90;
	volatile	uint32_t	FVR91;
	volatile	uint32_t	FVR92;
	volatile	uint32_t	FVR93;
	volatile	uint32_t	FVR94;
	volatile	uint32_t	FVR95;
	volatile	uint32_t	FVR96;
	volatile	uint32_t	FVR97;
	volatile	uint32_t	FVR98;
	volatile	uint32_t	FVR99;
	volatile	uint32_t	FVR100;
	volatile	uint32_t	FVR101;
	volatile	uint32_t	FVR102;
	volatile	uint32_t	FVR103;
	volatile	uint32_t	FVR104;
	volatile	uint32_t	FVR105;
	volatile	uint32_t	FVR106;
	volatile	uint32_t	FVR107;
	volatile	uint32_t	FVR108;
	volatile	uint32_t	FVR109;
	volatile	uint32_t	FVR110;
	volatile	uint32_t	FVR111;
	volatile	uint32_t	FVR112;
	volatile	uint32_t	FVR113;
	volatile	uint32_t	FVR114;
	volatile	uint32_t	FVR115;
	volatile	uint32_t	FVR116;
	volatile	uint32_t	FVR117;
	volatile	uint32_t	FVR118;
	volatile	uint32_t	FVR119;
	volatile	uint32_t	FVR120;
	volatile	uint32_t	FVR121;
	volatile	uint32_t	FVR122;
	volatile	uint32_t	FVR123;
	volatile	uint32_t	FVR124;
	volatile	uint32_t	FVR125;
	volatile	uint32_t	FVR126;
	volatile	uint32_t	FVR127;
	volatile	uint32_t	FVR128;
	volatile	uint32_t	FVR129;
	volatile	uint32_t	FVR130;
	volatile	uint32_t	FVR131;
	volatile	uint32_t	FVR132;
	volatile	uint32_t	FVR133;
	volatile	uint32_t	FVR134;
	volatile	uint32_t	FVR135;
	volatile	uint32_t	FVR136;
	volatile	uint32_t	FVR137;
	volatile	uint32_t	FVR138;
	volatile	uint32_t	FVR139;
	volatile	uint32_t	FVR140;
	volatile	uint32_t	FVR141;
	volatile	uint32_t	FVR142;
	volatile	uint32_t	FVR143;
	volatile	uint32_t	FVR144;
	volatile	uint32_t	FVR145;
	volatile	uint32_t	FVR146;
	volatile	uint32_t	FVR147;
	volatile	uint32_t	FVR148;
	volatile	uint32_t	FVR149;
	volatile	uint32_t	FVR150;
	volatile	uint32_t	FVR151;
	volatile	uint32_t	FVR152;
	volatile	uint32_t	FVR153;
	volatile	uint32_t	FVR154;
	volatile	uint32_t	FVR155;
	volatile	uint32_t	FVR156;
	volatile	uint32_t	FVR157;
	volatile	uint32_t	FVR158;
	volatile	uint32_t	FVR159;
	volatile	uint32_t	FVR160;
	volatile	uint32_t	FVR161;
	volatile	uint32_t	FVR162;
	volatile	uint32_t	FVR163;
	volatile	uint32_t	FVR164;
	volatile	uint32_t	FVR165;
	volatile	uint32_t	FVR166;
	volatile	uint32_t	FVR167;
	volatile	uint32_t	FVR168;
	volatile	uint32_t	FVR169;
	volatile	uint32_t	FVR170;
	volatile	uint32_t	FVR171;
	volatile	uint32_t	FVR172;
	volatile	uint32_t	FVR173;
	volatile	uint32_t	FVR174;
	volatile	uint32_t	FVR175;
	volatile	uint32_t	FVR176;
	volatile	uint32_t	FVR177;
	volatile	uint32_t	FVR178;
	volatile	uint32_t	FVR179;
	volatile	uint32_t	FVR180;
	volatile	uint32_t	FVR181;
	volatile	uint32_t	FVR182;
	volatile	uint32_t	FVR183;
	volatile	uint32_t	FVR184;
	volatile	uint32_t	FVR185;
	volatile	uint32_t	FVR186;
	volatile	uint32_t	FVR187;
	volatile	uint32_t	FVR188;
	volatile	uint32_t	FVR189;
	volatile	uint32_t	FVR190;
	volatile	uint32_t	FVR191;
	volatile	uint32_t	FVR192;
	volatile	uint32_t	FVR193;
	volatile	uint32_t	FVR194;
	volatile	uint32_t	FVR195;
	volatile	uint32_t	FVR196;
	volatile	uint32_t	FVR197;
	volatile	uint32_t	FVR198;
	volatile	uint32_t	FVR199;
	volatile	uint32_t	FVR200;
	volatile	uint32_t	FVR201;
	volatile	uint32_t	FVR202;
	volatile	uint32_t	FVR203;
	volatile	uint32_t	FVR204;
	volatile	uint32_t	FVR205;
	volatile	uint32_t	FVR206;
	volatile	uint32_t	FVR207;
	volatile	uint32_t	FVR208;
	volatile	uint32_t	FVR209;
	volatile	uint32_t	FVR210;
	volatile	uint32_t	FVR211;
	volatile	uint32_t	FVR212;
	volatile	uint32_t	FVR213;
	volatile	uint32_t	FVR214;
	volatile	uint32_t	FVR215;
	volatile	uint32_t	FVR216;
	volatile	uint32_t	FVR217;
	volatile	uint32_t	FVR218;
	volatile	uint32_t	FVR219;
	volatile	uint32_t	FVR220;
	volatile	uint32_t	FVR221;
	volatile	uint32_t	FVR222;
	volatile	uint32_t	FVR223;
	volatile	uint32_t	FVR224;
	volatile	uint32_t	FVR225;
	volatile	uint32_t	FVR226;
	volatile	uint32_t	FVR227;
	volatile	uint32_t	FVR228;
	volatile	uint32_t	FVR229;
	volatile	uint32_t	FVR230;
	volatile	uint32_t	FVR231;
	volatile	uint32_t	FVR232;
	volatile	uint32_t	FVR233;
	volatile	uint32_t	FVR234;
	volatile	uint32_t	FVR235;
	volatile	uint32_t	FVR236;
	volatile	uint32_t	FVR237;
	volatile	uint32_t	FVR238;
	volatile	uint32_t	FVR239;
	volatile	uint32_t	FVR240;
	volatile	uint32_t	FVR241;
	volatile	uint32_t	FVR242;
	volatile	uint32_t	FVR243;
	volatile	uint32_t	FVR244;
	volatile	uint32_t	FVR245;
	volatile	uint32_t	FVR246;
	volatile	uint32_t	FVR247;
	volatile	uint32_t	FVR248;
	volatile	uint32_t	FVR249;
	volatile	uint32_t	FVR250;
	volatile	uint32_t	FVR251;
	volatile	uint32_t	FVR252;
	volatile	uint32_t	FVR253;
	volatile	uint32_t	FVR254;
	volatile	uint32_t	FVR255;
	volatile	uint32_t	FVR256;
	volatile	uint32_t	FVR257;
	volatile	uint32_t	FVR258;
	volatile	uint32_t	FVR259;
	volatile	uint32_t	FVR260;
	volatile	uint32_t	FVR261;
	volatile	uint32_t	FVR262;
	volatile	uint32_t	FVR263;
	volatile	uint32_t	FVR264;
	volatile	uint32_t	FVR265;
	volatile	uint32_t	FVR266;
	volatile	uint32_t	FVR267;
	volatile	uint32_t	FVR268;
	volatile	uint32_t	FVR269;
	volatile	uint32_t	FVR270;
	volatile	uint32_t	FVR271;
	volatile	uint32_t	FVR272;
	volatile	uint32_t	FVR273;
	volatile	uint32_t	FVR274;
	volatile	uint32_t	FVR275;
	volatile	uint32_t	FVR276;
	volatile	uint32_t	FVR277;
	volatile	uint32_t	FVR278;
	volatile	uint32_t	FVR279;
	volatile	uint32_t	FVR280;
	volatile	uint32_t	FVR281;
	volatile	uint32_t	FVR282;
	volatile	uint32_t	FVR283;
	volatile	uint32_t	FVR284;
	volatile	uint32_t	FVR285;
	volatile	uint32_t	FVR286;
	volatile	uint32_t	FVR287;
	volatile	uint32_t	FVR288;
	volatile	uint32_t	FVR289;
	volatile	uint32_t	FVR290;
	volatile	uint32_t	FVR291;
	volatile	uint32_t	FVR292;
	volatile	uint32_t	FVR293;
	volatile	uint32_t	FVR294;
	volatile	uint32_t	FVR295;
	volatile	uint32_t	FVR296;
	volatile	uint32_t	FVR297;
	volatile	uint32_t	FVR298;
	volatile	uint32_t	FVR299;
	volatile	uint32_t	FVR300;
	volatile	uint32_t	FVR301;
	volatile	uint32_t	FVR302;
	volatile	uint32_t	FVR303;
	volatile	uint32_t	FVR304;
	volatile	uint32_t	FVR305;
	volatile	uint32_t	FVR306;
	volatile	uint32_t	FVR307;
	volatile	uint32_t	FVR308;
	volatile	uint32_t	FVR309;
	volatile	uint32_t	FVR310;
	volatile	uint32_t	FVR311;
	volatile	uint32_t	FVR312;
	volatile	uint32_t	FVR313;
	volatile	uint32_t	FVR314;
	volatile	uint32_t	FVR315;
	volatile	uint32_t	FVR316;
	volatile	uint32_t	FVR317;
	volatile	uint32_t	FVR318;
	volatile	uint32_t	FVR319;
	volatile	uint32_t	FVR320;
	volatile	uint32_t	FVR321;
	volatile	uint32_t	FVR322;
	volatile	uint32_t	FVR323;
	volatile	uint32_t	FVR324;
	volatile	uint32_t	FVR325;
	volatile	uint32_t	FVR326;
	volatile	uint32_t	FVR327;
	volatile	uint32_t	FVR328;
	volatile	uint32_t	FVR329;
	volatile	uint32_t	FVR330;
	volatile	uint32_t	FVR331;
	volatile	uint32_t	FVR332;
	volatile	uint32_t	FVR333;
	volatile	uint32_t	FVR334;
	volatile	uint32_t	FVR335;
	volatile	uint32_t	FVR336;
	volatile	uint32_t	FVR337;
	volatile	uint32_t	FVR338;
	volatile	uint32_t	FVR339;
	volatile	uint32_t	FVR340;
	volatile	uint32_t	FVR341;
	volatile	uint32_t	FVR342;
	volatile	uint32_t	FVR343;
	volatile	uint32_t	FVR344;
	volatile	uint32_t	FVR345;
	volatile	uint32_t	FVR346;
	volatile	uint32_t	FVR347;
	volatile	uint32_t	FVR348;
	volatile	uint32_t	FVR349;
	volatile	uint32_t	FVR350;
	volatile	uint32_t	FVR351;
	volatile	uint32_t	FVR352;
	volatile	uint32_t	FVR353;
	volatile	uint32_t	FVR354;
	volatile	uint32_t	FVR355;
	volatile	uint32_t	FVR356;
	volatile	uint32_t	FVR357;
	volatile	uint32_t	FVR358;
	volatile	uint32_t	FVR359;
	volatile	uint32_t	FVR360;
	volatile	uint32_t	FVR361;
	volatile	uint32_t	FVR362;
	volatile	uint32_t	FVR363;
	volatile	uint32_t	FVR364;
	volatile	uint32_t	FVR365;
	volatile	uint32_t	FVR366;
	volatile	uint32_t	FVR367;
	volatile	uint32_t	FVR368;
	volatile	uint32_t	FVR369;
	volatile	uint32_t	FVR370;
	volatile	uint32_t	FVR371;
	volatile	uint32_t	FVR372;
	volatile	uint32_t	FVR373;
	volatile	uint32_t	FVR374;
	volatile	uint32_t	FVR375;
	volatile	uint32_t	RESERVED0[136];
	volatile	uint32_t	SPLOCK0;
	volatile	uint32_t	SPLOCK1;
	volatile	uint32_t	SPLOCK2;
	volatile	uint32_t	SPLOCK3;
	volatile	uint32_t	SPLOCK4;
	volatile	uint32_t	SPLOCK5;
	volatile	uint32_t	SPLOCK6;
	volatile	uint32_t	SPLOCK7;
	volatile	uint32_t	SPLOCK8;
	volatile	uint32_t	SPLOCK9;
	volatile	uint32_t	SPLOCK10;
	volatile	uint32_t	SPLOCK11;
	volatile	uint32_t	RESERVED1[4];
	volatile	uint32_t	SWLOCK0;
	volatile	uint32_t	SWLOCK1;
	volatile	uint32_t	SWLOCK2;
	volatile	uint32_t	SWLOCK3;
	volatile	uint32_t	SWLOCK4;
	volatile	uint32_t	SWLOCK5;
	volatile	uint32_t	SWLOCK6;
	volatile	uint32_t	SWLOCK7;
	volatile	uint32_t	SWLOCK8;
	volatile	uint32_t	SWLOCK9;
	volatile	uint32_t	SWLOCK10;
	volatile	uint32_t	SWLOCK11;
	volatile	uint32_t	RESERVED2[4];
	volatile	uint32_t	SRLOCK0;
	volatile	uint32_t	SRLOCK1;
	volatile	uint32_t	SRLOCK2;
	volatile	uint32_t	SRLOCK3;
	volatile	uint32_t	SRLOCK4;
	volatile	uint32_t	SRLOCK5;
	volatile	uint32_t	SRLOCK6;
	volatile	uint32_t	SRLOCK7;
	volatile	uint32_t	SRLOCK8;
	volatile	uint32_t	SRLOCK9;
	volatile	uint32_t	SRLOCK10;
	volatile	uint32_t	SRLOCK11;
	volatile	uint32_t	RESERVED3[4];
	volatile	uint32_t	OTPVLDR0;
	volatile	uint32_t	OTPVLDR1;
	volatile	uint32_t	OTPVLDR2;
	volatile	uint32_t	OTPVLDR3;
	volatile	uint32_t	OTPVLDR4;
	volatile	uint32_t	OTPVLDR5;
	volatile	uint32_t	OTPVLDR6;
	volatile	uint32_t	OTPVLDR7;
	volatile	uint32_t	OTPVLDR8;
	volatile	uint32_t	OTPVLDR9;
	volatile	uint32_t	OTPVLDR10;
	volatile	uint32_t	OTPVLDR11;
	volatile	uint32_t	RESERVED4[20];
	volatile	uint32_t	SFSR0;
	volatile	uint32_t	SFSR1;
	volatile	uint32_t	SFSR2;
	volatile	uint32_t	SFSR3;
	volatile	uint32_t	SFSR4;
	volatile	uint32_t	SFSR5;
	volatile	uint32_t	SFSR6;
	volatile	uint32_t	SFSR7;
	volatile	uint32_t	SFSR8;
	volatile	uint32_t	SFSR9;
	volatile	uint32_t	SFSR10;
	volatile	uint32_t	SFSR11;
	volatile	uint32_t	RESERVED5[165];
	volatile	uint32_t	OTPCR;
	volatile	uint32_t	WDR;
	volatile	uint32_t	RESERVED6[125];
	volatile	uint32_t	SCRATCHR0;
	volatile	uint32_t	SCRATCHR1;
	volatile	uint32_t	SCRATCHR2;
	volatile	uint32_t	SCRATCHR3;
	volatile	uint32_t	LOCKR;
	volatile	uint32_t	JTAGINR;
	volatile	uint32_t	JTAGOUTR;
	volatile	uint32_t	RESERVED7[2];
	volatile	uint32_t	UNMAPR;
	volatile	uint32_t	RESERVED8[6];
	volatile	uint32_t	SR;
	volatile	uint32_t	OTPSR;
	volatile	uint32_t	RESERVED9[14];
	volatile	uint32_t	EPOCHR0;
	volatile	uint32_t	EPOCHR1;
	volatile	uint32_t	EPOCH_SELR;
	volatile	uint32_t	DBGCR;
	volatile	uint32_t	AP_UNLOCK;
	volatile	uint32_t	HDPLSR;
	volatile	uint32_t	HDPLCR;
	volatile	uint32_t	NEXTLR;
	volatile	uint32_t	RESERVED10[40];
	volatile	uint32_t	WOSCR0;
	volatile	uint32_t	WOSCR1;
	volatile	uint32_t	WOSCR2;
	volatile	uint32_t	WOSCR3;
	volatile	uint32_t	WOSCR4;
	volatile	uint32_t	WOSCR5;
	volatile	uint32_t	WOSCR6;
	volatile	uint32_t	WOSCR7;
	volatile	uint32_t	RESERVED11[34];
	volatile	uint32_t	HRCR;
	volatile	uint32_t	WRCR;
} BSEC_TypeDef;

#if (defined(__cplusplus))
#define	BSEC_NS	reinterpret_cast<BSEC_TypeDef *>(0x46009000u)
#define	BSEC_S	reinterpret_cast<BSEC_TypeDef *>(0x56009000u)

#else
#define	BSEC_NS	((BSEC_TypeDef *)0x46009000u)
#define	BSEC_S	((BSEC_TypeDef *)0x56009000u)
#endif

// FVR0 Configuration

