hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_FVR0_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR0_FV_0					(0x1u<<0)

// FVR1 Configuration

#define	BSEC_FVR1_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR1_FV_0					(0x1u<<0)

// FVR2 Configuration

#define	BSEC_FVR2_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR2_FV_0					(0x1u<<0)

// FVR3 Configuration

#define	BSEC_FVR3_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR3_FV_0					(0x1u<<0)

// FVR4 Configuration

#define	BSEC_FVR4_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR4_FV_0					(0x1u<<0)

// FVR5 Configuration

#define	BSEC_FVR5_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR5_FV_0					(0x1u<<0)

// FVR6 Configuration

#define	BSEC_FVR6_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR6_FV_0					(0x1u<<0)

// FVR7 Configuration

#define	BSEC_FVR7_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR7_FV_0					(0x1u<<0)

// FVR8 Configuration

#define	BSEC_FVR8_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR8_FV_0					(0x1u<<0)

// FVR9 Configuration

#define	BSEC_FVR9_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR9_FV_0					(0x1u<<0)

// FVR10 Configuration

#define	BSEC_FVR10_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR10_FV_0					(0x1u<<0)

// FVR11 Configuration

#define	BSEC_FVR11_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR11_FV_0					(0x1u<<0)

// FVR12 Configuration

#define	BSEC_FVR12_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR12_FV_0					(0x1u<<0)

// FVR13 Configuration

#define	BSEC_FVR13_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR13_FV_0					(0x1u<<0)

// FVR14 Configuration

#define	BSEC_FVR14_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR14_FV_0					(0x1u<<0)

// FVR15 Configuration

#define	BSEC_FVR15_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR15_FV_0					(0x1u<<0)

// FVR16 Configuration

#define	BSEC_FVR16_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR16_FV_0					(0x1u<<0)

// FVR17 Configuration

#define	BSEC_FVR17_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR17_FV_0					(0x1u<<0)

// FVR18 Configuration

#define	BSEC_FVR18_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR18_FV_0					(0x1u<<0)

// FVR19 Configuration

#define	BSEC_FVR19_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR19_FV_0					(0x1u<<0)

// FVR20 Configuration

#define	BSEC_FVR20_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR20_FV_0					(0x1u<<0)

// FVR21 Configuration

#define	BSEC_FVR21_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR21_FV_0					(0x1u<<0)

// FVR22 Configuration

#define	BSEC_FVR22_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR22_FV_0					(0x1u<<0)

// FVR23 Configuration

#define	BSEC_FVR23_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR23_FV_0					(0x1u<<0)

// FVR24 Configuration

#define	BSEC_FVR24_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR24_FV_0					(0x1u<<0)

// FVR25 Configuration

#define	BSEC_FVR25_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR25_FV_0					(0x1u<<0)

// FVR26 Configuration

#define	BSEC_FVR26_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR26_FV_0					(0x1u<<0)

// FVR27 Configuration

#define	BSEC_FVR27_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR27_FV_0					(0x1u<<0)

// FVR28 Configuration

#define	BSEC_FVR28_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR28_FV_0					(0x1u<<0)

// FVR29 Configuration

#define	BSEC_FVR29_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR29_FV_0					(0x1u<<0)

// FVR30 Configuration

#define	BSEC_FVR30_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR30_FV_0					(0x1u<<0)

// FVR31 Configuration

#define	BSEC_FVR31_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR31_FV_0					(0x1u<<0)

// FVR32 Configuration

#define	BSEC_FVR32_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR32_FV_0					(0x1u<<0)

// FVR33 Configuration

#define	BSEC_FVR33_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR33_FV_0					(0x1u<<0)

// FVR34 Configuration

#define	BSEC_FVR34_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR34_FV_0					(0x1u<<0)

// FVR35 Configuration

#define	BSEC_FVR35_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR35_FV_0					(0x1u<<0)

// FVR36 Configuration

#define	BSEC_FVR36_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR36_FV_0					(0x1u<<0)

// FVR37 Configuration

#define	BSEC_FVR37_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR37_FV_0					(0x1u<<0)

// FVR38 Configuration

#define	BSEC_FVR38_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR38_FV_0					(0x1u<<0)

// FVR39 Configuration

#define	BSEC_FVR39_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR39_FV_0					(0x1u<<0)

// FVR40 Configuration

#define	BSEC_FVR40_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR40_FV_0					(0x1u<<0)

// FVR41 Configuration

#define	BSEC_FVR41_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR41_FV_0					(0x1u<<0)

// FVR42 Configuration

#define	BSEC_FVR42_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR42_FV_0					(0x1u<<0)

// FVR43 Configuration

#define	BSEC_FVR43_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR43_FV_0					(0x1u<<0)

// FVR44 Configuration

#define	BSEC_FVR44_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR44_FV_0					(0x1u<<0)

// FVR45 Configuration

#define	BSEC_FVR45_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR45_FV_0					(0x1u<<0)

// FVR46 Configuration

#define	BSEC_FVR46_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR46_FV_0					(0x1u<<0)

// FVR47 Configuration

#define	BSEC_FVR47_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR47_FV_0					(0x1u<<0)

// FVR48 Configuration

#define	BSEC_FVR48_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR48_FV_0					(0x1u<<0)

// FVR49 Configuration

#define	BSEC_FVR49_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR49_FV_0					(0x1u<<0)

// FVR50 Configuration

#define	BSEC_FVR50_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR50_FV_0					(0x1u<<0)

// FVR51 Configuration

#define	BSEC_FVR51_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR51_FV_0					(0x1u<<0)

// FVR52 Configuration

#define	BSEC_FVR52_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR52_FV_0					(0x1u<<0)

// FVR53 Configuration

#define	BSEC_FVR53_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR53_FV_0					(0x1u<<0)

// FVR54 Configuration

#define	BSEC_FVR54_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR54_FV_0					(0x1u<<0)

// FVR55 Configuration

#define	BSEC_FVR55_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR55_FV_0					(0x1u<<0)

// FVR56 Configuration

#define	BSEC_FVR56_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR56_FV_0					(0x1u<<0)

// FVR57 Configuration

#define	BSEC_FVR57_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR57_FV_0					(0x1u<<0)

// FVR58 Configuration

#define	BSEC_FVR58_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR58_FV_0					(0x1u<<0)

// FVR59 Configuration

