hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_FVR59_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR59_FV_0					(0x1u<<0)

// FVR60 Configuration

#define	BSEC_FVR60_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR60_FV_0					(0x1u<<0)

// FVR61 Configuration

#define	BSEC_FVR61_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR61_FV_0					(0x1u<<0)

// FVR62 Configuration

#define	BSEC_FVR62_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR62_FV_0					(0x1u<<0)

// FVR63 Configuration

#define	BSEC_FVR63_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR63_FV_0					(0x1u<<0)

// FVR64 Configuration

#define	BSEC_FVR64_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR64_FV_0					(0x1u<<0)

// FVR65 Configuration

#define	BSEC_FVR65_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR65_FV_0					(0x1u<<0)

// FVR66 Configuration

#define	BSEC_FVR66_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR66_FV_0					(0x1u<<0)

// FVR67 Configuration

#define	BSEC_FVR67_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR67_FV_0					(0x1u<<0)

// FVR68 Configuration

#define	BSEC_FVR68_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR68_FV_0					(0x1u<<0)

// FVR69 Configuration

#define	BSEC_FVR69_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR69_FV_0					(0x1u<<0)

// FVR70 Configuration

#define	BSEC_FVR70_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR70_FV_0					(0x1u<<0)

// FVR71 Configuration

#define	BSEC_FVR71_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR71_FV_0					(0x1u<<0)

// FVR72 Configuration

#define	BSEC_FVR72_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR72_FV_0					(0x1u<<0)

// FVR73 Configuration

#define	BSEC_FVR73_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR73_FV_0					(0x1u<<0)

// FVR74 Configuration

#define	BSEC_FVR74_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR74_FV_0					(0x1u<<0)

// FVR75 Configuration

#define	BSEC_FVR75_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR75_FV_0					(0x1u<<0)

// FVR76 Configuration

#define	BSEC_FVR76_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR76_FV_0					(0x1u<<0)

// FVR77 Configuration

#define	BSEC_FVR77_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR77_FV_0					(0x1u<<0)

// FVR78 Configuration

#define	BSEC_FVR78_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR78_FV_0					(0x1u<<0)

// FVR79 Configuration

#define	BSEC_FVR79_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR79_FV_0					(0x1u<<0)

// FVR80 Configuration

#define	BSEC_FVR80_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR80_FV_0					(0x1u<<0)

// FVR81 Configuration

#define	BSEC_FVR81_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR81_FV_0					(0x1u<<0)

// FVR82 Configuration

#define	BSEC_FVR82_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR82_FV_0					(0x1u<<0)

// FVR83 Configuration

#define	BSEC_FVR83_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR83_FV_0					(0x1u<<0)

// FVR84 Configuration

#define	BSEC_FVR84_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR84_FV_0					(0x1u<<0)

// FVR85 Configuration

#define	BSEC_FVR85_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR85_FV_0					(0x1u<<0)

// FVR86 Configuration

#define	BSEC_FVR86_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR86_FV_0					(0x1u<<0)

// FVR87 Configuration

#define	BSEC_FVR87_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR87_FV_0					(0x1u<<0)

// FVR88 Configuration

#define	BSEC_FVR88_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR88_FV_0					(0x1u<<0)

// FVR89 Configuration

#define	BSEC_FVR89_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR89_FV_0					(0x1u<<0)

// FVR90 Configuration

#define	BSEC_FVR90_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR90_FV_0					(0x1u<<0)

// FVR91 Configuration

#define	BSEC_FVR91_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR91_FV_0					(0x1u<<0)

// FVR92 Configuration

#define	BSEC_FVR92_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR92_FV_0					(0x1u<<0)

// FVR93 Configuration

#define	BSEC_FVR93_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR93_FV_0					(0x1u<<0)

// FVR94 Configuration

#define	BSEC_FVR94_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR94_FV_0					(0x1u<<0)

// FVR95 Configuration

#define	BSEC_FVR95_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR95_FV_0					(0x1u<<0)

// FVR96 Configuration

#define	BSEC_FVR96_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR96_FV_0					(0x1u<<0)

// FVR97 Configuration

#define	BSEC_FVR97_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR97_FV_0					(0x1u<<0)

// FVR98 Configuration

#define	BSEC_FVR98_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR98_FV_0					(0x1u<<0)

// FVR99 Configuration

#define	BSEC_FVR99_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR99_FV_0					(0x1u<<0)

// FVR100 Configuration

#define	BSEC_FVR100_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR100_FV_0				(0x1u<<0)

// FVR101 Configuration

#define	BSEC_FVR101_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR101_FV_0				(0x1u<<0)

// FVR102 Configuration

#define	BSEC_FVR102_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR102_FV_0				(0x1u<<0)

// FVR103 Configuration

#define	BSEC_FVR103_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR103_FV_0				(0x1u<<0)

// FVR104 Configuration

#define	BSEC_FVR104_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR104_FV_0				(0x1u<<0)

// FVR105 Configuration

#define	BSEC_FVR105_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR105_FV_0				(0x1u<<0)

// FVR106 Configuration

#define	BSEC_FVR106_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR106_FV_0				(0x1u<<0)

// FVR107 Configuration

#define	BSEC_FVR107_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR107_FV_0				(0x1u<<0)

// FVR108 Configuration

#define	BSEC_FVR108_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR108_FV_0				(0x1u<<0)

// FVR109 Configuration

#define	BSEC_FVR109_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR109_FV_0				(0x1u<<0)

// FVR110 Configuration

#define	BSEC_FVR110_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR110_FV_0				(0x1u<<0)

// FVR111 Configuration

#define	BSEC_FVR111_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR111_FV_0				(0x1u<<0)

// FVR112 Configuration

#define	BSEC_FVR112_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR112_FV_0				(0x1u<<0)

// FVR113 Configuration

#define	BSEC_FVR113_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR113_FV_0				(0x1u<<0)

// FVR114 Configuration

#define	BSEC_FVR114_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR114_FV_0				(0x1u<<0)

// FVR115 Configuration

#define	BSEC_FVR115_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR115_FV_0				(0x1u<<0)

// FVR116 Configuration

#define	BSEC_FVR116_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR116_FV_0				(0x1u<<0)

// FVR117 Configuration

