hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_FVR117_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR117_FV_0				(0x1u<<0)

// FVR118 Configuration

#define	BSEC_FVR118_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR118_FV_0				(0x1u<<0)

// FVR119 Configuration

#define	BSEC_FVR119_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR119_FV_0				(0x1u<<0)

// FVR120 Configuration

#define	BSEC_FVR120_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR120_FV_0				(0x1u<<0)

// FVR121 Configuration

#define	BSEC_FVR121_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR121_FV_0				(0x1u<<0)

// FVR122 Configuration

#define	BSEC_FVR122_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR122_FV_0				(0x1u<<0)

// FVR123 Configuration

#define	BSEC_FVR123_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR123_FV_0				(0x1u<<0)

// FVR124 Configuration

#define	BSEC_FVR124_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR124_FV_0				(0x1u<<0)

// FVR125 Configuration

#define	BSEC_FVR125_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR125_FV_0				(0x1u<<0)

// FVR126 Configuration

#define	BSEC_FVR126_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR126_FV_0				(0x1u<<0)

// FVR127 Configuration

#define	BSEC_FVR127_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR127_FV_0				(0x1u<<0)

// FVR128 Configuration

#define	BSEC_FVR128_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR128_FV_0				(0x1u<<0)

// FVR129 Configuration

#define	BSEC_FVR129_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR129_FV_0				(0x1u<<0)

// FVR130 Configuration

#define	BSEC_FVR130_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR130_FV_0				(0x1u<<0)

// FVR131 Configuration

#define	BSEC_FVR131_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR131_FV_0				(0x1u<<0)

// FVR132 Configuration

#define	BSEC_FVR132_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR132_FV_0				(0x1u<<0)

// FVR133 Configuration

#define	BSEC_FVR133_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR133_FV_0				(0x1u<<0)

// FVR134 Configuration

#define	BSEC_FVR134_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR134_FV_0				(0x1u<<0)

// FVR135 Configuration

#define	BSEC_FVR135_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR135_FV_0				(0x1u<<0)

// FVR136 Configuration

#define	BSEC_FVR136_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR136_FV_0				(0x1u<<0)

// FVR137 Configuration

#define	BSEC_FVR137_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR137_FV_0				(0x1u<<0)

// FVR138 Configuration

#define	BSEC_FVR138_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR138_FV_0				(0x1u<<0)

// FVR139 Configuration

#define	BSEC_FVR139_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR139_FV_0				(0x1u<<0)

// FVR140 Configuration

#define	BSEC_FVR140_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR140_FV_0				(0x1u<<0)

// FVR141 Configuration

#define	BSEC_FVR141_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR141_FV_0				(0x1u<<0)

// FVR142 Configuration

#define	BSEC_FVR142_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR142_FV_0				(0x1u<<0)

// FVR143 Configuration

#define	BSEC_FVR143_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR143_FV_0				(0x1u<<0)

// FVR144 Configuration

#define	BSEC_FVR144_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR144_FV_0				(0x1u<<0)

// FVR145 Configuration

#define	BSEC_FVR145_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR145_FV_0				(0x1u<<0)

// FVR146 Configuration

#define	BSEC_FVR146_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR146_FV_0				(0x1u<<0)

// FVR147 Configuration

#define	BSEC_FVR147_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR147_FV_0				(0x1u<<0)

// FVR148 Configuration

#define	BSEC_FVR148_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR148_FV_0				(0x1u<<0)

// FVR149 Configuration

#define	BSEC_FVR149_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR149_FV_0				(0x1u<<0)

// FVR150 Configuration

#define	BSEC_FVR150_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR150_FV_0				(0x1u<<0)

// FVR151 Configuration

#define	BSEC_FVR151_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR151_FV_0				(0x1u<<0)

// FVR152 Configuration

#define	BSEC_FVR152_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR152_FV_0				(0x1u<<0)

// FVR153 Configuration

#define	BSEC_FVR153_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR153_FV_0				(0x1u<<0)

// FVR154 Configuration

#define	BSEC_FVR154_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR154_FV_0				(0x1u<<0)

// FVR155 Configuration

#define	BSEC_FVR155_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR155_FV_0				(0x1u<<0)

// FVR156 Configuration

#define	BSEC_FVR156_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR156_FV_0				(0x1u<<0)

// FVR157 Configuration

#define	BSEC_FVR157_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR157_FV_0				(0x1u<<0)

// FVR158 Configuration

#define	BSEC_FVR158_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR158_FV_0				(0x1u<<0)

// FVR159 Configuration

#define	BSEC_FVR159_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR159_FV_0				(0x1u<<0)

// FVR160 Configuration

#define	BSEC_FVR160_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR160_FV_0				(0x1u<<0)

// FVR161 Configuration

#define	BSEC_FVR161_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR161_FV_0				(0x1u<<0)

// FVR162 Configuration

#define	BSEC_FVR162_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR162_FV_0				(0x1u<<0)

// FVR163 Configuration

#define	BSEC_FVR163_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR163_FV_0				(0x1u<<0)

// FVR164 Configuration

#define	BSEC_FVR164_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR164_FV_0				(0x1u<<0)

// FVR165 Configuration

#define	BSEC_FVR165_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR165_FV_0				(0x1u<<0)

// FVR166 Configuration

#define	BSEC_FVR166_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR166_FV_0				(0x1u<<0)

// FVR167 Configuration

#define	BSEC_FVR167_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR167_FV_0				(0x1u<<0)

// FVR168 Configuration

#define	BSEC_FVR168_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR168_FV_0				(0x1u<<0)

// FVR169 Configuration

#define	BSEC_FVR169_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR169_FV_0				(0x1u<<0)

// FVR170 Configuration

#define	BSEC_FVR170_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR170_FV_0				(0x1u<<0)

// FVR171 Configuration

#define	BSEC_FVR171_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR171_FV_0				(0x1u<<0)

// FVR172 Configuration

#define	BSEC_FVR172_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR172_FV_0				(0x1u<<0)

