hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// FVR173 Configuration

#define	BSEC_FVR173_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR173_FV_0				(0x1u<<0)

// FVR174 Configuration

#define	BSEC_FVR174_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR174_FV_0				(0x1u<<0)

// FVR175 Configuration

#define	BSEC_FVR175_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR175_FV_0				(0x1u<<0)

// FVR176 Configuration

#define	BSEC_FVR176_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR176_FV_0				(0x1u<<0)

// FVR177 Configuration

#define	BSEC_FVR177_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR177_FV_0				(0x1u<<0)

// FVR178 Configuration

#define	BSEC_FVR178_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR178_FV_0				(0x1u<<0)

// FVR179 Configuration

#define	BSEC_FVR179_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR179_FV_0				(0x1u<<0)

// FVR180 Configuration

#define	BSEC_FVR180_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR180_FV_0				(0x1u<<0)

// FVR181 Configuration

#define	BSEC_FVR181_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR181_FV_0				(0x1u<<0)

// FVR182 Configuration

#define	BSEC_FVR182_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR182_FV_0				(0x1u<<0)

// FVR183 Configuration

#define	BSEC_FVR183_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR183_FV_0				(0x1u<<0)

// FVR184 Configuration

#define	BSEC_FVR184_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR184_FV_0				(0x1u<<0)

// FVR185 Configuration

#define	BSEC_FVR185_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR185_FV_0				(0x1u<<0)

// FVR186 Configuration

#define	BSEC_FVR186_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR186_FV_0				(0x1u<<0)

// FVR187 Configuration

#define	BSEC_FVR187_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR187_FV_0				(0x1u<<0)

// FVR188 Configuration

#define	BSEC_FVR188_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR188_FV_0				(0x1u<<0)

// FVR189 Configuration

#define	BSEC_FVR189_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR189_FV_0				(0x1u<<0)

// FVR190 Configuration

#define	BSEC_FVR190_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR190_FV_0				(0x1u<<0)

// FVR191 Configuration

#define	BSEC_FVR191_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR191_FV_0				(0x1u<<0)

// FVR192 Configuration

#define	BSEC_FVR192_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR192_FV_0				(0x1u<<0)

// FVR193 Configuration

#define	BSEC_FVR193_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR193_FV_0				(0x1u<<0)

// FVR194 Configuration

#define	BSEC_FVR194_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR194_FV_0				(0x1u<<0)

// FVR195 Configuration

#define	BSEC_FVR195_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR195_FV_0				(0x1u<<0)

// FVR196 Configuration

#define	BSEC_FVR196_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR196_FV_0				(0x1u<<0)

// FVR197 Configuration

#define	BSEC_FVR197_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR197_FV_0				(0x1u<<0)

// FVR198 Configuration

#define	BSEC_FVR198_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR198_FV_0				(0x1u<<0)

// FVR199 Configuration

#define	BSEC_FVR199_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR199_FV_0				(0x1u<<0)

// FVR200 Configuration

#define	BSEC_FVR200_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR200_FV_0				(0x1u<<0)

// FVR201 Configuration

#define	BSEC_FVR201_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR201_FV_0				(0x1u<<0)

// FVR202 Configuration

#define	BSEC_FVR202_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR202_FV_0				(0x1u<<0)

// FVR203 Configuration

#define	BSEC_FVR203_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR203_FV_0				(0x1u<<0)

// FVR204 Configuration

#define	BSEC_FVR204_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR204_FV_0				(0x1u<<0)

// FVR205 Configuration

#define	BSEC_FVR205_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR205_FV_0				(0x1u<<0)

// FVR206 Configuration

#define	BSEC_FVR206_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR206_FV_0				(0x1u<<0)

// FVR207 Configuration

#define	BSEC_FVR207_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR207_FV_0				(0x1u<<0)

// FVR208 Configuration

#define	BSEC_FVR208_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR208_FV_0				(0x1u<<0)

// FVR209 Configuration

#define	BSEC_FVR209_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR209_FV_0				(0x1u<<0)

// FVR210 Configuration

#define	BSEC_FVR210_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR210_FV_0				(0x1u<<0)

// FVR211 Configuration

#define	BSEC_FVR211_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR211_FV_0				(0x1u<<0)

// FVR212 Configuration

#define	BSEC_FVR212_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR212_FV_0				(0x1u<<0)

// FVR213 Configuration

#define	BSEC_FVR213_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR213_FV_0				(0x1u<<0)

// FVR214 Configuration

#define	BSEC_FVR214_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR214_FV_0				(0x1u<<0)

// FVR215 Configuration

#define	BSEC_FVR215_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR215_FV_0				(0x1u<<0)

// FVR216 Configuration

#define	BSEC_FVR216_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR216_FV_0				(0x1u<<0)

// FVR217 Configuration

#define	BSEC_FVR217_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR217_FV_0				(0x1u<<0)

// FVR218 Configuration

#define	BSEC_FVR218_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR218_FV_0				(0x1u<<0)

// FVR219 Configuration

#define	BSEC_FVR219_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR219_FV_0				(0x1u<<0)

// FVR220 Configuration

#define	BSEC_FVR220_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR220_FV_0				(0x1u<<0)

// FVR221 Configuration

#define	BSEC_FVR221_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR221_FV_0				(0x1u<<0)

// FVR222 Configuration

#define	BSEC_FVR222_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR222_FV_0				(0x1u<<0)

// FVR223 Configuration

#define	BSEC_FVR223_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR223_FV_0				(0x1u<<0)

// FVR224 Configuration

#define	BSEC_FVR224_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR224_FV_0				(0x1u<<0)

// FVR225 Configuration

#define	BSEC_FVR225_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR225_FV_0				(0x1u<<0)

// FVR226 Configuration

#define	BSEC_FVR226_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR226_FV_0				(0x1u<<0)

// FVR227 Configuration

#define	BSEC_FVR227_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR227_FV_0				(0x1u<<0)

// FVR228 Configuration

#define	BSEC_FVR228_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR228_FV_0				(0x1u<<0)

