hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// FVR229 Configuration

#define	BSEC_FVR229_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR229_FV_0				(0x1u<<0)

// FVR230 Configuration

#define	BSEC_FVR230_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR230_FV_0				(0x1u<<0)

// FVR231 Configuration

#define	BSEC_FVR231_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR231_FV_0				(0x1u<<0)

// FVR232 Configuration

#define	BSEC_FVR232_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR232_FV_0				(0x1u<<0)

// FVR233 Configuration

#define	BSEC_FVR233_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR233_FV_0				(0x1u<<0)

// FVR234 Configuration

#define	BSEC_FVR234_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR234_FV_0				(0x1u<<0)

// FVR235 Configuration

#define	BSEC_FVR235_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR235_FV_0				(0x1u<<0)

// FVR236 Configuration

#define	BSEC_FVR236_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR236_FV_0				(0x1u<<0)

// FVR237 Configuration

#define	BSEC_FVR237_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR237_FV_0				(0x1u<<0)

// FVR238 Configuration

#define	BSEC_FVR238_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR238_FV_0				(0x1u<<0)

// FVR239 Configuration

#define	BSEC_FVR239_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR239_FV_0				(0x1u<<0)

// FVR240 Configuration

#define	BSEC_FVR240_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR240_FV_0				(0x1u<<0)

// FVR241 Configuration

#define	BSEC_FVR241_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR241_FV_0				(0x1u<<0)

// FVR242 Configuration

#define	BSEC_FVR242_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR242_FV_0				(0x1u<<0)

// FVR243 Configuration

#define	BSEC_FVR243_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR243_FV_0				(0x1u<<0)

// FVR244 Configuration

#define	BSEC_FVR244_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR244_FV_0				(0x1u<<0)

// FVR245 Configuration

#define	BSEC_FVR245_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR245_FV_0				(0x1u<<0)

// FVR246 Configuration

#define	BSEC_FVR246_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR246_FV_0				(0x1u<<0)

// FVR247 Configuration

#define	BSEC_FVR247_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR247_FV_0				(0x1u<<0)

// FVR248 Configuration

#define	BSEC_FVR248_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR248_FV_0				(0x1u<<0)

// FVR249 Configuration

#define	BSEC_FVR249_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR249_FV_0				(0x1u<<0)

// FVR250 Configuration

#define	BSEC_FVR250_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR250_FV_0				(0x1u<<0)

// FVR251 Configuration

#define	BSEC_FVR251_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR251_FV_0				(0x1u<<0)

// FVR252 Configuration

#define	BSEC_FVR252_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR252_FV_0				(0x1u<<0)

// FVR253 Configuration

#define	BSEC_FVR253_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR253_FV_0				(0x1u<<0)

// FVR254 Configuration

#define	BSEC_FVR254_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR254_FV_0				(0x1u<<0)

// FVR255 Configuration

#define	BSEC_FVR255_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR255_FV_0				(0x1u<<0)

// FVR256 Configuration

#define	BSEC_FVR256_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR256_FV_0				(0x1u<<0)

// FVR257 Configuration

#define	BSEC_FVR257_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR257_FV_0				(0x1u<<0)

// FVR258 Configuration

#define	BSEC_FVR258_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR258_FV_0				(0x1u<<0)

// FVR259 Configuration

#define	BSEC_FVR259_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR259_FV_0				(0x1u<<0)

// FVR260 Configuration

#define	BSEC_FVR260_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR260_FV_0				(0x1u<<0)

// FVR261 Configuration

#define	BSEC_FVR261_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR261_FV_0				(0x1u<<0)

// FVR262 Configuration

#define	BSEC_FVR262_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR262_FV_0				(0x1u<<0)

// FVR263 Configuration

#define	BSEC_FVR263_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR263_FV_0				(0x1u<<0)

// FVR264 Configuration

#define	BSEC_FVR264_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR264_FV_0				(0x1u<<0)

// FVR265 Configuration

#define	BSEC_FVR265_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR265_FV_0				(0x1u<<0)

// FVR266 Configuration

#define	BSEC_FVR266_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR266_FV_0				(0x1u<<0)

// FVR267 Configuration

#define	BSEC_FVR267_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR267_FV_0				(0x1u<<0)

// FVR268 Configuration

#define	BSEC_FVR268_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR268_FV_0				(0x1u<<0)

// FVR269 Configuration

#define	BSEC_FVR269_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR269_FV_0				(0x1u<<0)

// FVR270 Configuration

#define	BSEC_FVR270_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR270_FV_0				(0x1u<<0)

// FVR271 Configuration

#define	BSEC_FVR271_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR271_FV_0				(0x1u<<0)

// FVR272 Configuration

#define	BSEC_FVR272_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR272_FV_0				(0x1u<<0)

// FVR273 Configuration

#define	BSEC_FVR273_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR273_FV_0				(0x1u<<0)

// FVR274 Configuration

#define	BSEC_FVR274_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR274_FV_0				(0x1u<<0)

// FVR275 Configuration

#define	BSEC_FVR275_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR275_FV_0				(0x1u<<0)

// FVR276 Configuration

#define	BSEC_FVR276_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR276_FV_0				(0x1u<<0)

// FVR277 Configuration

#define	BSEC_FVR277_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR277_FV_0				(0x1u<<0)

// FVR278 Configuration

#define	BSEC_FVR278_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR278_FV_0				(0x1u<<0)

// FVR279 Configuration

#define	BSEC_FVR279_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR279_FV_0				(0x1u<<0)

// FVR280 Configuration

#define	BSEC_FVR280_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR280_FV_0				(0x1u<<0)

// FVR281 Configuration

#define	BSEC_FVR281_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR281_FV_0				(0x1u<<0)

// FVR282 Configuration

#define	BSEC_FVR282_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR282_FV_0				(0x1u<<0)

// FVR283 Configuration

#define	BSEC_FVR283_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR283_FV_0				(0x1u<<0)

// FVR284 Configuration

#define	BSEC_FVR284_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR284_FV_0				(0x1u<<0)

