hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// FVR285 Configuration

#define	BSEC_FVR285_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR285_FV_0				(0x1u<<0)

// FVR286 Configuration

#define	BSEC_FVR286_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR286_FV_0				(0x1u<<0)

// FVR287 Configuration

#define	BSEC_FVR287_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR287_FV_0				(0x1u<<0)

// FVR288 Configuration

#define	BSEC_FVR288_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR288_FV_0				(0x1u<<0)

// FVR289 Configuration

#define	BSEC_FVR289_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR289_FV_0				(0x1u<<0)

// FVR290 Configuration

#define	BSEC_FVR290_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR290_FV_0				(0x1u<<0)

// FVR291 Configuration

#define	BSEC_FVR291_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR291_FV_0				(0x1u<<0)

// FVR292 Configuration

#define	BSEC_FVR292_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR292_FV_0				(0x1u<<0)

// FVR293 Configuration

#define	BSEC_FVR293_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR293_FV_0				(0x1u<<0)

// FVR294 Configuration

#define	BSEC_FVR294_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR294_FV_0				(0x1u<<0)

// FVR295 Configuration

#define	BSEC_FVR295_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR295_FV_0				(0x1u<<0)

// FVR296 Configuration

#define	BSEC_FVR296_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR296_FV_0				(0x1u<<0)

// FVR297 Configuration

#define	BSEC_FVR297_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR297_FV_0				(0x1u<<0)

// FVR298 Configuration

#define	BSEC_FVR298_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR298_FV_0				(0x1u<<0)

// FVR299 Configuration

#define	BSEC_FVR299_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR299_FV_0				(0x1u<<0)

// FVR300 Configuration

#define	BSEC_FVR300_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR300_FV_0				(0x1u<<0)

// FVR301 Configuration

#define	BSEC_FVR301_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR301_FV_0				(0x1u<<0)

// FVR302 Configuration

#define	BSEC_FVR302_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR302_FV_0				(0x1u<<0)

// FVR303 Configuration

#define	BSEC_FVR303_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR303_FV_0				(0x1u<<0)

// FVR304 Configuration

#define	BSEC_FVR304_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR304_FV_0				(0x1u<<0)

// FVR305 Configuration

#define	BSEC_FVR305_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR305_FV_0				(0x1u<<0)

// FVR306 Configuration

#define	BSEC_FVR306_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR306_FV_0				(0x1u<<0)

// FVR307 Configuration

#define	BSEC_FVR307_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR307_FV_0				(0x1u<<0)

// FVR308 Configuration

#define	BSEC_FVR308_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR308_FV_0				(0x1u<<0)

// FVR309 Configuration

#define	BSEC_FVR309_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR309_FV_0				(0x1u<<0)

// FVR310 Configuration

#define	BSEC_FVR310_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR310_FV_0				(0x1u<<0)

// FVR311 Configuration

#define	BSEC_FVR311_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR311_FV_0				(0x1u<<0)

// FVR312 Configuration

#define	BSEC_FVR312_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR312_FV_0				(0x1u<<0)

// FVR313 Configuration

#define	BSEC_FVR313_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR313_FV_0				(0x1u<<0)

// FVR314 Configuration

#define	BSEC_FVR314_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR314_FV_0				(0x1u<<0)

// FVR315 Configuration

#define	BSEC_FVR315_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR315_FV_0				(0x1u<<0)

// FVR316 Configuration

#define	BSEC_FVR316_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR316_FV_0				(0x1u<<0)

// FVR317 Configuration

#define	BSEC_FVR317_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR317_FV_0				(0x1u<<0)

// FVR318 Configuration

#define	BSEC_FVR318_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR318_FV_0				(0x1u<<0)

// FVR319 Configuration

#define	BSEC_FVR319_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR319_FV_0				(0x1u<<0)

// FVR320 Configuration

#define	BSEC_FVR320_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR320_FV_0				(0x1u<<0)

// FVR321 Configuration

#define	BSEC_FVR321_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR321_FV_0				(0x1u<<0)

// FVR322 Configuration

#define	BSEC_FVR322_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR322_FV_0				(0x1u<<0)

// FVR323 Configuration

#define	BSEC_FVR323_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR323_FV_0				(0x1u<<0)

// FVR324 Configuration

#define	BSEC_FVR324_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR324_FV_0				(0x1u<<0)

// FVR325 Configuration

#define	BSEC_FVR325_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR325_FV_0				(0x1u<<0)

// FVR326 Configuration

#define	BSEC_FVR326_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR326_FV_0				(0x1u<<0)

// FVR327 Configuration

#define	BSEC_FVR327_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR327_FV_0				(0x1u<<0)

// FVR328 Configuration

#define	BSEC_FVR328_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR328_FV_0				(0x1u<<0)

// FVR329 Configuration

#define	BSEC_FVR329_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR329_FV_0				(0x1u<<0)

// FVR330 Configuration

#define	BSEC_FVR330_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR330_FV_0				(0x1u<<0)

// FVR331 Configuration

#define	BSEC_FVR331_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR331_FV_0				(0x1u<<0)

// FVR332 Configuration

#define	BSEC_FVR332_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR332_FV_0				(0x1u<<0)

// FVR333 Configuration

#define	BSEC_FVR333_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR333_FV_0				(0x1u<<0)

// FVR334 Configuration

#define	BSEC_FVR334_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR334_FV_0				(0x1u<<0)

// FVR335 Configuration

#define	BSEC_FVR335_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR335_FV_0				(0x1u<<0)

// FVR336 Configuration

#define	BSEC_FVR336_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR336_FV_0				(0x1u<<0)

// FVR337 Configuration

#define	BSEC_FVR337_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR337_FV_0				(0x1u<<0)

// FVR338 Configuration

#define	BSEC_FVR338_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR338_FV_0				(0x1u<<0)

// FVR339 Configuration

#define	BSEC_FVR339_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR339_FV_0				(0x1u<<0)

// FVR340 Configuration

#define	BSEC_FVR340_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR340_FV_0				(0x1u<<0)

