hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// FVR341 Configuration

#define	BSEC_FVR341_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR341_FV_0				(0x1u<<0)

// FVR342 Configuration

#define	BSEC_FVR342_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR342_FV_0				(0x1u<<0)

// FVR343 Configuration

#define	BSEC_FVR343_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR343_FV_0				(0x1u<<0)

// FVR344 Configuration

#define	BSEC_FVR344_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR344_FV_0				(0x1u<<0)

// FVR345 Configuration

#define	BSEC_FVR345_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR345_FV_0				(0x1u<<0)

// FVR346 Configuration

#define	BSEC_FVR346_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR346_FV_0				(0x1u<<0)

// FVR347 Configuration

#define	BSEC_FVR347_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR347_FV_0				(0x1u<<0)

// FVR348 Configuration

#define	BSEC_FVR348_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR348_FV_0				(0x1u<<0)

// FVR349 Configuration

#define	BSEC_FVR349_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR349_FV_0				(0x1u<<0)

// FVR350 Configuration

#define	BSEC_FVR350_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR350_FV_0				(0x1u<<0)

// FVR351 Configuration

#define	BSEC_FVR351_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR351_FV_0				(0x1u<<0)

// FVR352 Configuration

#define	BSEC_FVR352_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR352_FV_0				(0x1u<<0)

// FVR353 Configuration

#define	BSEC_FVR353_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR353_FV_0				(0x1u<<0)

// FVR354 Configuration

#define	BSEC_FVR354_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR354_FV_0				(0x1u<<0)

// FVR355 Configuration

#define	BSEC_FVR355_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR355_FV_0				(0x1u<<0)

// FVR356 Configuration

#define	BSEC_FVR356_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR356_FV_0				(0x1u<<0)

// FVR357 Configuration

#define	BSEC_FVR357_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR357_FV_0				(0x1u<<0)

// FVR358 Configuration

#define	BSEC_FVR358_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR358_FV_0				(0x1u<<0)

// FVR359 Configuration

#define	BSEC_FVR359_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR359_FV_0				(0x1u<<0)

// FVR360 Configuration

#define	BSEC_FVR360_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR360_FV_0				(0x1u<<0)

// FVR361 Configuration

#define	BSEC_FVR361_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR361_FV_0				(0x1u<<0)

// FVR362 Configuration

#define	BSEC_FVR362_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR362_FV_0				(0x1u<<0)

// FVR363 Configuration

#define	BSEC_FVR363_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR363_FV_0				(0x1u<<0)

// FVR364 Configuration

#define	BSEC_FVR364_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR364_FV_0				(0x1u<<0)

// FVR365 Configuration

#define	BSEC_FVR365_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR365_FV_0				(0x1u<<0)

// FVR366 Configuration

#define	BSEC_FVR366_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR366_FV_0				(0x1u<<0)

// FVR367 Configuration

#define	BSEC_FVR367_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR367_FV_0				(0x1u<<0)

// FVR368 Configuration

#define	BSEC_FVR368_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR368_FV_0				(0x1u<<0)

// FVR369 Configuration

#define	BSEC_FVR369_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR369_FV_0				(0x1u<<0)

// FVR370 Configuration

#define	BSEC_FVR370_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR370_FV_0				(0x1u<<0)

// FVR371 Configuration

#define	BSEC_FVR371_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR371_FV_0				(0x1u<<0)

// FVR372 Configuration

#define	BSEC_FVR372_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR372_FV_0				(0x1u<<0)

// FVR373 Configuration

#define	BSEC_FVR373_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR373_FV_0				(0x1u<<0)

// FVR374 Configuration

#define	BSEC_FVR374_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR374_FV_0				(0x1u<<0)

// FVR375 Configuration

#define	BSEC_FVR375_FV					(0xFFFFFFFFu<<0)
#define	BSEC_FVR375_FV_0				(0x1u<<0)

// SPLOCK0 Configuration

#define	BSEC_SPLOCK0_SPLOCK31			(0x1u<<31)
#define	BSEC_SPLOCK0_SPLOCK30			(0x1u<<30)
#define	BSEC_SPLOCK0_SPLOCK29			(0x1u<<29)
#define	BSEC_SPLOCK0_SPLOCK28			(0x1u<<28)
#define	BSEC_SPLOCK0_SPLOCK27			(0x1u<<27)
#define	BSEC_SPLOCK0_SPLOCK26			(0x1u<<26)
#define	BSEC_SPLOCK0_SPLOCK25			(0x1u<<25)
#define	BSEC_SPLOCK0_SPLOCK24			(0x1u<<24)
#define	BSEC_SPLOCK0_SPLOCK23			(0x1u<<23)
#define	BSEC_SPLOCK0_SPLOCK22			(0x1u<<22)
#define	BSEC_SPLOCK0_SPLOCK21			(0x1u<<21)
#define	BSEC_SPLOCK0_SPLOCK20			(0x1u<<20)
#define	BSEC_SPLOCK0_SPLOCK19			(0x1u<<19)
#define	BSEC_SPLOCK0_SPLOCK18			(0x1u<<18)
#define	BSEC_SPLOCK0_SPLOCK17			(0x1u<<17)
#define	BSEC_SPLOCK0_SPLOCK16			(0x1u<<16)
#define	BSEC_SPLOCK0_SPLOCK15			(0x1u<<15)
#define	BSEC_SPLOCK0_SPLOCK14			(0x1u<<14)
#define	BSEC_SPLOCK0_SPLOCK13			(0x1u<<13)
#define	BSEC_SPLOCK0_SPLOCK12			(0x1u<<12)
#define	BSEC_SPLOCK0_SPLOCK11			(0x1u<<11)
#define	BSEC_SPLOCK0_SPLOCK10			(0x1u<<10)
#define	BSEC_SPLOCK0_SPLOCK9			(0x1u<<9)
#define	BSEC_SPLOCK0_SPLOCK8			(0x1u<<8)
#define	BSEC_SPLOCK0_SPLOCK7			(0x1u<<7)
#define	BSEC_SPLOCK0_SPLOCK6			(0x1u<<6)
#define	BSEC_SPLOCK0_SPLOCK5			(0x1u<<5)
#define	BSEC_SPLOCK0_SPLOCK4			(0x1u<<4)
#define	BSEC_SPLOCK0_SPLOCK3			(0x1u<<3)
#define	BSEC_SPLOCK0_SPLOCK2			(0x1u<<2)
#define	BSEC_SPLOCK0_SPLOCK1			(0x1u<<1)
#define	BSEC_SPLOCK0_SPLOCK0			(0x1u<<0)

#define	BSEC_SPLOCK0_SPLOCK31_B_0X0		(0x0u<<31)
#define	BSEC_SPLOCK0_SPLOCK31_B_0X1		(0x1u<<31)
#define	BSEC_SPLOCK0_SPLOCK30_B_0X0		(0x0u<<30)
#define	BSEC_SPLOCK0_SPLOCK30_B_0X1		(0x1u<<30)
#define	BSEC_SPLOCK0_SPLOCK29_B_0X0		(0x0u<<29)
#define	BSEC_SPLOCK0_SPLOCK29_B_0X1		(0x1u<<29)
#define	BSEC_SPLOCK0_SPLOCK28_B_0X0		(0x0u<<28)
#define	BSEC_SPLOCK0_SPLOCK28_B_0X1		(0x1u<<28)
#define	BSEC_SPLOCK0_SPLOCK27_B_0X0		(0x0u<<27)
#define	BSEC_SPLOCK0_SPLOCK27_B_0X1		(0x1u<<27)
#define	BSEC_SPLOCK0_SPLOCK26_B_0X0		(0x0u<<26)
#define	BSEC_SPLOCK0_SPLOCK26_B_0X1		(0x1u<<26)
#define	BSEC_SPLOCK0_SPLOCK25_B_0X0		(0x0u<<25)
#define	BSEC_SPLOCK0_SPLOCK25_B_0X1		(0x1u<<25)
#define	BSEC_SPLOCK0_SPLOCK24_B_0X0		(0x0u<<24)
#define	BSEC_SPLOCK0_SPLOCK24_B_0X1		(0x1u<<24)
#define	BSEC_SPLOCK0_SPLOCK23_B_0X0		(0x0u<<23)
#define	BSEC_SPLOCK0_SPLOCK23_B_0X1		(0x1u<<23)
#define	BSEC_SPLOCK0_SPLOCK22_B_0X0		(0x0u<<22)
#define	BSEC_SPLOCK0_SPLOCK22_B_0X1		(0x1u<<22)
#define	BSEC_SPLOCK0_SPLOCK21_B_0X0		(0x0u<<21)
#define	BSEC_SPLOCK0_SPLOCK21_B_0X1		(0x1u<<21)
#define	BSEC_SPLOCK0_SPLOCK20_B_0X0		(0x0u<<20)
#define	BSEC_SPLOCK0_SPLOCK20_B_0X1		(0x1u<<20)
#define	BSEC_SPLOCK0_SPLOCK19_B_0X0		(0x0u<<19)
#define	BSEC_SPLOCK0_SPLOCK19_B_0X1		(0x1u<<19)
#define	BSEC_SPLOCK0_SPLOCK18_B_0X0		(0x0u<<18)
#define	BSEC_SPLOCK0_SPLOCK18_B_0X1		(0x1u<<18)
#define	BSEC_SPLOCK0_SPLOCK17_B_0X0		(0x0u<<17)
#define	BSEC_SPLOCK0_SPLOCK17_B_0X1		(0x1u<<17)
#define	BSEC_SPLOCK0_SPLOCK16_B_0X0		(0x0u<<16)
#define	BSEC_SPLOCK0_SPLOCK16_B_0X1		(0x1u<<16)
#define	BSEC_SPLOCK0_SPLOCK15_B_0X0		(0x0u<<15)
#define	BSEC_SPLOCK0_SPLOCK15_B_0X1		(0x1u<<15)
#define	BSEC_SPLOCK0_SPLOCK14_B_0X0		(0x0u<<14)
#define	BSEC_SPLOCK0_SPLOCK14_B_0X1		(0x1u<<14)
#define	BSEC_SPLOCK0_SPLOCK13_B_0X0		(0x0u<<13)
#define	BSEC_SPLOCK0_SPLOCK13_B_0X1		(0x1u<<13)
#define	BSEC_SPLOCK0_SPLOCK12_B_0X0		(0x0u<<12)
#define	BSEC_SPLOCK0_SPLOCK12_B_0X1		(0x1u<<12)
#define	BSEC_SPLOCK0_SPLOCK11_B_0X0		(0x0u<<11)
#define	BSEC_SPLOCK0_SPLOCK11_B_0X1		(0x1u<<11)
#define	BSEC_SPLOCK0_SPLOCK10_B_0X0		(0x0u<<10)
#define	BSEC_SPLOCK0_SPLOCK10_B_0X1		(0x1u<<10)
#define	BSEC_SPLOCK0_SPLOCK9_B_0X0		(0x0u<<9)
#define	BSEC_SPLOCK0_SPLOCK9_B_0X1		(0x1u<<9)
#define	BSEC_SPLOCK0_SPLOCK8_B_0X0		(0x0u<<8)
#define	BSEC_SPLOCK0_SPLOCK8_B_0X1		(0x1u<<8)
#define	BSEC_SPLOCK0_SPLOCK7_B_0X0		(0x0u<<7)
#define	BSEC_SPLOCK0_SPLOCK7_B_0X1		(0x1u<<7)
#define	BSEC_SPLOCK0_SPLOCK6_B_0X0		(0x0u<<6)
#define	BSEC_SPLOCK0_SPLOCK6_B_0X1		(0x1u<<6)
#define	BSEC_SPLOCK0_SPLOCK5_B_0X0		(0x0u<<5)
#define	BSEC_SPLOCK0_SPLOCK5_B_0X1		(0x1u<<5)
#define	BSEC_SPLOCK0_SPLOCK4_B_0X0		(0x0u<<4)
#define	BSEC_SPLOCK0_SPLOCK4_B_0X1		(0x1u<<4)
#define	BSEC_SPLOCK0_SPLOCK3_B_0X0		(0x0u<<3)
#define	BSEC_SPLOCK0_SPLOCK3_B_0X1		(0x1u<<3)
#define	BSEC_SPLOCK0_SPLOCK2_B_0X0		(0x0u<<2)
#define	BSEC_SPLOCK0_SPLOCK2_B_0X1		(0x1u<<2)
#define	BSEC_SPLOCK0_SPLOCK1_B_0X0		(0x0u<<1)
#define	BSEC_SPLOCK0_SPLOCK1_B_0X1		(0x1u<<1)
#define	BSEC_SPLOCK0_SPLOCK0_B_0X0		(0x0u<<0)
#define	BSEC_SPLOCK0_SPLOCK0_B_0X1		(0x1u<<0)

