hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SPLOCK1 Configuration

#define	BSEC_SPLOCK1_SPLOCK63			(0x1u<<31)
#define	BSEC_SPLOCK1_SPLOCK62			(0x1u<<30)
#define	BSEC_SPLOCK1_SPLOCK61			(0x1u<<29)
#define	BSEC_SPLOCK1_SPLOCK60			(0x1u<<28)
#define	BSEC_SPLOCK1_SPLOCK59			(0x1u<<27)
#define	BSEC_SPLOCK1_SPLOCK58			(0x1u<<26)
#define	BSEC_SPLOCK1_SPLOCK57			(0x1u<<25)
#define	BSEC_SPLOCK1_SPLOCK56			(0x1u<<24)
#define	BSEC_SPLOCK1_SPLOCK55			(0x1u<<23)
#define	BSEC_SPLOCK1_SPLOCK54			(0x1u<<22)
#define	BSEC_SPLOCK1_SPLOCK53			(0x1u<<21)
#define	BSEC_SPLOCK1_SPLOCK52			(0x1u<<20)
#define	BSEC_SPLOCK1_SPLOCK51			(0x1u<<19)
#define	BSEC_SPLOCK1_SPLOCK50			(0x1u<<18)
#define	BSEC_SPLOCK1_SPLOCK49			(0x1u<<17)
#define	BSEC_SPLOCK1_SPLOCK48			(0x1u<<16)
#define	BSEC_SPLOCK1_SPLOCK47			(0x1u<<15)
#define	BSEC_SPLOCK1_SPLOCK46			(0x1u<<14)
#define	BSEC_SPLOCK1_SPLOCK45			(0x1u<<13)
#define	BSEC_SPLOCK1_SPLOCK44			(0x1u<<12)
#define	BSEC_SPLOCK1_SPLOCK43			(0x1u<<11)
#define	BSEC_SPLOCK1_SPLOCK42			(0x1u<<10)
#define	BSEC_SPLOCK1_SPLOCK41			(0x1u<<9)
#define	BSEC_SPLOCK1_SPLOCK40			(0x1u<<8)
#define	BSEC_SPLOCK1_SPLOCK39			(0x1u<<7)
#define	BSEC_SPLOCK1_SPLOCK38			(0x1u<<6)
#define	BSEC_SPLOCK1_SPLOCK37			(0x1u<<5)
#define	BSEC_SPLOCK1_SPLOCK36			(0x1u<<4)
#define	BSEC_SPLOCK1_SPLOCK35			(0x1u<<3)
#define	BSEC_SPLOCK1_SPLOCK34			(0x1u<<2)
#define	BSEC_SPLOCK1_SPLOCK33			(0x1u<<1)
#define	BSEC_SPLOCK1_SPLOCK32			(0x1u<<0)

#define	BSEC_SPLOCK1_SPLOCK63_B_0X0		(0x0u<<31)
#define	BSEC_SPLOCK1_SPLOCK63_B_0X1		(0x1u<<31)
#define	BSEC_SPLOCK1_SPLOCK62_B_0X0		(0x0u<<30)
#define	BSEC_SPLOCK1_SPLOCK62_B_0X1		(0x1u<<30)
#define	BSEC_SPLOCK1_SPLOCK61_B_0X0		(0x0u<<29)
#define	BSEC_SPLOCK1_SPLOCK61_B_0X1		(0x1u<<29)
#define	BSEC_SPLOCK1_SPLOCK60_B_0X0		(0x0u<<28)
#define	BSEC_SPLOCK1_SPLOCK60_B_0X1		(0x1u<<28)
#define	BSEC_SPLOCK1_SPLOCK59_B_0X0		(0x0u<<27)
#define	BSEC_SPLOCK1_SPLOCK59_B_0X1		(0x1u<<27)
#define	BSEC_SPLOCK1_SPLOCK58_B_0X0		(0x0u<<26)
#define	BSEC_SPLOCK1_SPLOCK58_B_0X1		(0x1u<<26)
#define	BSEC_SPLOCK1_SPLOCK57_B_0X0		(0x0u<<25)
#define	BSEC_SPLOCK1_SPLOCK57_B_0X1		(0x1u<<25)
#define	BSEC_SPLOCK1_SPLOCK56_B_0X0		(0x0u<<24)
#define	BSEC_SPLOCK1_SPLOCK56_B_0X1		(0x1u<<24)
#define	BSEC_SPLOCK1_SPLOCK55_B_0X0		(0x0u<<23)
#define	BSEC_SPLOCK1_SPLOCK55_B_0X1		(0x1u<<23)
#define	BSEC_SPLOCK1_SPLOCK54_B_0X0		(0x0u<<22)
#define	BSEC_SPLOCK1_SPLOCK54_B_0X1		(0x1u<<22)
#define	BSEC_SPLOCK1_SPLOCK53_B_0X0		(0x0u<<21)
#define	BSEC_SPLOCK1_SPLOCK53_B_0X1		(0x1u<<21)
#define	BSEC_SPLOCK1_SPLOCK52_B_0X0		(0x0u<<20)
#define	BSEC_SPLOCK1_SPLOCK52_B_0X1		(0x1u<<20)
#define	BSEC_SPLOCK1_SPLOCK51_B_0X0		(0x0u<<19)
#define	BSEC_SPLOCK1_SPLOCK51_B_0X1		(0x1u<<19)
#define	BSEC_SPLOCK1_SPLOCK50_B_0X0		(0x0u<<18)
#define	BSEC_SPLOCK1_SPLOCK50_B_0X1		(0x1u<<18)
#define	BSEC_SPLOCK1_SPLOCK49_B_0X0		(0x0u<<17)
#define	BSEC_SPLOCK1_SPLOCK49_B_0X1		(0x1u<<17)
#define	BSEC_SPLOCK1_SPLOCK48_B_0X0		(0x0u<<16)
#define	BSEC_SPLOCK1_SPLOCK48_B_0X1		(0x1u<<16)
#define	BSEC_SPLOCK1_SPLOCK47_B_0X0		(0x0u<<15)
#define	BSEC_SPLOCK1_SPLOCK47_B_0X1		(0x1u<<15)
#define	BSEC_SPLOCK1_SPLOCK46_B_0X0		(0x0u<<14)
#define	BSEC_SPLOCK1_SPLOCK46_B_0X1		(0x1u<<14)
#define	BSEC_SPLOCK1_SPLOCK45_B_0X0		(0x0u<<13)
#define	BSEC_SPLOCK1_SPLOCK45_B_0X1		(0x1u<<13)
#define	BSEC_SPLOCK1_SPLOCK44_B_0X0		(0x0u<<12)
#define	BSEC_SPLOCK1_SPLOCK44_B_0X1		(0x1u<<12)
#define	BSEC_SPLOCK1_SPLOCK43_B_0X0		(0x0u<<11)
#define	BSEC_SPLOCK1_SPLOCK43_B_0X1		(0x1u<<11)
#define	BSEC_SPLOCK1_SPLOCK42_B_0X0		(0x0u<<10)
#define	BSEC_SPLOCK1_SPLOCK42_B_0X1		(0x1u<<10)
#define	BSEC_SPLOCK1_SPLOCK41_B_0X0		(0x0u<<9)
#define	BSEC_SPLOCK1_SPLOCK41_B_0X1		(0x1u<<9)
#define	BSEC_SPLOCK1_SPLOCK40_B_0X0		(0x0u<<8)
#define	BSEC_SPLOCK1_SPLOCK40_B_0X1		(0x1u<<8)
#define	BSEC_SPLOCK1_SPLOCK39_B_0X0		(0x0u<<7)
#define	BSEC_SPLOCK1_SPLOCK39_B_0X1		(0x1u<<7)
#define	BSEC_SPLOCK1_SPLOCK38_B_0X0		(0x0u<<6)
#define	BSEC_SPLOCK1_SPLOCK38_B_0X1		(0x1u<<6)
#define	BSEC_SPLOCK1_SPLOCK37_B_0X0		(0x0u<<5)
#define	BSEC_SPLOCK1_SPLOCK37_B_0X1		(0x1u<<5)
#define	BSEC_SPLOCK1_SPLOCK36_B_0X0		(0x0u<<4)
#define	BSEC_SPLOCK1_SPLOCK36_B_0X1		(0x1u<<4)
#define	BSEC_SPLOCK1_SPLOCK35_B_0X0		(0x0u<<3)
#define	BSEC_SPLOCK1_SPLOCK35_B_0X1		(0x1u<<3)
#define	BSEC_SPLOCK1_SPLOCK34_B_0X0		(0x0u<<2)
#define	BSEC_SPLOCK1_SPLOCK34_B_0X1		(0x1u<<2)
#define	BSEC_SPLOCK1_SPLOCK33_B_0X0		(0x0u<<1)
#define	BSEC_SPLOCK1_SPLOCK33_B_0X1		(0x1u<<1)
#define	BSEC_SPLOCK1_SPLOCK32_B_0X0		(0x0u<<0)
#define	BSEC_SPLOCK1_SPLOCK32_B_0X1		(0x1u<<0)

// SPLOCK2 Configuration

#define	BSEC_SPLOCK2_SPLOCK95			(0x1u<<31)
#define	BSEC_SPLOCK2_SPLOCK94			(0x1u<<30)
#define	BSEC_SPLOCK2_SPLOCK93			(0x1u<<29)
#define	BSEC_SPLOCK2_SPLOCK92			(0x1u<<28)
#define	BSEC_SPLOCK2_SPLOCK91			(0x1u<<27)
#define	BSEC_SPLOCK2_SPLOCK90			(0x1u<<26)
#define	BSEC_SPLOCK2_SPLOCK89			(0x1u<<25)
#define	BSEC_SPLOCK2_SPLOCK88			(0x1u<<24)
#define	BSEC_SPLOCK2_SPLOCK87			(0x1u<<23)
#define	BSEC_SPLOCK2_SPLOCK86			(0x1u<<22)
#define	BSEC_SPLOCK2_SPLOCK85			(0x1u<<21)
#define	BSEC_SPLOCK2_SPLOCK84			(0x1u<<20)
#define	BSEC_SPLOCK2_SPLOCK83			(0x1u<<19)
#define	BSEC_SPLOCK2_SPLOCK82			(0x1u<<18)
#define	BSEC_SPLOCK2_SPLOCK81			(0x1u<<17)
#define	BSEC_SPLOCK2_SPLOCK80			(0x1u<<16)
#define	BSEC_SPLOCK2_SPLOCK79			(0x1u<<15)
#define	BSEC_SPLOCK2_SPLOCK78			(0x1u<<14)
#define	BSEC_SPLOCK2_SPLOCK77			(0x1u<<13)
#define	BSEC_SPLOCK2_SPLOCK76			(0x1u<<12)
#define	BSEC_SPLOCK2_SPLOCK75			(0x1u<<11)
#define	BSEC_SPLOCK2_SPLOCK74			(0x1u<<10)
#define	BSEC_SPLOCK2_SPLOCK73			(0x1u<<9)
#define	BSEC_SPLOCK2_SPLOCK72			(0x1u<<8)
#define	BSEC_SPLOCK2_SPLOCK71			(0x1u<<7)
#define	BSEC_SPLOCK2_SPLOCK70			(0x1u<<6)
#define	BSEC_SPLOCK2_SPLOCK69			(0x1u<<5)
#define	BSEC_SPLOCK2_SPLOCK68			(0x1u<<4)
#define	BSEC_SPLOCK2_SPLOCK67			(0x1u<<3)
#define	BSEC_SPLOCK2_SPLOCK66			(0x1u<<2)
#define	BSEC_SPLOCK2_SPLOCK65			(0x1u<<1)
#define	BSEC_SPLOCK2_SPLOCK64			(0x1u<<0)

#define	BSEC_SPLOCK2_SPLOCK95_B_0X0		(0x0u<<31)
#define	BSEC_SPLOCK2_SPLOCK95_B_0X1		(0x1u<<31)
#define	BSEC_SPLOCK2_SPLOCK94_B_0X0		(0x0u<<30)
#define	BSEC_SPLOCK2_SPLOCK94_B_0X1		(0x1u<<30)
#define	BSEC_SPLOCK2_SPLOCK93_B_0X0		(0x0u<<29)
#define	BSEC_SPLOCK2_SPLOCK93_B_0X1		(0x1u<<29)
#define	BSEC_SPLOCK2_SPLOCK92_B_0X0		(0x0u<<28)
#define	BSEC_SPLOCK2_SPLOCK92_B_0X1		(0x1u<<28)
#define	BSEC_SPLOCK2_SPLOCK91_B_0X0		(0x0u<<27)
#define	BSEC_SPLOCK2_SPLOCK91_B_0X1		(0x1u<<27)
#define	BSEC_SPLOCK2_SPLOCK90_B_0X0		(0x0u<<26)
#define	BSEC_SPLOCK2_SPLOCK90_B_0X1		(0x1u<<26)
#define	BSEC_SPLOCK2_SPLOCK89_B_0X0		(0x0u<<25)
#define	BSEC_SPLOCK2_SPLOCK89_B_0X1		(0x1u<<25)
#define	BSEC_SPLOCK2_SPLOCK88_B_0X0		(0x0u<<24)
#define	BSEC_SPLOCK2_SPLOCK88_B_0X1		(0x1u<<24)
#define	BSEC_SPLOCK2_SPLOCK87_B_0X0		(0x0u<<23)
#define	BSEC_SPLOCK2_SPLOCK87_B_0X1		(0x1u<<23)
#define	BSEC_SPLOCK2_SPLOCK86_B_0X0		(0x0u<<22)
#define	BSEC_SPLOCK2_SPLOCK86_B_0X1		(0x1u<<22)
#define	BSEC_SPLOCK2_SPLOCK85_B_0X0		(0x0u<<21)
#define	BSEC_SPLOCK2_SPLOCK85_B_0X1		(0x1u<<21)
#define	BSEC_SPLOCK2_SPLOCK84_B_0X0		(0x0u<<20)
#define	BSEC_SPLOCK2_SPLOCK84_B_0X1		(0x1u<<20)
#define	BSEC_SPLOCK2_SPLOCK83_B_0X0		(0x0u<<19)
#define	BSEC_SPLOCK2_SPLOCK83_B_0X1		(0x1u<<19)
#define	BSEC_SPLOCK2_SPLOCK82_B_0X0		(0x0u<<18)
#define	BSEC_SPLOCK2_SPLOCK82_B_0X1		(0x1u<<18)
#define	BSEC_SPLOCK2_SPLOCK81_B_0X0		(0x0u<<17)
#define	BSEC_SPLOCK2_SPLOCK81_B_0X1		(0x1u<<17)
#define	BSEC_SPLOCK2_SPLOCK80_B_0X0		(0x0u<<16)
#define	BSEC_SPLOCK2_SPLOCK80_B_0X1		(0x1u<<16)
#define	BSEC_SPLOCK2_SPLOCK79_B_0X0		(0x0u<<15)
#define	BSEC_SPLOCK2_SPLOCK79_B_0X1		(0x1u<<15)
#define	BSEC_SPLOCK2_SPLOCK78_B_0X0		(0x0u<<14)
#define	BSEC_SPLOCK2_SPLOCK78_B_0X1		(0x1u<<14)
#define	BSEC_SPLOCK2_SPLOCK77_B_0X0		(0x0u<<13)
#define	BSEC_SPLOCK2_SPLOCK77_B_0X1		(0x1u<<13)
#define	BSEC_SPLOCK2_SPLOCK76_B_0X0		(0x0u<<12)
#define	BSEC_SPLOCK2_SPLOCK76_B_0X1		(0x1u<<12)
#define	BSEC_SPLOCK2_SPLOCK75_B_0X0		(0x0u<<11)
#define	BSEC_SPLOCK2_SPLOCK75_B_0X1		(0x1u<<11)
#define	BSEC_SPLOCK2_SPLOCK74_B_0X0		(0x0u<<10)
#define	BSEC_SPLOCK2_SPLOCK74_B_0X1		(0x1u<<10)
#define	BSEC_SPLOCK2_SPLOCK73_B_0X0		(0x0u<<9)
#define	BSEC_SPLOCK2_SPLOCK73_B_0X1		(0x1u<<9)
#define	BSEC_SPLOCK2_SPLOCK72_B_0X0		(0x0u<<8)
#define	BSEC_SPLOCK2_SPLOCK72_B_0X1		(0x1u<<8)
#define	BSEC_SPLOCK2_SPLOCK71_B_0X0		(0x0u<<7)
#define	BSEC_SPLOCK2_SPLOCK71_B_0X1		(0x1u<<7)
#define	BSEC_SPLOCK2_SPLOCK70_B_0X0		(0x0u<<6)
#define	BSEC_SPLOCK2_SPLOCK70_B_0X1		(0x1u<<6)
#define	BSEC_SPLOCK2_SPLOCK69_B_0X0		(0x0u<<5)
#define	BSEC_SPLOCK2_SPLOCK69_B_0X1		(0x1u<<5)
#define	BSEC_SPLOCK2_SPLOCK68_B_0X0		(0x0u<<4)
#define	BSEC_SPLOCK2_SPLOCK68_B_0X1		(0x1u<<4)
#define	BSEC_SPLOCK2_SPLOCK67_B_0X0		(0x0u<<3)
#define	BSEC_SPLOCK2_SPLOCK67_B_0X1		(0x1u<<3)
#define	BSEC_SPLOCK2_SPLOCK66_B_0X0		(0x0u<<2)
#define	BSEC_SPLOCK2_SPLOCK66_B_0X1		(0x1u<<2)
#define	BSEC_SPLOCK2_SPLOCK65_B_0X0		(0x0u<<1)
#define	BSEC_SPLOCK2_SPLOCK65_B_0X1		(0x1u<<1)
#define	BSEC_SPLOCK2_SPLOCK64_B_0X0		(0x0u<<0)
#define	BSEC_SPLOCK2_SPLOCK64_B_0X1		(0x1u<<0)

// SPLOCK3 Configuration

#define	BSEC_SPLOCK3_SPLOCK127			(0x1u<<31)
#define	BSEC_SPLOCK3_SPLOCK126			(0x1u<<30)
#define	BSEC_SPLOCK3_SPLOCK125			(0x1u<<29)
#define	BSEC_SPLOCK3_SPLOCK124			(0x1u<<28)
#define	BSEC_SPLOCK3_SPLOCK123			(0x1u<<27)
#define	BSEC_SPLOCK3_SPLOCK122			(0x1u<<26)
#define	BSEC_SPLOCK3_SPLOCK121			(0x1u<<25)
#define	BSEC_SPLOCK3_SPLOCK120			(0x1u<<24)
#define	BSEC_SPLOCK3_SPLOCK119			(0x1u<<23)
#define	BSEC_SPLOCK3_SPLOCK118			(0x1u<<22)
#define	BSEC_SPLOCK3_SPLOCK117			(0x1u<<21)
#define	BSEC_SPLOCK3_SPLOCK116			(0x1u<<20)
#define	BSEC_SPLOCK3_SPLOCK115			(0x1u<<19)
#define	BSEC_SPLOCK3_SPLOCK114			(0x1u<<18)
#define	BSEC_SPLOCK3_SPLOCK113			(0x1u<<17)
#define	BSEC_SPLOCK3_SPLOCK112			(0x1u<<16)
#define	BSEC_SPLOCK3_SPLOCK111			(0x1u<<15)
#define	BSEC_SPLOCK3_SPLOCK110			(0x1u<<14)
#define	BSEC_SPLOCK3_SPLOCK109			(0x1u<<13)
#define	BSEC_SPLOCK3_SPLOCK108			(0x1u<<12)
#define	BSEC_SPLOCK3_SPLOCK107			(0x1u<<11)
#define	BSEC_SPLOCK3_SPLOCK106			(0x1u<<10)
#define	BSEC_SPLOCK3_SPLOCK105			(0x1u<<9)
#define	BSEC_SPLOCK3_SPLOCK104			(0x1u<<8)
#define	BSEC_SPLOCK3_SPLOCK103			(0x1u<<7)
#define	BSEC_SPLOCK3_SPLOCK102			(0x1u<<6)
#define	BSEC_SPLOCK3_SPLOCK101			(0x1u<<5)
#define	BSEC_SPLOCK3_SPLOCK100			(0x1u<<4)
#define	BSEC_SPLOCK3_SPLOCK99			(0x1u<<3)
#define	BSEC_SPLOCK3_SPLOCK98			(0x1u<<2)
#define	BSEC_SPLOCK3_SPLOCK97			(0x1u<<1)
#define	BSEC_SPLOCK3_SPLOCK96			(0x1u<<0)

#define	BSEC_SPLOCK3_SPLOCK127_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK3_SPLOCK127_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK3_SPLOCK126_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK3_SPLOCK126_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK3_SPLOCK125_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK3_SPLOCK125_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK3_SPLOCK124_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK3_SPLOCK124_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK3_SPLOCK123_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK3_SPLOCK123_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK3_SPLOCK122_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK3_SPLOCK122_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK3_SPLOCK121_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK3_SPLOCK121_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK3_SPLOCK120_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK3_SPLOCK120_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK3_SPLOCK119_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK3_SPLOCK119_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK3_SPLOCK118_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK3_SPLOCK118_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK3_SPLOCK117_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK3_SPLOCK117_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK3_SPLOCK116_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK3_SPLOCK116_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK3_SPLOCK115_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK3_SPLOCK115_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK3_SPLOCK114_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK3_SPLOCK114_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK3_SPLOCK113_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK3_SPLOCK113_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK3_SPLOCK112_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK3_SPLOCK112_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK3_SPLOCK111_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK3_SPLOCK111_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK3_SPLOCK110_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK3_SPLOCK110_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK3_SPLOCK109_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK3_SPLOCK109_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK3_SPLOCK108_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK3_SPLOCK108_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK3_SPLOCK107_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK3_SPLOCK107_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK3_SPLOCK106_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK3_SPLOCK106_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK3_SPLOCK105_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK3_SPLOCK105_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK3_SPLOCK104_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK3_SPLOCK104_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK3_SPLOCK103_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK3_SPLOCK103_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK3_SPLOCK102_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK3_SPLOCK102_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK3_SPLOCK101_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK3_SPLOCK101_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK3_SPLOCK100_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK3_SPLOCK100_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK3_SPLOCK99_B_0X0		(0x0u<<3)
#define	BSEC_SPLOCK3_SPLOCK99_B_0X1		(0x1u<<3)
#define	BSEC_SPLOCK3_SPLOCK98_B_0X0		(0x0u<<2)
#define	BSEC_SPLOCK3_SPLOCK98_B_0X1		(0x1u<<2)
#define	BSEC_SPLOCK3_SPLOCK97_B_0X0		(0x0u<<1)
#define	BSEC_SPLOCK3_SPLOCK97_B_0X1		(0x1u<<1)
#define	BSEC_SPLOCK3_SPLOCK96_B_0X0		(0x0u<<0)
#define	BSEC_SPLOCK3_SPLOCK96_B_0X1		(0x1u<<0)

// SPLOCK4 Configuration

#define	BSEC_SPLOCK4_SPLOCK159			(0x1u<<31)
#define	BSEC_SPLOCK4_SPLOCK158			(0x1u<<30)
#define	BSEC_SPLOCK4_SPLOCK157			(0x1u<<29)
#define	BSEC_SPLOCK4_SPLOCK156			(0x1u<<28)
#define	BSEC_SPLOCK4_SPLOCK155			(0x1u<<27)
#define	BSEC_SPLOCK4_SPLOCK154			(0x1u<<26)
#define	BSEC_SPLOCK4_SPLOCK153			(0x1u<<25)
#define	BSEC_SPLOCK4_SPLOCK152			(0x1u<<24)
#define	BSEC_SPLOCK4_SPLOCK151			(0x1u<<23)
#define	BSEC_SPLOCK4_SPLOCK150			(0x1u<<22)
#define	BSEC_SPLOCK4_SPLOCK149			(0x1u<<21)
#define	BSEC_SPLOCK4_SPLOCK148			(0x1u<<20)
#define	BSEC_SPLOCK4_SPLOCK147			(0x1u<<19)
#define	BSEC_SPLOCK4_SPLOCK146			(0x1u<<18)
#define	BSEC_SPLOCK4_SPLOCK145			(0x1u<<17)
#define	BSEC_SPLOCK4_SPLOCK144			(0x1u<<16)
#define	BSEC_SPLOCK4_SPLOCK143			(0x1u<<15)
#define	BSEC_SPLOCK4_SPLOCK142			(0x1u<<14)
#define	BSEC_SPLOCK4_SPLOCK141			(0x1u<<13)
#define	BSEC_SPLOCK4_SPLOCK140			(0x1u<<12)
#define	BSEC_SPLOCK4_SPLOCK139			(0x1u<<11)
#define	BSEC_SPLOCK4_SPLOCK138			(0x1u<<10)
#define	BSEC_SPLOCK4_SPLOCK137			(0x1u<<9)
#define	BSEC_SPLOCK4_SPLOCK136			(0x1u<<8)
#define	BSEC_SPLOCK4_SPLOCK135			(0x1u<<7)
#define	BSEC_SPLOCK4_SPLOCK134			(0x1u<<6)
#define	BSEC_SPLOCK4_SPLOCK133			(0x1u<<5)
#define	BSEC_SPLOCK4_SPLOCK132			(0x1u<<4)
#define	BSEC_SPLOCK4_SPLOCK131			(0x1u<<3)
#define	BSEC_SPLOCK4_SPLOCK130			(0x1u<<2)
#define	BSEC_SPLOCK4_SPLOCK129			(0x1u<<1)
#define	BSEC_SPLOCK4_SPLOCK128			(0x1u<<0)

#define	BSEC_SPLOCK4_SPLOCK159_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK4_SPLOCK159_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK4_SPLOCK158_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK4_SPLOCK158_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK4_SPLOCK157_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK4_SPLOCK157_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK4_SPLOCK156_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK4_SPLOCK156_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK4_SPLOCK155_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK4_SPLOCK155_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK4_SPLOCK154_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK4_SPLOCK154_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK4_SPLOCK153_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK4_SPLOCK153_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK4_SPLOCK152_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK4_SPLOCK152_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK4_SPLOCK151_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK4_SPLOCK151_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK4_SPLOCK150_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK4_SPLOCK150_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK4_SPLOCK149_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK4_SPLOCK149_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK4_SPLOCK148_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK4_SPLOCK148_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK4_SPLOCK147_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK4_SPLOCK147_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK4_SPLOCK146_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK4_SPLOCK146_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK4_SPLOCK145_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK4_SPLOCK145_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK4_SPLOCK144_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK4_SPLOCK144_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK4_SPLOCK143_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK4_SPLOCK143_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK4_SPLOCK142_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK4_SPLOCK142_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK4_SPLOCK141_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK4_SPLOCK141_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK4_SPLOCK140_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK4_SPLOCK140_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK4_SPLOCK139_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK4_SPLOCK139_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK4_SPLOCK138_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK4_SPLOCK138_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK4_SPLOCK137_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK4_SPLOCK137_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK4_SPLOCK136_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK4_SPLOCK136_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK4_SPLOCK135_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK4_SPLOCK135_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK4_SPLOCK134_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK4_SPLOCK134_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK4_SPLOCK133_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK4_SPLOCK133_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK4_SPLOCK132_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK4_SPLOCK132_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK4_SPLOCK131_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK4_SPLOCK131_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK4_SPLOCK130_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK4_SPLOCK130_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK4_SPLOCK129_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK4_SPLOCK129_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK4_SPLOCK128_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK4_SPLOCK128_B_0X1	(0x1u<<0)

// SPLOCK5 Configuration

#define	BSEC_SPLOCK5_SPLOCK191			(0x1u<<31)
#define	BSEC_SPLOCK5_SPLOCK190			(0x1u<<30)
#define	BSEC_SPLOCK5_SPLOCK189			(0x1u<<29)
#define	BSEC_SPLOCK5_SPLOCK188			(0x1u<<28)
#define	BSEC_SPLOCK5_SPLOCK187			(0x1u<<27)
#define	BSEC_SPLOCK5_SPLOCK186			(0x1u<<26)
#define	BSEC_SPLOCK5_SPLOCK185			(0x1u<<25)
#define	BSEC_SPLOCK5_SPLOCK184			(0x1u<<24)
#define	BSEC_SPLOCK5_SPLOCK183			(0x1u<<23)
#define	BSEC_SPLOCK5_SPLOCK182			(0x1u<<22)
#define	BSEC_SPLOCK5_SPLOCK181			(0x1u<<21)
#define	BSEC_SPLOCK5_SPLOCK180			(0x1u<<20)
#define	BSEC_SPLOCK5_SPLOCK179			(0x1u<<19)
#define	BSEC_SPLOCK5_SPLOCK178			(0x1u<<18)
#define	BSEC_SPLOCK5_SPLOCK177			(0x1u<<17)
#define	BSEC_SPLOCK5_SPLOCK176			(0x1u<<16)
#define	BSEC_SPLOCK5_SPLOCK175			(0x1u<<15)
#define	BSEC_SPLOCK5_SPLOCK174			(0x1u<<14)
#define	BSEC_SPLOCK5_SPLOCK173			(0x1u<<13)
#define	BSEC_SPLOCK5_SPLOCK172			(0x1u<<12)
#define	BSEC_SPLOCK5_SPLOCK171			(0x1u<<11)
#define	BSEC_SPLOCK5_SPLOCK170			(0x1u<<10)
#define	BSEC_SPLOCK5_SPLOCK169			(0x1u<<9)
#define	BSEC_SPLOCK5_SPLOCK168			(0x1u<<8)
#define	BSEC_SPLOCK5_SPLOCK167			(0x1u<<7)
#define	BSEC_SPLOCK5_SPLOCK166			(0x1u<<6)
#define	BSEC_SPLOCK5_SPLOCK165			(0x1u<<5)
#define	BSEC_SPLOCK5_SPLOCK164			(0x1u<<4)
#define	BSEC_SPLOCK5_SPLOCK163			(0x1u<<3)
#define	BSEC_SPLOCK5_SPLOCK162			(0x1u<<2)
#define	BSEC_SPLOCK5_SPLOCK161			(0x1u<<1)
#define	BSEC_SPLOCK5_SPLOCK160			(0x1u<<0)

#define	BSEC_SPLOCK5_SPLOCK191_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK5_SPLOCK191_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK5_SPLOCK190_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK5_SPLOCK190_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK5_SPLOCK189_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK5_SPLOCK189_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK5_SPLOCK188_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK5_SPLOCK188_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK5_SPLOCK187_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK5_SPLOCK187_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK5_SPLOCK186_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK5_SPLOCK186_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK5_SPLOCK185_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK5_SPLOCK185_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK5_SPLOCK184_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK5_SPLOCK184_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK5_SPLOCK183_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK5_SPLOCK183_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK5_SPLOCK182_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK5_SPLOCK182_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK5_SPLOCK181_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK5_SPLOCK181_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK5_SPLOCK180_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK5_SPLOCK180_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK5_SPLOCK179_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK5_SPLOCK179_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK5_SPLOCK178_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK5_SPLOCK178_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK5_SPLOCK177_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK5_SPLOCK177_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK5_SPLOCK176_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK5_SPLOCK176_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK5_SPLOCK175_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK5_SPLOCK175_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK5_SPLOCK174_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK5_SPLOCK174_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK5_SPLOCK173_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK5_SPLOCK173_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK5_SPLOCK172_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK5_SPLOCK172_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK5_SPLOCK171_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK5_SPLOCK171_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK5_SPLOCK170_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK5_SPLOCK170_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK5_SPLOCK169_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK5_SPLOCK169_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK5_SPLOCK168_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK5_SPLOCK168_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK5_SPLOCK167_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK5_SPLOCK167_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK5_SPLOCK166_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK5_SPLOCK166_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK5_SPLOCK165_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK5_SPLOCK165_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK5_SPLOCK164_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK5_SPLOCK164_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK5_SPLOCK163_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK5_SPLOCK163_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK5_SPLOCK162_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK5_SPLOCK162_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK5_SPLOCK161_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK5_SPLOCK161_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK5_SPLOCK160_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK5_SPLOCK160_B_0X1	(0x1u<<0)

// SPLOCK6 Configuration

#define	BSEC_SPLOCK6_SPLOCK223			(0x1u<<31)
#define	BSEC_SPLOCK6_SPLOCK222			(0x1u<<30)
#define	BSEC_SPLOCK6_SPLOCK221			(0x1u<<29)
#define	BSEC_SPLOCK6_SPLOCK220			(0x1u<<28)
#define	BSEC_SPLOCK6_SPLOCK219			(0x1u<<27)
#define	BSEC_SPLOCK6_SPLOCK218			(0x1u<<26)
#define	BSEC_SPLOCK6_SPLOCK217			(0x1u<<25)
#define	BSEC_SPLOCK6_SPLOCK216			(0x1u<<24)
#define	BSEC_SPLOCK6_SPLOCK215			(0x1u<<23)
#define	BSEC_SPLOCK6_SPLOCK214			(0x1u<<22)
#define	BSEC_SPLOCK6_SPLOCK213			(0x1u<<21)
#define	BSEC_SPLOCK6_SPLOCK212			(0x1u<<20)
#define	BSEC_SPLOCK6_SPLOCK211			(0x1u<<19)
#define	BSEC_SPLOCK6_SPLOCK210			(0x1u<<18)
#define	BSEC_SPLOCK6_SPLOCK209			(0x1u<<17)
#define	BSEC_SPLOCK6_SPLOCK208			(0x1u<<16)
#define	BSEC_SPLOCK6_SPLOCK207			(0x1u<<15)
#define	BSEC_SPLOCK6_SPLOCK206			(0x1u<<14)
#define	BSEC_SPLOCK6_SPLOCK205			(0x1u<<13)
#define	BSEC_SPLOCK6_SPLOCK204			(0x1u<<12)
#define	BSEC_SPLOCK6_SPLOCK203			(0x1u<<11)
#define	BSEC_SPLOCK6_SPLOCK202			(0x1u<<10)
#define	BSEC_SPLOCK6_SPLOCK201			(0x1u<<9)
#define	BSEC_SPLOCK6_SPLOCK200			(0x1u<<8)
#define	BSEC_SPLOCK6_SPLOCK199			(0x1u<<7)
#define	BSEC_SPLOCK6_SPLOCK198			(0x1u<<6)
#define	BSEC_SPLOCK6_SPLOCK197			(0x1u<<5)
#define	BSEC_SPLOCK6_SPLOCK196			(0x1u<<4)
#define	BSEC_SPLOCK6_SPLOCK195			(0x1u<<3)
#define	BSEC_SPLOCK6_SPLOCK194			(0x1u<<2)
#define	BSEC_SPLOCK6_SPLOCK193			(0x1u<<1)
#define	BSEC_SPLOCK6_SPLOCK192			(0x1u<<0)

