hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SPLOCK6_SPLOCK223_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK6_SPLOCK223_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK6_SPLOCK222_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK6_SPLOCK222_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK6_SPLOCK221_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK6_SPLOCK221_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK6_SPLOCK220_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK6_SPLOCK220_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK6_SPLOCK219_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK6_SPLOCK219_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK6_SPLOCK218_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK6_SPLOCK218_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK6_SPLOCK217_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK6_SPLOCK217_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK6_SPLOCK216_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK6_SPLOCK216_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK6_SPLOCK215_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK6_SPLOCK215_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK6_SPLOCK214_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK6_SPLOCK214_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK6_SPLOCK213_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK6_SPLOCK213_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK6_SPLOCK212_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK6_SPLOCK212_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK6_SPLOCK211_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK6_SPLOCK211_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK6_SPLOCK210_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK6_SPLOCK210_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK6_SPLOCK209_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK6_SPLOCK209_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK6_SPLOCK208_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK6_SPLOCK208_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK6_SPLOCK207_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK6_SPLOCK207_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK6_SPLOCK206_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK6_SPLOCK206_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK6_SPLOCK205_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK6_SPLOCK205_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK6_SPLOCK204_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK6_SPLOCK204_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK6_SPLOCK203_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK6_SPLOCK203_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK6_SPLOCK202_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK6_SPLOCK202_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK6_SPLOCK201_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK6_SPLOCK201_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK6_SPLOCK200_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK6_SPLOCK200_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK6_SPLOCK199_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK6_SPLOCK199_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK6_SPLOCK198_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK6_SPLOCK198_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK6_SPLOCK197_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK6_SPLOCK197_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK6_SPLOCK196_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK6_SPLOCK196_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK6_SPLOCK195_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK6_SPLOCK195_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK6_SPLOCK194_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK6_SPLOCK194_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK6_SPLOCK193_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK6_SPLOCK193_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK6_SPLOCK192_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK6_SPLOCK192_B_0X1	(0x1u<<0)

// SPLOCK7 Configuration

#define	BSEC_SPLOCK7_SPLOCK255			(0x1u<<31)
#define	BSEC_SPLOCK7_SPLOCK254			(0x1u<<30)
#define	BSEC_SPLOCK7_SPLOCK253			(0x1u<<29)
#define	BSEC_SPLOCK7_SPLOCK252			(0x1u<<28)
#define	BSEC_SPLOCK7_SPLOCK251			(0x1u<<27)
#define	BSEC_SPLOCK7_SPLOCK250			(0x1u<<26)
#define	BSEC_SPLOCK7_SPLOCK249			(0x1u<<25)
#define	BSEC_SPLOCK7_SPLOCK248			(0x1u<<24)
#define	BSEC_SPLOCK7_SPLOCK247			(0x1u<<23)
#define	BSEC_SPLOCK7_SPLOCK246			(0x1u<<22)
#define	BSEC_SPLOCK7_SPLOCK245			(0x1u<<21)
#define	BSEC_SPLOCK7_SPLOCK244			(0x1u<<20)
#define	BSEC_SPLOCK7_SPLOCK243			(0x1u<<19)
#define	BSEC_SPLOCK7_SPLOCK242			(0x1u<<18)
#define	BSEC_SPLOCK7_SPLOCK241			(0x1u<<17)
#define	BSEC_SPLOCK7_SPLOCK240			(0x1u<<16)
#define	BSEC_SPLOCK7_SPLOCK239			(0x1u<<15)
#define	BSEC_SPLOCK7_SPLOCK238			(0x1u<<14)
#define	BSEC_SPLOCK7_SPLOCK237			(0x1u<<13)
#define	BSEC_SPLOCK7_SPLOCK236			(0x1u<<12)
#define	BSEC_SPLOCK7_SPLOCK235			(0x1u<<11)
#define	BSEC_SPLOCK7_SPLOCK234			(0x1u<<10)
#define	BSEC_SPLOCK7_SPLOCK233			(0x1u<<9)
#define	BSEC_SPLOCK7_SPLOCK232			(0x1u<<8)
#define	BSEC_SPLOCK7_SPLOCK231			(0x1u<<7)
#define	BSEC_SPLOCK7_SPLOCK230			(0x1u<<6)
#define	BSEC_SPLOCK7_SPLOCK229			(0x1u<<5)
#define	BSEC_SPLOCK7_SPLOCK228			(0x1u<<4)
#define	BSEC_SPLOCK7_SPLOCK227			(0x1u<<3)
#define	BSEC_SPLOCK7_SPLOCK226			(0x1u<<2)
#define	BSEC_SPLOCK7_SPLOCK225			(0x1u<<1)
#define	BSEC_SPLOCK7_SPLOCK224			(0x1u<<0)

#define	BSEC_SPLOCK7_SPLOCK255_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK7_SPLOCK255_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK7_SPLOCK254_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK7_SPLOCK254_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK7_SPLOCK253_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK7_SPLOCK253_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK7_SPLOCK252_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK7_SPLOCK252_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK7_SPLOCK251_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK7_SPLOCK251_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK7_SPLOCK250_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK7_SPLOCK250_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK7_SPLOCK249_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK7_SPLOCK249_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK7_SPLOCK248_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK7_SPLOCK248_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK7_SPLOCK247_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK7_SPLOCK247_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK7_SPLOCK246_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK7_SPLOCK246_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK7_SPLOCK245_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK7_SPLOCK245_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK7_SPLOCK244_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK7_SPLOCK244_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK7_SPLOCK243_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK7_SPLOCK243_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK7_SPLOCK242_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK7_SPLOCK242_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK7_SPLOCK241_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK7_SPLOCK241_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK7_SPLOCK240_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK7_SPLOCK240_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK7_SPLOCK239_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK7_SPLOCK239_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK7_SPLOCK238_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK7_SPLOCK238_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK7_SPLOCK237_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK7_SPLOCK237_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK7_SPLOCK236_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK7_SPLOCK236_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK7_SPLOCK235_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK7_SPLOCK235_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK7_SPLOCK234_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK7_SPLOCK234_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK7_SPLOCK233_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK7_SPLOCK233_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK7_SPLOCK232_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK7_SPLOCK232_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK7_SPLOCK231_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK7_SPLOCK231_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK7_SPLOCK230_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK7_SPLOCK230_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK7_SPLOCK229_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK7_SPLOCK229_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK7_SPLOCK228_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK7_SPLOCK228_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK7_SPLOCK227_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK7_SPLOCK227_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK7_SPLOCK226_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK7_SPLOCK226_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK7_SPLOCK225_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK7_SPLOCK225_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK7_SPLOCK224_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK7_SPLOCK224_B_0X1	(0x1u<<0)

// SPLOCK8 Configuration

