hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SPLOCK8_SPLOCK287			(0x1u<<31)
#define	BSEC_SPLOCK8_SPLOCK286			(0x1u<<30)
#define	BSEC_SPLOCK8_SPLOCK285			(0x1u<<29)
#define	BSEC_SPLOCK8_SPLOCK284			(0x1u<<28)
#define	BSEC_SPLOCK8_SPLOCK283			(0x1u<<27)
#define	BSEC_SPLOCK8_SPLOCK282			(0x1u<<26)
#define	BSEC_SPLOCK8_SPLOCK281			(0x1u<<25)
#define	BSEC_SPLOCK8_SPLOCK280			(0x1u<<24)
#define	BSEC_SPLOCK8_SPLOCK279			(0x1u<<23)
#define	BSEC_SPLOCK8_SPLOCK278			(0x1u<<22)
#define	BSEC_SPLOCK8_SPLOCK277			(0x1u<<21)
#define	BSEC_SPLOCK8_SPLOCK276			(0x1u<<20)
#define	BSEC_SPLOCK8_SPLOCK275			(0x1u<<19)
#define	BSEC_SPLOCK8_SPLOCK274			(0x1u<<18)
#define	BSEC_SPLOCK8_SPLOCK273			(0x1u<<17)
#define	BSEC_SPLOCK8_SPLOCK272			(0x1u<<16)
#define	BSEC_SPLOCK8_SPLOCK271			(0x1u<<15)
#define	BSEC_SPLOCK8_SPLOCK270			(0x1u<<14)
#define	BSEC_SPLOCK8_SPLOCK269			(0x1u<<13)
#define	BSEC_SPLOCK8_SPLOCK268			(0x1u<<12)
#define	BSEC_SPLOCK8_SPLOCK267			(0x1u<<11)
#define	BSEC_SPLOCK8_SPLOCK266			(0x1u<<10)
#define	BSEC_SPLOCK8_SPLOCK265			(0x1u<<9)
#define	BSEC_SPLOCK8_SPLOCK264			(0x1u<<8)
#define	BSEC_SPLOCK8_SPLOCK263			(0x1u<<7)
#define	BSEC_SPLOCK8_SPLOCK262			(0x1u<<6)
#define	BSEC_SPLOCK8_SPLOCK261			(0x1u<<5)
#define	BSEC_SPLOCK8_SPLOCK260			(0x1u<<4)
#define	BSEC_SPLOCK8_SPLOCK259			(0x1u<<3)
#define	BSEC_SPLOCK8_SPLOCK258			(0x1u<<2)
#define	BSEC_SPLOCK8_SPLOCK257			(0x1u<<1)
#define	BSEC_SPLOCK8_SPLOCK256			(0x1u<<0)

#define	BSEC_SPLOCK8_SPLOCK287_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK8_SPLOCK287_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK8_SPLOCK286_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK8_SPLOCK286_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK8_SPLOCK285_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK8_SPLOCK285_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK8_SPLOCK284_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK8_SPLOCK284_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK8_SPLOCK283_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK8_SPLOCK283_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK8_SPLOCK282_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK8_SPLOCK282_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK8_SPLOCK281_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK8_SPLOCK281_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK8_SPLOCK280_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK8_SPLOCK280_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK8_SPLOCK279_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK8_SPLOCK279_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK8_SPLOCK278_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK8_SPLOCK278_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK8_SPLOCK277_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK8_SPLOCK277_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK8_SPLOCK276_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK8_SPLOCK276_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK8_SPLOCK275_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK8_SPLOCK275_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK8_SPLOCK274_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK8_SPLOCK274_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK8_SPLOCK273_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK8_SPLOCK273_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK8_SPLOCK272_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK8_SPLOCK272_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK8_SPLOCK271_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK8_SPLOCK271_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK8_SPLOCK270_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK8_SPLOCK270_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK8_SPLOCK269_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK8_SPLOCK269_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK8_SPLOCK268_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK8_SPLOCK268_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK8_SPLOCK267_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK8_SPLOCK267_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK8_SPLOCK266_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK8_SPLOCK266_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK8_SPLOCK265_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK8_SPLOCK265_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK8_SPLOCK264_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK8_SPLOCK264_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK8_SPLOCK263_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK8_SPLOCK263_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK8_SPLOCK262_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK8_SPLOCK262_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK8_SPLOCK261_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK8_SPLOCK261_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK8_SPLOCK260_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK8_SPLOCK260_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK8_SPLOCK259_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK8_SPLOCK259_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK8_SPLOCK258_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK8_SPLOCK258_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK8_SPLOCK257_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK8_SPLOCK257_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK8_SPLOCK256_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK8_SPLOCK256_B_0X1	(0x1u<<0)

// SPLOCK9 Configuration

#define	BSEC_SPLOCK9_SPLOCK319			(0x1u<<31)
#define	BSEC_SPLOCK9_SPLOCK318			(0x1u<<30)
#define	BSEC_SPLOCK9_SPLOCK317			(0x1u<<29)
#define	BSEC_SPLOCK9_SPLOCK316			(0x1u<<28)
#define	BSEC_SPLOCK9_SPLOCK315			(0x1u<<27)
#define	BSEC_SPLOCK9_SPLOCK314			(0x1u<<26)
#define	BSEC_SPLOCK9_SPLOCK313			(0x1u<<25)
#define	BSEC_SPLOCK9_SPLOCK312			(0x1u<<24)
#define	BSEC_SPLOCK9_SPLOCK311			(0x1u<<23)
#define	BSEC_SPLOCK9_SPLOCK310			(0x1u<<22)
#define	BSEC_SPLOCK9_SPLOCK309			(0x1u<<21)
#define	BSEC_SPLOCK9_SPLOCK308			(0x1u<<20)
#define	BSEC_SPLOCK9_SPLOCK307			(0x1u<<19)
#define	BSEC_SPLOCK9_SPLOCK306			(0x1u<<18)
#define	BSEC_SPLOCK9_SPLOCK305			(0x1u<<17)
#define	BSEC_SPLOCK9_SPLOCK304			(0x1u<<16)
#define	BSEC_SPLOCK9_SPLOCK303			(0x1u<<15)
#define	BSEC_SPLOCK9_SPLOCK302			(0x1u<<14)
#define	BSEC_SPLOCK9_SPLOCK301			(0x1u<<13)
#define	BSEC_SPLOCK9_SPLOCK300			(0x1u<<12)
#define	BSEC_SPLOCK9_SPLOCK299			(0x1u<<11)
#define	BSEC_SPLOCK9_SPLOCK298			(0x1u<<10)
#define	BSEC_SPLOCK9_SPLOCK297			(0x1u<<9)
#define	BSEC_SPLOCK9_SPLOCK296			(0x1u<<8)
#define	BSEC_SPLOCK9_SPLOCK295			(0x1u<<7)
#define	BSEC_SPLOCK9_SPLOCK294			(0x1u<<6)
#define	BSEC_SPLOCK9_SPLOCK293			(0x1u<<5)
#define	BSEC_SPLOCK9_SPLOCK292			(0x1u<<4)
#define	BSEC_SPLOCK9_SPLOCK291			(0x1u<<3)
#define	BSEC_SPLOCK9_SPLOCK290			(0x1u<<2)
#define	BSEC_SPLOCK9_SPLOCK289			(0x1u<<1)
#define	BSEC_SPLOCK9_SPLOCK288			(0x1u<<0)

#define	BSEC_SPLOCK9_SPLOCK319_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK9_SPLOCK319_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK9_SPLOCK318_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK9_SPLOCK318_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK9_SPLOCK317_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK9_SPLOCK317_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK9_SPLOCK316_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK9_SPLOCK316_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK9_SPLOCK315_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK9_SPLOCK315_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK9_SPLOCK314_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK9_SPLOCK314_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK9_SPLOCK313_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK9_SPLOCK313_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK9_SPLOCK312_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK9_SPLOCK312_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK9_SPLOCK311_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK9_SPLOCK311_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK9_SPLOCK310_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK9_SPLOCK310_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK9_SPLOCK309_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK9_SPLOCK309_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK9_SPLOCK308_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK9_SPLOCK308_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK9_SPLOCK307_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK9_SPLOCK307_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK9_SPLOCK306_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK9_SPLOCK306_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK9_SPLOCK305_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK9_SPLOCK305_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK9_SPLOCK304_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK9_SPLOCK304_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK9_SPLOCK303_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK9_SPLOCK303_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK9_SPLOCK302_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK9_SPLOCK302_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK9_SPLOCK301_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK9_SPLOCK301_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK9_SPLOCK300_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK9_SPLOCK300_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK9_SPLOCK299_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK9_SPLOCK299_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK9_SPLOCK298_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK9_SPLOCK298_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK9_SPLOCK297_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK9_SPLOCK297_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK9_SPLOCK296_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK9_SPLOCK296_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK9_SPLOCK295_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK9_SPLOCK295_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK9_SPLOCK294_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK9_SPLOCK294_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK9_SPLOCK293_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK9_SPLOCK293_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK9_SPLOCK292_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK9_SPLOCK292_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK9_SPLOCK291_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK9_SPLOCK291_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK9_SPLOCK290_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK9_SPLOCK290_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK9_SPLOCK289_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK9_SPLOCK289_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK9_SPLOCK288_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK9_SPLOCK288_B_0X1	(0x1u<<0)

