hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SPLOCK10 Configuration

#define	BSEC_SPLOCK10_SPLOCK351			(0x1u<<31)
#define	BSEC_SPLOCK10_SPLOCK350			(0x1u<<30)
#define	BSEC_SPLOCK10_SPLOCK349			(0x1u<<29)
#define	BSEC_SPLOCK10_SPLOCK348			(0x1u<<28)
#define	BSEC_SPLOCK10_SPLOCK347			(0x1u<<27)
#define	BSEC_SPLOCK10_SPLOCK346			(0x1u<<26)
#define	BSEC_SPLOCK10_SPLOCK345			(0x1u<<25)
#define	BSEC_SPLOCK10_SPLOCK344			(0x1u<<24)
#define	BSEC_SPLOCK10_SPLOCK343			(0x1u<<23)
#define	BSEC_SPLOCK10_SPLOCK342			(0x1u<<22)
#define	BSEC_SPLOCK10_SPLOCK341			(0x1u<<21)
#define	BSEC_SPLOCK10_SPLOCK340			(0x1u<<20)
#define	BSEC_SPLOCK10_SPLOCK339			(0x1u<<19)
#define	BSEC_SPLOCK10_SPLOCK338			(0x1u<<18)
#define	BSEC_SPLOCK10_SPLOCK337			(0x1u<<17)
#define	BSEC_SPLOCK10_SPLOCK336			(0x1u<<16)
#define	BSEC_SPLOCK10_SPLOCK335			(0x1u<<15)
#define	BSEC_SPLOCK10_SPLOCK334			(0x1u<<14)
#define	BSEC_SPLOCK10_SPLOCK333			(0x1u<<13)
#define	BSEC_SPLOCK10_SPLOCK332			(0x1u<<12)
#define	BSEC_SPLOCK10_SPLOCK331			(0x1u<<11)
#define	BSEC_SPLOCK10_SPLOCK330			(0x1u<<10)
#define	BSEC_SPLOCK10_SPLOCK329			(0x1u<<9)
#define	BSEC_SPLOCK10_SPLOCK328			(0x1u<<8)
#define	BSEC_SPLOCK10_SPLOCK327			(0x1u<<7)
#define	BSEC_SPLOCK10_SPLOCK326			(0x1u<<6)
#define	BSEC_SPLOCK10_SPLOCK325			(0x1u<<5)
#define	BSEC_SPLOCK10_SPLOCK324			(0x1u<<4)
#define	BSEC_SPLOCK10_SPLOCK323			(0x1u<<3)
#define	BSEC_SPLOCK10_SPLOCK322			(0x1u<<2)
#define	BSEC_SPLOCK10_SPLOCK321			(0x1u<<1)
#define	BSEC_SPLOCK10_SPLOCK320			(0x1u<<0)

#define	BSEC_SPLOCK10_SPLOCK351_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK10_SPLOCK351_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK10_SPLOCK350_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK10_SPLOCK350_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK10_SPLOCK349_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK10_SPLOCK349_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK10_SPLOCK348_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK10_SPLOCK348_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK10_SPLOCK347_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK10_SPLOCK347_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK10_SPLOCK346_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK10_SPLOCK346_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK10_SPLOCK345_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK10_SPLOCK345_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK10_SPLOCK344_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK10_SPLOCK344_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK10_SPLOCK343_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK10_SPLOCK343_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK10_SPLOCK342_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK10_SPLOCK342_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK10_SPLOCK341_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK10_SPLOCK341_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK10_SPLOCK340_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK10_SPLOCK340_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK10_SPLOCK339_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK10_SPLOCK339_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK10_SPLOCK338_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK10_SPLOCK338_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK10_SPLOCK337_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK10_SPLOCK337_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK10_SPLOCK336_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK10_SPLOCK336_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK10_SPLOCK335_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK10_SPLOCK335_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK10_SPLOCK334_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK10_SPLOCK334_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK10_SPLOCK333_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK10_SPLOCK333_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK10_SPLOCK332_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK10_SPLOCK332_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK10_SPLOCK331_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK10_SPLOCK331_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK10_SPLOCK330_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK10_SPLOCK330_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK10_SPLOCK329_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK10_SPLOCK329_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK10_SPLOCK328_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK10_SPLOCK328_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK10_SPLOCK327_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK10_SPLOCK327_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK10_SPLOCK326_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK10_SPLOCK326_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK10_SPLOCK325_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK10_SPLOCK325_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK10_SPLOCK324_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK10_SPLOCK324_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK10_SPLOCK323_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK10_SPLOCK323_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK10_SPLOCK322_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK10_SPLOCK322_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK10_SPLOCK321_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK10_SPLOCK321_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK10_SPLOCK320_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK10_SPLOCK320_B_0X1	(0x1u<<0)

// SPLOCK11 Configuration

#define	BSEC_SPLOCK11_SPLOCK383			(0x1u<<31)
#define	BSEC_SPLOCK11_SPLOCK382			(0x1u<<30)
#define	BSEC_SPLOCK11_SPLOCK381			(0x1u<<29)
#define	BSEC_SPLOCK11_SPLOCK380			(0x1u<<28)
#define	BSEC_SPLOCK11_SPLOCK379			(0x1u<<27)
#define	BSEC_SPLOCK11_SPLOCK378			(0x1u<<26)
#define	BSEC_SPLOCK11_SPLOCK377			(0x1u<<25)
#define	BSEC_SPLOCK11_SPLOCK376			(0x1u<<24)
#define	BSEC_SPLOCK11_SPLOCK375			(0x1u<<23)
#define	BSEC_SPLOCK11_SPLOCK374			(0x1u<<22)
#define	BSEC_SPLOCK11_SPLOCK373			(0x1u<<21)
#define	BSEC_SPLOCK11_SPLOCK372			(0x1u<<20)
#define	BSEC_SPLOCK11_SPLOCK371			(0x1u<<19)
#define	BSEC_SPLOCK11_SPLOCK370			(0x1u<<18)
#define	BSEC_SPLOCK11_SPLOCK369			(0x1u<<17)
#define	BSEC_SPLOCK11_SPLOCK368			(0x1u<<16)
#define	BSEC_SPLOCK11_SPLOCK367			(0x1u<<15)
#define	BSEC_SPLOCK11_SPLOCK366			(0x1u<<14)
#define	BSEC_SPLOCK11_SPLOCK365			(0x1u<<13)
#define	BSEC_SPLOCK11_SPLOCK364			(0x1u<<12)
#define	BSEC_SPLOCK11_SPLOCK363			(0x1u<<11)
#define	BSEC_SPLOCK11_SPLOCK362			(0x1u<<10)
#define	BSEC_SPLOCK11_SPLOCK361			(0x1u<<9)
#define	BSEC_SPLOCK11_SPLOCK360			(0x1u<<8)
#define	BSEC_SPLOCK11_SPLOCK359			(0x1u<<7)
#define	BSEC_SPLOCK11_SPLOCK358			(0x1u<<6)
#define	BSEC_SPLOCK11_SPLOCK357			(0x1u<<5)
#define	BSEC_SPLOCK11_SPLOCK356			(0x1u<<4)
#define	BSEC_SPLOCK11_SPLOCK355			(0x1u<<3)
#define	BSEC_SPLOCK11_SPLOCK354			(0x1u<<2)
#define	BSEC_SPLOCK11_SPLOCK353			(0x1u<<1)
#define	BSEC_SPLOCK11_SPLOCK352			(0x1u<<0)

#define	BSEC_SPLOCK11_SPLOCK383_B_0X0	(0x0u<<31)
#define	BSEC_SPLOCK11_SPLOCK383_B_0X1	(0x1u<<31)
#define	BSEC_SPLOCK11_SPLOCK382_B_0X0	(0x0u<<30)
#define	BSEC_SPLOCK11_SPLOCK382_B_0X1	(0x1u<<30)
#define	BSEC_SPLOCK11_SPLOCK381_B_0X0	(0x0u<<29)
#define	BSEC_SPLOCK11_SPLOCK381_B_0X1	(0x1u<<29)
#define	BSEC_SPLOCK11_SPLOCK380_B_0X0	(0x0u<<28)
#define	BSEC_SPLOCK11_SPLOCK380_B_0X1	(0x1u<<28)
#define	BSEC_SPLOCK11_SPLOCK379_B_0X0	(0x0u<<27)
#define	BSEC_SPLOCK11_SPLOCK379_B_0X1	(0x1u<<27)
#define	BSEC_SPLOCK11_SPLOCK378_B_0X0	(0x0u<<26)
#define	BSEC_SPLOCK11_SPLOCK378_B_0X1	(0x1u<<26)
#define	BSEC_SPLOCK11_SPLOCK377_B_0X0	(0x0u<<25)
#define	BSEC_SPLOCK11_SPLOCK377_B_0X1	(0x1u<<25)
#define	BSEC_SPLOCK11_SPLOCK376_B_0X0	(0x0u<<24)
#define	BSEC_SPLOCK11_SPLOCK376_B_0X1	(0x1u<<24)
#define	BSEC_SPLOCK11_SPLOCK375_B_0X0	(0x0u<<23)
#define	BSEC_SPLOCK11_SPLOCK375_B_0X1	(0x1u<<23)
#define	BSEC_SPLOCK11_SPLOCK374_B_0X0	(0x0u<<22)
#define	BSEC_SPLOCK11_SPLOCK374_B_0X1	(0x1u<<22)
#define	BSEC_SPLOCK11_SPLOCK373_B_0X0	(0x0u<<21)
#define	BSEC_SPLOCK11_SPLOCK373_B_0X1	(0x1u<<21)
#define	BSEC_SPLOCK11_SPLOCK372_B_0X0	(0x0u<<20)
#define	BSEC_SPLOCK11_SPLOCK372_B_0X1	(0x1u<<20)
#define	BSEC_SPLOCK11_SPLOCK371_B_0X0	(0x0u<<19)
#define	BSEC_SPLOCK11_SPLOCK371_B_0X1	(0x1u<<19)
#define	BSEC_SPLOCK11_SPLOCK370_B_0X0	(0x0u<<18)
#define	BSEC_SPLOCK11_SPLOCK370_B_0X1	(0x1u<<18)
#define	BSEC_SPLOCK11_SPLOCK369_B_0X0	(0x0u<<17)
#define	BSEC_SPLOCK11_SPLOCK369_B_0X1	(0x1u<<17)
#define	BSEC_SPLOCK11_SPLOCK368_B_0X0	(0x0u<<16)
#define	BSEC_SPLOCK11_SPLOCK368_B_0X1	(0x1u<<16)
#define	BSEC_SPLOCK11_SPLOCK367_B_0X0	(0x0u<<15)
#define	BSEC_SPLOCK11_SPLOCK367_B_0X1	(0x1u<<15)
#define	BSEC_SPLOCK11_SPLOCK366_B_0X0	(0x0u<<14)
#define	BSEC_SPLOCK11_SPLOCK366_B_0X1	(0x1u<<14)
#define	BSEC_SPLOCK11_SPLOCK365_B_0X0	(0x0u<<13)
#define	BSEC_SPLOCK11_SPLOCK365_B_0X1	(0x1u<<13)
#define	BSEC_SPLOCK11_SPLOCK364_B_0X0	(0x0u<<12)
#define	BSEC_SPLOCK11_SPLOCK364_B_0X1	(0x1u<<12)
#define	BSEC_SPLOCK11_SPLOCK363_B_0X0	(0x0u<<11)
#define	BSEC_SPLOCK11_SPLOCK363_B_0X1	(0x1u<<11)
#define	BSEC_SPLOCK11_SPLOCK362_B_0X0	(0x0u<<10)
#define	BSEC_SPLOCK11_SPLOCK362_B_0X1	(0x1u<<10)
#define	BSEC_SPLOCK11_SPLOCK361_B_0X0	(0x0u<<9)
#define	BSEC_SPLOCK11_SPLOCK361_B_0X1	(0x1u<<9)
#define	BSEC_SPLOCK11_SPLOCK360_B_0X0	(0x0u<<8)
#define	BSEC_SPLOCK11_SPLOCK360_B_0X1	(0x1u<<8)
#define	BSEC_SPLOCK11_SPLOCK359_B_0X0	(0x0u<<7)
#define	BSEC_SPLOCK11_SPLOCK359_B_0X1	(0x1u<<7)
#define	BSEC_SPLOCK11_SPLOCK358_B_0X0	(0x0u<<6)
#define	BSEC_SPLOCK11_SPLOCK358_B_0X1	(0x1u<<6)
#define	BSEC_SPLOCK11_SPLOCK357_B_0X0	(0x0u<<5)
#define	BSEC_SPLOCK11_SPLOCK357_B_0X1	(0x1u<<5)
#define	BSEC_SPLOCK11_SPLOCK356_B_0X0	(0x0u<<4)
#define	BSEC_SPLOCK11_SPLOCK356_B_0X1	(0x1u<<4)
#define	BSEC_SPLOCK11_SPLOCK355_B_0X0	(0x0u<<3)
#define	BSEC_SPLOCK11_SPLOCK355_B_0X1	(0x1u<<3)
#define	BSEC_SPLOCK11_SPLOCK354_B_0X0	(0x0u<<2)
#define	BSEC_SPLOCK11_SPLOCK354_B_0X1	(0x1u<<2)
#define	BSEC_SPLOCK11_SPLOCK353_B_0X0	(0x0u<<1)
#define	BSEC_SPLOCK11_SPLOCK353_B_0X1	(0x1u<<1)
#define	BSEC_SPLOCK11_SPLOCK352_B_0X0	(0x0u<<0)
#define	BSEC_SPLOCK11_SPLOCK352_B_0X1	(0x1u<<0)

// SWLOCK0 Configuration

#define	BSEC_SWLOCK0_SWLOCK31			(0x1u<<31)
#define	BSEC_SWLOCK0_SWLOCK30			(0x1u<<30)
#define	BSEC_SWLOCK0_SWLOCK29			(0x1u<<29)
#define	BSEC_SWLOCK0_SWLOCK28			(0x1u<<28)
#define	BSEC_SWLOCK0_SWLOCK27			(0x1u<<27)
#define	BSEC_SWLOCK0_SWLOCK26			(0x1u<<26)
#define	BSEC_SWLOCK0_SWLOCK25			(0x1u<<25)
#define	BSEC_SWLOCK0_SWLOCK24			(0x1u<<24)
#define	BSEC_SWLOCK0_SWLOCK23			(0x1u<<23)
#define	BSEC_SWLOCK0_SWLOCK22			(0x1u<<22)
#define	BSEC_SWLOCK0_SWLOCK21			(0x1u<<21)
#define	BSEC_SWLOCK0_SWLOCK20			(0x1u<<20)
#define	BSEC_SWLOCK0_SWLOCK19			(0x1u<<19)
#define	BSEC_SWLOCK0_SWLOCK18			(0x1u<<18)
#define	BSEC_SWLOCK0_SWLOCK17			(0x1u<<17)
#define	BSEC_SWLOCK0_SWLOCK16			(0x1u<<16)
#define	BSEC_SWLOCK0_SWLOCK15			(0x1u<<15)
#define	BSEC_SWLOCK0_SWLOCK14			(0x1u<<14)
#define	BSEC_SWLOCK0_SWLOCK13			(0x1u<<13)
#define	BSEC_SWLOCK0_SWLOCK12			(0x1u<<12)
#define	BSEC_SWLOCK0_SWLOCK11			(0x1u<<11)
#define	BSEC_SWLOCK0_SWLOCK10			(0x1u<<10)
#define	BSEC_SWLOCK0_SWLOCK9			(0x1u<<9)
#define	BSEC_SWLOCK0_SWLOCK8			(0x1u<<8)
#define	BSEC_SWLOCK0_SWLOCK7			(0x1u<<7)
#define	BSEC_SWLOCK0_SWLOCK6			(0x1u<<6)
#define	BSEC_SWLOCK0_SWLOCK5			(0x1u<<5)
#define	BSEC_SWLOCK0_SWLOCK4			(0x1u<<4)
#define	BSEC_SWLOCK0_SWLOCK3			(0x1u<<3)
#define	BSEC_SWLOCK0_SWLOCK2			(0x1u<<2)
#define	BSEC_SWLOCK0_SWLOCK1			(0x1u<<1)
#define	BSEC_SWLOCK0_SWLOCK0			(0x1u<<0)

#define	BSEC_SWLOCK0_SWLOCK31_B_0X0		(0x0u<<31)
#define	BSEC_SWLOCK0_SWLOCK31_B_0X1		(0x1u<<31)
#define	BSEC_SWLOCK0_SWLOCK30_B_0X0		(0x0u<<30)
#define	BSEC_SWLOCK0_SWLOCK30_B_0X1		(0x1u<<30)
#define	BSEC_SWLOCK0_SWLOCK29_B_0X0		(0x0u<<29)
#define	BSEC_SWLOCK0_SWLOCK29_B_0X1		(0x1u<<29)
#define	BSEC_SWLOCK0_SWLOCK28_B_0X0		(0x0u<<28)
#define	BSEC_SWLOCK0_SWLOCK28_B_0X1		(0x1u<<28)
#define	BSEC_SWLOCK0_SWLOCK27_B_0X0		(0x0u<<27)
#define	BSEC_SWLOCK0_SWLOCK27_B_0X1		(0x1u<<27)
#define	BSEC_SWLOCK0_SWLOCK26_B_0X0		(0x0u<<26)
#define	BSEC_SWLOCK0_SWLOCK26_B_0X1		(0x1u<<26)
#define	BSEC_SWLOCK0_SWLOCK25_B_0X0		(0x0u<<25)
#define	BSEC_SWLOCK0_SWLOCK25_B_0X1		(0x1u<<25)
#define	BSEC_SWLOCK0_SWLOCK24_B_0X0		(0x0u<<24)
#define	BSEC_SWLOCK0_SWLOCK24_B_0X1		(0x1u<<24)
#define	BSEC_SWLOCK0_SWLOCK23_B_0X0		(0x0u<<23)
#define	BSEC_SWLOCK0_SWLOCK23_B_0X1		(0x1u<<23)
#define	BSEC_SWLOCK0_SWLOCK22_B_0X0		(0x0u<<22)
#define	BSEC_SWLOCK0_SWLOCK22_B_0X1		(0x1u<<22)
#define	BSEC_SWLOCK0_SWLOCK21_B_0X0		(0x0u<<21)
#define	BSEC_SWLOCK0_SWLOCK21_B_0X1		(0x1u<<21)
#define	BSEC_SWLOCK0_SWLOCK20_B_0X0		(0x0u<<20)
#define	BSEC_SWLOCK0_SWLOCK20_B_0X1		(0x1u<<20)
#define	BSEC_SWLOCK0_SWLOCK19_B_0X0		(0x0u<<19)
#define	BSEC_SWLOCK0_SWLOCK19_B_0X1		(0x1u<<19)
#define	BSEC_SWLOCK0_SWLOCK18_B_0X0		(0x0u<<18)
#define	BSEC_SWLOCK0_SWLOCK18_B_0X1		(0x1u<<18)
#define	BSEC_SWLOCK0_SWLOCK17_B_0X0		(0x0u<<17)
#define	BSEC_SWLOCK0_SWLOCK17_B_0X1		(0x1u<<17)
#define	BSEC_SWLOCK0_SWLOCK16_B_0X0		(0x0u<<16)
#define	BSEC_SWLOCK0_SWLOCK16_B_0X1		(0x1u<<16)
#define	BSEC_SWLOCK0_SWLOCK15_B_0X0		(0x0u<<15)
#define	BSEC_SWLOCK0_SWLOCK15_B_0X1		(0x1u<<15)
#define	BSEC_SWLOCK0_SWLOCK14_B_0X0		(0x0u<<14)
#define	BSEC_SWLOCK0_SWLOCK14_B_0X1		(0x1u<<14)
#define	BSEC_SWLOCK0_SWLOCK13_B_0X0		(0x0u<<13)
#define	BSEC_SWLOCK0_SWLOCK13_B_0X1		(0x1u<<13)
#define	BSEC_SWLOCK0_SWLOCK12_B_0X0		(0x0u<<12)
#define	BSEC_SWLOCK0_SWLOCK12_B_0X1		(0x1u<<12)
#define	BSEC_SWLOCK0_SWLOCK11_B_0X0		(0x0u<<11)
#define	BSEC_SWLOCK0_SWLOCK11_B_0X1		(0x1u<<11)
#define	BSEC_SWLOCK0_SWLOCK10_B_0X0		(0x0u<<10)
#define	BSEC_SWLOCK0_SWLOCK10_B_0X1		(0x1u<<10)
#define	BSEC_SWLOCK0_SWLOCK9_B_0X0		(0x0u<<9)
#define	BSEC_SWLOCK0_SWLOCK9_B_0X1		(0x1u<<9)
#define	BSEC_SWLOCK0_SWLOCK8_B_0X0		(0x0u<<8)
#define	BSEC_SWLOCK0_SWLOCK8_B_0X1		(0x1u<<8)
#define	BSEC_SWLOCK0_SWLOCK7_B_0X0		(0x0u<<7)
#define	BSEC_SWLOCK0_SWLOCK7_B_0X1		(0x1u<<7)
#define	BSEC_SWLOCK0_SWLOCK6_B_0X0		(0x0u<<6)
#define	BSEC_SWLOCK0_SWLOCK6_B_0X1		(0x1u<<6)
#define	BSEC_SWLOCK0_SWLOCK5_B_0X0		(0x0u<<5)
#define	BSEC_SWLOCK0_SWLOCK5_B_0X1		(0x1u<<5)
#define	BSEC_SWLOCK0_SWLOCK4_B_0X0		(0x0u<<4)
#define	BSEC_SWLOCK0_SWLOCK4_B_0X1		(0x1u<<4)
#define	BSEC_SWLOCK0_SWLOCK3_B_0X0		(0x0u<<3)
#define	BSEC_SWLOCK0_SWLOCK3_B_0X1		(0x1u<<3)
#define	BSEC_SWLOCK0_SWLOCK2_B_0X0		(0x0u<<2)
#define	BSEC_SWLOCK0_SWLOCK2_B_0X1		(0x1u<<2)
#define	BSEC_SWLOCK0_SWLOCK1_B_0X0		(0x0u<<1)
#define	BSEC_SWLOCK0_SWLOCK1_B_0X1		(0x1u<<1)
#define	BSEC_SWLOCK0_SWLOCK0_B_0X0		(0x0u<<0)
#define	BSEC_SWLOCK0_SWLOCK0_B_0X1		(0x1u<<0)

// SWLOCK1 Configuration

#define	BSEC_SWLOCK1_SWLOCK63			(0x1u<<31)
#define	BSEC_SWLOCK1_SWLOCK62			(0x1u<<30)
#define	BSEC_SWLOCK1_SWLOCK61			(0x1u<<29)
#define	BSEC_SWLOCK1_SWLOCK60			(0x1u<<28)
#define	BSEC_SWLOCK1_SWLOCK59			(0x1u<<27)
#define	BSEC_SWLOCK1_SWLOCK58			(0x1u<<26)
#define	BSEC_SWLOCK1_SWLOCK57			(0x1u<<25)
#define	BSEC_SWLOCK1_SWLOCK56			(0x1u<<24)
#define	BSEC_SWLOCK1_SWLOCK55			(0x1u<<23)
#define	BSEC_SWLOCK1_SWLOCK54			(0x1u<<22)
#define	BSEC_SWLOCK1_SWLOCK53			(0x1u<<21)
#define	BSEC_SWLOCK1_SWLOCK52			(0x1u<<20)
#define	BSEC_SWLOCK1_SWLOCK51			(0x1u<<19)
#define	BSEC_SWLOCK1_SWLOCK50			(0x1u<<18)
#define	BSEC_SWLOCK1_SWLOCK49			(0x1u<<17)
#define	BSEC_SWLOCK1_SWLOCK48			(0x1u<<16)
#define	BSEC_SWLOCK1_SWLOCK47			(0x1u<<15)
#define	BSEC_SWLOCK1_SWLOCK46			(0x1u<<14)
#define	BSEC_SWLOCK1_SWLOCK45			(0x1u<<13)
#define	BSEC_SWLOCK1_SWLOCK44			(0x1u<<12)
#define	BSEC_SWLOCK1_SWLOCK43			(0x1u<<11)
#define	BSEC_SWLOCK1_SWLOCK42			(0x1u<<10)
#define	BSEC_SWLOCK1_SWLOCK41			(0x1u<<9)
#define	BSEC_SWLOCK1_SWLOCK40			(0x1u<<8)
#define	BSEC_SWLOCK1_SWLOCK39			(0x1u<<7)
#define	BSEC_SWLOCK1_SWLOCK38			(0x1u<<6)
#define	BSEC_SWLOCK1_SWLOCK37			(0x1u<<5)
#define	BSEC_SWLOCK1_SWLOCK36			(0x1u<<4)
#define	BSEC_SWLOCK1_SWLOCK35			(0x1u<<3)
#define	BSEC_SWLOCK1_SWLOCK34			(0x1u<<2)
#define	BSEC_SWLOCK1_SWLOCK33			(0x1u<<1)
#define	BSEC_SWLOCK1_SWLOCK32			(0x1u<<0)

#define	BSEC_SWLOCK1_SWLOCK63_B_0X0		(0x0u<<31)
#define	BSEC_SWLOCK1_SWLOCK63_B_0X1		(0x1u<<31)
#define	BSEC_SWLOCK1_SWLOCK62_B_0X0		(0x0u<<30)
#define	BSEC_SWLOCK1_SWLOCK62_B_0X1		(0x1u<<30)
#define	BSEC_SWLOCK1_SWLOCK61_B_0X0		(0x0u<<29)
#define	BSEC_SWLOCK1_SWLOCK61_B_0X1		(0x1u<<29)
#define	BSEC_SWLOCK1_SWLOCK60_B_0X0		(0x0u<<28)
#define	BSEC_SWLOCK1_SWLOCK60_B_0X1		(0x1u<<28)
#define	BSEC_SWLOCK1_SWLOCK59_B_0X0		(0x0u<<27)
#define	BSEC_SWLOCK1_SWLOCK59_B_0X1		(0x1u<<27)
#define	BSEC_SWLOCK1_SWLOCK58_B_0X0		(0x0u<<26)
#define	BSEC_SWLOCK1_SWLOCK58_B_0X1		(0x1u<<26)
#define	BSEC_SWLOCK1_SWLOCK57_B_0X0		(0x0u<<25)
#define	BSEC_SWLOCK1_SWLOCK57_B_0X1		(0x1u<<25)
#define	BSEC_SWLOCK1_SWLOCK56_B_0X0		(0x0u<<24)
#define	BSEC_SWLOCK1_SWLOCK56_B_0X1		(0x1u<<24)
#define	BSEC_SWLOCK1_SWLOCK55_B_0X0		(0x0u<<23)
#define	BSEC_SWLOCK1_SWLOCK55_B_0X1		(0x1u<<23)
#define	BSEC_SWLOCK1_SWLOCK54_B_0X0		(0x0u<<22)
#define	BSEC_SWLOCK1_SWLOCK54_B_0X1		(0x1u<<22)
#define	BSEC_SWLOCK1_SWLOCK53_B_0X0		(0x0u<<21)
#define	BSEC_SWLOCK1_SWLOCK53_B_0X1		(0x1u<<21)
#define	BSEC_SWLOCK1_SWLOCK52_B_0X0		(0x0u<<20)
#define	BSEC_SWLOCK1_SWLOCK52_B_0X1		(0x1u<<20)
#define	BSEC_SWLOCK1_SWLOCK51_B_0X0		(0x0u<<19)
#define	BSEC_SWLOCK1_SWLOCK51_B_0X1		(0x1u<<19)
#define	BSEC_SWLOCK1_SWLOCK50_B_0X0		(0x0u<<18)
#define	BSEC_SWLOCK1_SWLOCK50_B_0X1		(0x1u<<18)
#define	BSEC_SWLOCK1_SWLOCK49_B_0X0		(0x0u<<17)
#define	BSEC_SWLOCK1_SWLOCK49_B_0X1		(0x1u<<17)
#define	BSEC_SWLOCK1_SWLOCK48_B_0X0		(0x0u<<16)
#define	BSEC_SWLOCK1_SWLOCK48_B_0X1		(0x1u<<16)
#define	BSEC_SWLOCK1_SWLOCK47_B_0X0		(0x0u<<15)
#define	BSEC_SWLOCK1_SWLOCK47_B_0X1		(0x1u<<15)
#define	BSEC_SWLOCK1_SWLOCK46_B_0X0		(0x0u<<14)
#define	BSEC_SWLOCK1_SWLOCK46_B_0X1		(0x1u<<14)
#define	BSEC_SWLOCK1_SWLOCK45_B_0X0		(0x0u<<13)
#define	BSEC_SWLOCK1_SWLOCK45_B_0X1		(0x1u<<13)
#define	BSEC_SWLOCK1_SWLOCK44_B_0X0		(0x0u<<12)
#define	BSEC_SWLOCK1_SWLOCK44_B_0X1		(0x1u<<12)
#define	BSEC_SWLOCK1_SWLOCK43_B_0X0		(0x0u<<11)
#define	BSEC_SWLOCK1_SWLOCK43_B_0X1		(0x1u<<11)
#define	BSEC_SWLOCK1_SWLOCK42_B_0X0		(0x0u<<10)
#define	BSEC_SWLOCK1_SWLOCK42_B_0X1		(0x1u<<10)
#define	BSEC_SWLOCK1_SWLOCK41_B_0X0		(0x0u<<9)
#define	BSEC_SWLOCK1_SWLOCK41_B_0X1		(0x1u<<9)
#define	BSEC_SWLOCK1_SWLOCK40_B_0X0		(0x0u<<8)
#define	BSEC_SWLOCK1_SWLOCK40_B_0X1		(0x1u<<8)
#define	BSEC_SWLOCK1_SWLOCK39_B_0X0		(0x0u<<7)
#define	BSEC_SWLOCK1_SWLOCK39_B_0X1		(0x1u<<7)
#define	BSEC_SWLOCK1_SWLOCK38_B_0X0		(0x0u<<6)
#define	BSEC_SWLOCK1_SWLOCK38_B_0X1		(0x1u<<6)
#define	BSEC_SWLOCK1_SWLOCK37_B_0X0		(0x0u<<5)
#define	BSEC_SWLOCK1_SWLOCK37_B_0X1		(0x1u<<5)
#define	BSEC_SWLOCK1_SWLOCK36_B_0X0		(0x0u<<4)
#define	BSEC_SWLOCK1_SWLOCK36_B_0X1		(0x1u<<4)
#define	BSEC_SWLOCK1_SWLOCK35_B_0X0		(0x0u<<3)
#define	BSEC_SWLOCK1_SWLOCK35_B_0X1		(0x1u<<3)
#define	BSEC_SWLOCK1_SWLOCK34_B_0X0		(0x0u<<2)
#define	BSEC_SWLOCK1_SWLOCK34_B_0X1		(0x1u<<2)
#define	BSEC_SWLOCK1_SWLOCK33_B_0X0		(0x0u<<1)
#define	BSEC_SWLOCK1_SWLOCK33_B_0X1		(0x1u<<1)
#define	BSEC_SWLOCK1_SWLOCK32_B_0X0		(0x0u<<0)
#define	BSEC_SWLOCK1_SWLOCK32_B_0X1		(0x1u<<0)

// SWLOCK2 Configuration

#define	BSEC_SWLOCK2_SWLOCK95			(0x1u<<31)
#define	BSEC_SWLOCK2_SWLOCK94			(0x1u<<30)
#define	BSEC_SWLOCK2_SWLOCK93			(0x1u<<29)
#define	BSEC_SWLOCK2_SWLOCK92			(0x1u<<28)
#define	BSEC_SWLOCK2_SWLOCK91			(0x1u<<27)
#define	BSEC_SWLOCK2_SWLOCK90			(0x1u<<26)
#define	BSEC_SWLOCK2_SWLOCK89			(0x1u<<25)
#define	BSEC_SWLOCK2_SWLOCK88			(0x1u<<24)
#define	BSEC_SWLOCK2_SWLOCK87			(0x1u<<23)
#define	BSEC_SWLOCK2_SWLOCK86			(0x1u<<22)
#define	BSEC_SWLOCK2_SWLOCK85			(0x1u<<21)
#define	BSEC_SWLOCK2_SWLOCK84			(0x1u<<20)
#define	BSEC_SWLOCK2_SWLOCK83			(0x1u<<19)
#define	BSEC_SWLOCK2_SWLOCK82			(0x1u<<18)
#define	BSEC_SWLOCK2_SWLOCK81			(0x1u<<17)
#define	BSEC_SWLOCK2_SWLOCK80			(0x1u<<16)
#define	BSEC_SWLOCK2_SWLOCK79			(0x1u<<15)
#define	BSEC_SWLOCK2_SWLOCK78			(0x1u<<14)
#define	BSEC_SWLOCK2_SWLOCK77			(0x1u<<13)
#define	BSEC_SWLOCK2_SWLOCK76			(0x1u<<12)
#define	BSEC_SWLOCK2_SWLOCK75			(0x1u<<11)
#define	BSEC_SWLOCK2_SWLOCK74			(0x1u<<10)
#define	BSEC_SWLOCK2_SWLOCK73			(0x1u<<9)
#define	BSEC_SWLOCK2_SWLOCK72			(0x1u<<8)
#define	BSEC_SWLOCK2_SWLOCK71			(0x1u<<7)
#define	BSEC_SWLOCK2_SWLOCK70			(0x1u<<6)
#define	BSEC_SWLOCK2_SWLOCK69			(0x1u<<5)
#define	BSEC_SWLOCK2_SWLOCK68			(0x1u<<4)
#define	BSEC_SWLOCK2_SWLOCK67			(0x1u<<3)
#define	BSEC_SWLOCK2_SWLOCK66			(0x1u<<2)
#define	BSEC_SWLOCK2_SWLOCK65			(0x1u<<1)
#define	BSEC_SWLOCK2_SWLOCK64			(0x1u<<0)

