hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SWLOCK2_SWLOCK95_B_0X0		(0x0u<<31)
#define	BSEC_SWLOCK2_SWLOCK95_B_0X1		(0x1u<<31)
#define	BSEC_SWLOCK2_SWLOCK94_B_0X0		(0x0u<<30)
#define	BSEC_SWLOCK2_SWLOCK94_B_0X1		(0x1u<<30)
#define	BSEC_SWLOCK2_SWLOCK93_B_0X0		(0x0u<<29)
#define	BSEC_SWLOCK2_SWLOCK93_B_0X1		(0x1u<<29)
#define	BSEC_SWLOCK2_SWLOCK92_B_0X0		(0x0u<<28)
#define	BSEC_SWLOCK2_SWLOCK92_B_0X1		(0x1u<<28)
#define	BSEC_SWLOCK2_SWLOCK91_B_0X0		(0x0u<<27)
#define	BSEC_SWLOCK2_SWLOCK91_B_0X1		(0x1u<<27)
#define	BSEC_SWLOCK2_SWLOCK90_B_0X0		(0x0u<<26)
#define	BSEC_SWLOCK2_SWLOCK90_B_0X1		(0x1u<<26)
#define	BSEC_SWLOCK2_SWLOCK89_B_0X0		(0x0u<<25)
#define	BSEC_SWLOCK2_SWLOCK89_B_0X1		(0x1u<<25)
#define	BSEC_SWLOCK2_SWLOCK88_B_0X0		(0x0u<<24)
#define	BSEC_SWLOCK2_SWLOCK88_B_0X1		(0x1u<<24)
#define	BSEC_SWLOCK2_SWLOCK87_B_0X0		(0x0u<<23)
#define	BSEC_SWLOCK2_SWLOCK87_B_0X1		(0x1u<<23)
#define	BSEC_SWLOCK2_SWLOCK86_B_0X0		(0x0u<<22)
#define	BSEC_SWLOCK2_SWLOCK86_B_0X1		(0x1u<<22)
#define	BSEC_SWLOCK2_SWLOCK85_B_0X0		(0x0u<<21)
#define	BSEC_SWLOCK2_SWLOCK85_B_0X1		(0x1u<<21)
#define	BSEC_SWLOCK2_SWLOCK84_B_0X0		(0x0u<<20)
#define	BSEC_SWLOCK2_SWLOCK84_B_0X1		(0x1u<<20)
#define	BSEC_SWLOCK2_SWLOCK83_B_0X0		(0x0u<<19)
#define	BSEC_SWLOCK2_SWLOCK83_B_0X1		(0x1u<<19)
#define	BSEC_SWLOCK2_SWLOCK82_B_0X0		(0x0u<<18)
#define	BSEC_SWLOCK2_SWLOCK82_B_0X1		(0x1u<<18)
#define	BSEC_SWLOCK2_SWLOCK81_B_0X0		(0x0u<<17)
#define	BSEC_SWLOCK2_SWLOCK81_B_0X1		(0x1u<<17)
#define	BSEC_SWLOCK2_SWLOCK80_B_0X0		(0x0u<<16)
#define	BSEC_SWLOCK2_SWLOCK80_B_0X1		(0x1u<<16)
#define	BSEC_SWLOCK2_SWLOCK79_B_0X0		(0x0u<<15)
#define	BSEC_SWLOCK2_SWLOCK79_B_0X1		(0x1u<<15)
#define	BSEC_SWLOCK2_SWLOCK78_B_0X0		(0x0u<<14)
#define	BSEC_SWLOCK2_SWLOCK78_B_0X1		(0x1u<<14)
#define	BSEC_SWLOCK2_SWLOCK77_B_0X0		(0x0u<<13)
#define	BSEC_SWLOCK2_SWLOCK77_B_0X1		(0x1u<<13)
#define	BSEC_SWLOCK2_SWLOCK76_B_0X0		(0x0u<<12)
#define	BSEC_SWLOCK2_SWLOCK76_B_0X1		(0x1u<<12)
#define	BSEC_SWLOCK2_SWLOCK75_B_0X0		(0x0u<<11)
#define	BSEC_SWLOCK2_SWLOCK75_B_0X1		(0x1u<<11)
#define	BSEC_SWLOCK2_SWLOCK74_B_0X0		(0x0u<<10)
#define	BSEC_SWLOCK2_SWLOCK74_B_0X1		(0x1u<<10)
#define	BSEC_SWLOCK2_SWLOCK73_B_0X0		(0x0u<<9)
#define	BSEC_SWLOCK2_SWLOCK73_B_0X1		(0x1u<<9)
#define	BSEC_SWLOCK2_SWLOCK72_B_0X0		(0x0u<<8)
#define	BSEC_SWLOCK2_SWLOCK72_B_0X1		(0x1u<<8)
#define	BSEC_SWLOCK2_SWLOCK71_B_0X0		(0x0u<<7)
#define	BSEC_SWLOCK2_SWLOCK71_B_0X1		(0x1u<<7)
#define	BSEC_SWLOCK2_SWLOCK70_B_0X0		(0x0u<<6)
#define	BSEC_SWLOCK2_SWLOCK70_B_0X1		(0x1u<<6)
#define	BSEC_SWLOCK2_SWLOCK69_B_0X0		(0x0u<<5)
#define	BSEC_SWLOCK2_SWLOCK69_B_0X1		(0x1u<<5)
#define	BSEC_SWLOCK2_SWLOCK68_B_0X0		(0x0u<<4)
#define	BSEC_SWLOCK2_SWLOCK68_B_0X1		(0x1u<<4)
#define	BSEC_SWLOCK2_SWLOCK67_B_0X0		(0x0u<<3)
#define	BSEC_SWLOCK2_SWLOCK67_B_0X1		(0x1u<<3)
#define	BSEC_SWLOCK2_SWLOCK66_B_0X0		(0x0u<<2)
#define	BSEC_SWLOCK2_SWLOCK66_B_0X1		(0x1u<<2)
#define	BSEC_SWLOCK2_SWLOCK65_B_0X0		(0x0u<<1)
#define	BSEC_SWLOCK2_SWLOCK65_B_0X1		(0x1u<<1)
#define	BSEC_SWLOCK2_SWLOCK64_B_0X0		(0x0u<<0)
#define	BSEC_SWLOCK2_SWLOCK64_B_0X1		(0x1u<<0)

// SWLOCK3 Configuration

#define	BSEC_SWLOCK3_SWLOCK127			(0x1u<<31)
#define	BSEC_SWLOCK3_SWLOCK126			(0x1u<<30)
#define	BSEC_SWLOCK3_SWLOCK125			(0x1u<<29)
#define	BSEC_SWLOCK3_SWLOCK124			(0x1u<<28)
#define	BSEC_SWLOCK3_SWLOCK123			(0x1u<<27)
#define	BSEC_SWLOCK3_SWLOCK122			(0x1u<<26)
#define	BSEC_SWLOCK3_SWLOCK121			(0x1u<<25)
#define	BSEC_SWLOCK3_SWLOCK120			(0x1u<<24)
#define	BSEC_SWLOCK3_SWLOCK119			(0x1u<<23)
#define	BSEC_SWLOCK3_SWLOCK118			(0x1u<<22)
#define	BSEC_SWLOCK3_SWLOCK117			(0x1u<<21)
#define	BSEC_SWLOCK3_SWLOCK116			(0x1u<<20)
#define	BSEC_SWLOCK3_SWLOCK115			(0x1u<<19)
#define	BSEC_SWLOCK3_SWLOCK114			(0x1u<<18)
#define	BSEC_SWLOCK3_SWLOCK113			(0x1u<<17)
#define	BSEC_SWLOCK3_SWLOCK112			(0x1u<<16)
#define	BSEC_SWLOCK3_SWLOCK111			(0x1u<<15)
#define	BSEC_SWLOCK3_SWLOCK110			(0x1u<<14)
#define	BSEC_SWLOCK3_SWLOCK109			(0x1u<<13)
#define	BSEC_SWLOCK3_SWLOCK108			(0x1u<<12)
#define	BSEC_SWLOCK3_SWLOCK107			(0x1u<<11)
#define	BSEC_SWLOCK3_SWLOCK106			(0x1u<<10)
#define	BSEC_SWLOCK3_SWLOCK105			(0x1u<<9)
#define	BSEC_SWLOCK3_SWLOCK104			(0x1u<<8)
#define	BSEC_SWLOCK3_SWLOCK103			(0x1u<<7)
#define	BSEC_SWLOCK3_SWLOCK102			(0x1u<<6)
#define	BSEC_SWLOCK3_SWLOCK101			(0x1u<<5)
#define	BSEC_SWLOCK3_SWLOCK100			(0x1u<<4)
#define	BSEC_SWLOCK3_SWLOCK99			(0x1u<<3)
#define	BSEC_SWLOCK3_SWLOCK98			(0x1u<<2)
#define	BSEC_SWLOCK3_SWLOCK97			(0x1u<<1)
#define	BSEC_SWLOCK3_SWLOCK96			(0x1u<<0)

#define	BSEC_SWLOCK3_SWLOCK127_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK3_SWLOCK127_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK3_SWLOCK126_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK3_SWLOCK126_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK3_SWLOCK125_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK3_SWLOCK125_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK3_SWLOCK124_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK3_SWLOCK124_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK3_SWLOCK123_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK3_SWLOCK123_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK3_SWLOCK122_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK3_SWLOCK122_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK3_SWLOCK121_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK3_SWLOCK121_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK3_SWLOCK120_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK3_SWLOCK120_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK3_SWLOCK119_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK3_SWLOCK119_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK3_SWLOCK118_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK3_SWLOCK118_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK3_SWLOCK117_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK3_SWLOCK117_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK3_SWLOCK116_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK3_SWLOCK116_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK3_SWLOCK115_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK3_SWLOCK115_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK3_SWLOCK114_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK3_SWLOCK114_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK3_SWLOCK113_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK3_SWLOCK113_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK3_SWLOCK112_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK3_SWLOCK112_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK3_SWLOCK111_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK3_SWLOCK111_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK3_SWLOCK110_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK3_SWLOCK110_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK3_SWLOCK109_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK3_SWLOCK109_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK3_SWLOCK108_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK3_SWLOCK108_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK3_SWLOCK107_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK3_SWLOCK107_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK3_SWLOCK106_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK3_SWLOCK106_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK3_SWLOCK105_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK3_SWLOCK105_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK3_SWLOCK104_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK3_SWLOCK104_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK3_SWLOCK103_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK3_SWLOCK103_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK3_SWLOCK102_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK3_SWLOCK102_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK3_SWLOCK101_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK3_SWLOCK101_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK3_SWLOCK100_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK3_SWLOCK100_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK3_SWLOCK99_B_0X0		(0x0u<<3)
#define	BSEC_SWLOCK3_SWLOCK99_B_0X1		(0x1u<<3)
#define	BSEC_SWLOCK3_SWLOCK98_B_0X0		(0x0u<<2)
#define	BSEC_SWLOCK3_SWLOCK98_B_0X1		(0x1u<<2)
#define	BSEC_SWLOCK3_SWLOCK97_B_0X0		(0x0u<<1)
#define	BSEC_SWLOCK3_SWLOCK97_B_0X1		(0x1u<<1)
#define	BSEC_SWLOCK3_SWLOCK96_B_0X0		(0x0u<<0)
#define	BSEC_SWLOCK3_SWLOCK96_B_0X1		(0x1u<<0)

