hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SWLOCK4 Configuration

#define	BSEC_SWLOCK4_SWLOCK159			(0x1u<<31)
#define	BSEC_SWLOCK4_SWLOCK158			(0x1u<<30)
#define	BSEC_SWLOCK4_SWLOCK157			(0x1u<<29)
#define	BSEC_SWLOCK4_SWLOCK156			(0x1u<<28)
#define	BSEC_SWLOCK4_SWLOCK155			(0x1u<<27)
#define	BSEC_SWLOCK4_SWLOCK154			(0x1u<<26)
#define	BSEC_SWLOCK4_SWLOCK153			(0x1u<<25)
#define	BSEC_SWLOCK4_SWLOCK152			(0x1u<<24)
#define	BSEC_SWLOCK4_SWLOCK151			(0x1u<<23)
#define	BSEC_SWLOCK4_SWLOCK150			(0x1u<<22)
#define	BSEC_SWLOCK4_SWLOCK149			(0x1u<<21)
#define	BSEC_SWLOCK4_SWLOCK148			(0x1u<<20)
#define	BSEC_SWLOCK4_SWLOCK147			(0x1u<<19)
#define	BSEC_SWLOCK4_SWLOCK146			(0x1u<<18)
#define	BSEC_SWLOCK4_SWLOCK145			(0x1u<<17)
#define	BSEC_SWLOCK4_SWLOCK144			(0x1u<<16)
#define	BSEC_SWLOCK4_SWLOCK143			(0x1u<<15)
#define	BSEC_SWLOCK4_SWLOCK142			(0x1u<<14)
#define	BSEC_SWLOCK4_SWLOCK141			(0x1u<<13)
#define	BSEC_SWLOCK4_SWLOCK140			(0x1u<<12)
#define	BSEC_SWLOCK4_SWLOCK139			(0x1u<<11)
#define	BSEC_SWLOCK4_SWLOCK138			(0x1u<<10)
#define	BSEC_SWLOCK4_SWLOCK137			(0x1u<<9)
#define	BSEC_SWLOCK4_SWLOCK136			(0x1u<<8)
#define	BSEC_SWLOCK4_SWLOCK135			(0x1u<<7)
#define	BSEC_SWLOCK4_SWLOCK134			(0x1u<<6)
#define	BSEC_SWLOCK4_SWLOCK133			(0x1u<<5)
#define	BSEC_SWLOCK4_SWLOCK132			(0x1u<<4)
#define	BSEC_SWLOCK4_SWLOCK131			(0x1u<<3)
#define	BSEC_SWLOCK4_SWLOCK130			(0x1u<<2)
#define	BSEC_SWLOCK4_SWLOCK129			(0x1u<<1)
#define	BSEC_SWLOCK4_SWLOCK128			(0x1u<<0)

#define	BSEC_SWLOCK4_SWLOCK159_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK4_SWLOCK159_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK4_SWLOCK158_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK4_SWLOCK158_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK4_SWLOCK157_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK4_SWLOCK157_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK4_SWLOCK156_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK4_SWLOCK156_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK4_SWLOCK155_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK4_SWLOCK155_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK4_SWLOCK154_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK4_SWLOCK154_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK4_SWLOCK153_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK4_SWLOCK153_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK4_SWLOCK152_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK4_SWLOCK152_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK4_SWLOCK151_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK4_SWLOCK151_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK4_SWLOCK150_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK4_SWLOCK150_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK4_SWLOCK149_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK4_SWLOCK149_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK4_SWLOCK148_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK4_SWLOCK148_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK4_SWLOCK147_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK4_SWLOCK147_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK4_SWLOCK146_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK4_SWLOCK146_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK4_SWLOCK145_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK4_SWLOCK145_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK4_SWLOCK144_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK4_SWLOCK144_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK4_SWLOCK143_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK4_SWLOCK143_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK4_SWLOCK142_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK4_SWLOCK142_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK4_SWLOCK141_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK4_SWLOCK141_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK4_SWLOCK140_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK4_SWLOCK140_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK4_SWLOCK139_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK4_SWLOCK139_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK4_SWLOCK138_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK4_SWLOCK138_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK4_SWLOCK137_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK4_SWLOCK137_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK4_SWLOCK136_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK4_SWLOCK136_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK4_SWLOCK135_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK4_SWLOCK135_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK4_SWLOCK134_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK4_SWLOCK134_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK4_SWLOCK133_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK4_SWLOCK133_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK4_SWLOCK132_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK4_SWLOCK132_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK4_SWLOCK131_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK4_SWLOCK131_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK4_SWLOCK130_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK4_SWLOCK130_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK4_SWLOCK129_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK4_SWLOCK129_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK4_SWLOCK128_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK4_SWLOCK128_B_0X1	(0x1u<<0)

// SWLOCK5 Configuration

#define	BSEC_SWLOCK5_SWLOCK191			(0x1u<<31)
#define	BSEC_SWLOCK5_SWLOCK190			(0x1u<<30)
#define	BSEC_SWLOCK5_SWLOCK189			(0x1u<<29)
#define	BSEC_SWLOCK5_SWLOCK188			(0x1u<<28)
#define	BSEC_SWLOCK5_SWLOCK187			(0x1u<<27)
#define	BSEC_SWLOCK5_SWLOCK186			(0x1u<<26)
#define	BSEC_SWLOCK5_SWLOCK185			(0x1u<<25)
#define	BSEC_SWLOCK5_SWLOCK184			(0x1u<<24)
#define	BSEC_SWLOCK5_SWLOCK183			(0x1u<<23)
#define	BSEC_SWLOCK5_SWLOCK182			(0x1u<<22)
#define	BSEC_SWLOCK5_SWLOCK181			(0x1u<<21)
#define	BSEC_SWLOCK5_SWLOCK180			(0x1u<<20)
#define	BSEC_SWLOCK5_SWLOCK179			(0x1u<<19)
#define	BSEC_SWLOCK5_SWLOCK178			(0x1u<<18)
#define	BSEC_SWLOCK5_SWLOCK177			(0x1u<<17)
#define	BSEC_SWLOCK5_SWLOCK176			(0x1u<<16)
#define	BSEC_SWLOCK5_SWLOCK175			(0x1u<<15)
#define	BSEC_SWLOCK5_SWLOCK174			(0x1u<<14)
#define	BSEC_SWLOCK5_SWLOCK173			(0x1u<<13)
#define	BSEC_SWLOCK5_SWLOCK172			(0x1u<<12)
#define	BSEC_SWLOCK5_SWLOCK171			(0x1u<<11)
#define	BSEC_SWLOCK5_SWLOCK170			(0x1u<<10)
#define	BSEC_SWLOCK5_SWLOCK169			(0x1u<<9)
#define	BSEC_SWLOCK5_SWLOCK168			(0x1u<<8)
#define	BSEC_SWLOCK5_SWLOCK167			(0x1u<<7)
#define	BSEC_SWLOCK5_SWLOCK166			(0x1u<<6)
#define	BSEC_SWLOCK5_SWLOCK165			(0x1u<<5)
#define	BSEC_SWLOCK5_SWLOCK164			(0x1u<<4)
#define	BSEC_SWLOCK5_SWLOCK163			(0x1u<<3)
#define	BSEC_SWLOCK5_SWLOCK162			(0x1u<<2)
#define	BSEC_SWLOCK5_SWLOCK161			(0x1u<<1)
#define	BSEC_SWLOCK5_SWLOCK160			(0x1u<<0)

#define	BSEC_SWLOCK5_SWLOCK191_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK5_SWLOCK191_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK5_SWLOCK190_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK5_SWLOCK190_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK5_SWLOCK189_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK5_SWLOCK189_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK5_SWLOCK188_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK5_SWLOCK188_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK5_SWLOCK187_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK5_SWLOCK187_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK5_SWLOCK186_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK5_SWLOCK186_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK5_SWLOCK185_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK5_SWLOCK185_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK5_SWLOCK184_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK5_SWLOCK184_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK5_SWLOCK183_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK5_SWLOCK183_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK5_SWLOCK182_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK5_SWLOCK182_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK5_SWLOCK181_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK5_SWLOCK181_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK5_SWLOCK180_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK5_SWLOCK180_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK5_SWLOCK179_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK5_SWLOCK179_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK5_SWLOCK178_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK5_SWLOCK178_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK5_SWLOCK177_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK5_SWLOCK177_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK5_SWLOCK176_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK5_SWLOCK176_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK5_SWLOCK175_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK5_SWLOCK175_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK5_SWLOCK174_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK5_SWLOCK174_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK5_SWLOCK173_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK5_SWLOCK173_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK5_SWLOCK172_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK5_SWLOCK172_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK5_SWLOCK171_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK5_SWLOCK171_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK5_SWLOCK170_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK5_SWLOCK170_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK5_SWLOCK169_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK5_SWLOCK169_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK5_SWLOCK168_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK5_SWLOCK168_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK5_SWLOCK167_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK5_SWLOCK167_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK5_SWLOCK166_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK5_SWLOCK166_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK5_SWLOCK165_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK5_SWLOCK165_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK5_SWLOCK164_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK5_SWLOCK164_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK5_SWLOCK163_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK5_SWLOCK163_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK5_SWLOCK162_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK5_SWLOCK162_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK5_SWLOCK161_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK5_SWLOCK161_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK5_SWLOCK160_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK5_SWLOCK160_B_0X1	(0x1u<<0)

// SWLOCK6 Configuration

#define	BSEC_SWLOCK6_SWLOCK223			(0x1u<<31)
#define	BSEC_SWLOCK6_SWLOCK222			(0x1u<<30)
#define	BSEC_SWLOCK6_SWLOCK221			(0x1u<<29)
#define	BSEC_SWLOCK6_SWLOCK220			(0x1u<<28)
#define	BSEC_SWLOCK6_SWLOCK219			(0x1u<<27)
#define	BSEC_SWLOCK6_SWLOCK218			(0x1u<<26)
#define	BSEC_SWLOCK6_SWLOCK217			(0x1u<<25)
#define	BSEC_SWLOCK6_SWLOCK216			(0x1u<<24)
#define	BSEC_SWLOCK6_SWLOCK215			(0x1u<<23)
#define	BSEC_SWLOCK6_SWLOCK214			(0x1u<<22)
#define	BSEC_SWLOCK6_SWLOCK213			(0x1u<<21)
#define	BSEC_SWLOCK6_SWLOCK212			(0x1u<<20)
#define	BSEC_SWLOCK6_SWLOCK211			(0x1u<<19)
#define	BSEC_SWLOCK6_SWLOCK210			(0x1u<<18)
#define	BSEC_SWLOCK6_SWLOCK209			(0x1u<<17)
#define	BSEC_SWLOCK6_SWLOCK208			(0x1u<<16)
#define	BSEC_SWLOCK6_SWLOCK207			(0x1u<<15)
#define	BSEC_SWLOCK6_SWLOCK206			(0x1u<<14)
#define	BSEC_SWLOCK6_SWLOCK205			(0x1u<<13)
#define	BSEC_SWLOCK6_SWLOCK204			(0x1u<<12)
#define	BSEC_SWLOCK6_SWLOCK203			(0x1u<<11)
#define	BSEC_SWLOCK6_SWLOCK202			(0x1u<<10)
#define	BSEC_SWLOCK6_SWLOCK201			(0x1u<<9)
#define	BSEC_SWLOCK6_SWLOCK200			(0x1u<<8)
#define	BSEC_SWLOCK6_SWLOCK199			(0x1u<<7)
#define	BSEC_SWLOCK6_SWLOCK198			(0x1u<<6)
#define	BSEC_SWLOCK6_SWLOCK197			(0x1u<<5)
#define	BSEC_SWLOCK6_SWLOCK196			(0x1u<<4)
#define	BSEC_SWLOCK6_SWLOCK195			(0x1u<<3)
#define	BSEC_SWLOCK6_SWLOCK194			(0x1u<<2)
#define	BSEC_SWLOCK6_SWLOCK193			(0x1u<<1)
#define	BSEC_SWLOCK6_SWLOCK192			(0x1u<<0)

#define	BSEC_SWLOCK6_SWLOCK223_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK6_SWLOCK223_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK6_SWLOCK222_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK6_SWLOCK222_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK6_SWLOCK221_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK6_SWLOCK221_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK6_SWLOCK220_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK6_SWLOCK220_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK6_SWLOCK219_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK6_SWLOCK219_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK6_SWLOCK218_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK6_SWLOCK218_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK6_SWLOCK217_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK6_SWLOCK217_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK6_SWLOCK216_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK6_SWLOCK216_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK6_SWLOCK215_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK6_SWLOCK215_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK6_SWLOCK214_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK6_SWLOCK214_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK6_SWLOCK213_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK6_SWLOCK213_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK6_SWLOCK212_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK6_SWLOCK212_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK6_SWLOCK211_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK6_SWLOCK211_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK6_SWLOCK210_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK6_SWLOCK210_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK6_SWLOCK209_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK6_SWLOCK209_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK6_SWLOCK208_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK6_SWLOCK208_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK6_SWLOCK207_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK6_SWLOCK207_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK6_SWLOCK206_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK6_SWLOCK206_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK6_SWLOCK205_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK6_SWLOCK205_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK6_SWLOCK204_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK6_SWLOCK204_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK6_SWLOCK203_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK6_SWLOCK203_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK6_SWLOCK202_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK6_SWLOCK202_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK6_SWLOCK201_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK6_SWLOCK201_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK6_SWLOCK200_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK6_SWLOCK200_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK6_SWLOCK199_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK6_SWLOCK199_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK6_SWLOCK198_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK6_SWLOCK198_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK6_SWLOCK197_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK6_SWLOCK197_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK6_SWLOCK196_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK6_SWLOCK196_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK6_SWLOCK195_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK6_SWLOCK195_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK6_SWLOCK194_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK6_SWLOCK194_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK6_SWLOCK193_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK6_SWLOCK193_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK6_SWLOCK192_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK6_SWLOCK192_B_0X1	(0x1u<<0)

// SWLOCK7 Configuration

#define	BSEC_SWLOCK7_SWLOCK255			(0x1u<<31)
#define	BSEC_SWLOCK7_SWLOCK254			(0x1u<<30)
#define	BSEC_SWLOCK7_SWLOCK253			(0x1u<<29)
#define	BSEC_SWLOCK7_SWLOCK252			(0x1u<<28)
#define	BSEC_SWLOCK7_SWLOCK251			(0x1u<<27)
#define	BSEC_SWLOCK7_SWLOCK250			(0x1u<<26)
#define	BSEC_SWLOCK7_SWLOCK249			(0x1u<<25)
#define	BSEC_SWLOCK7_SWLOCK248			(0x1u<<24)
#define	BSEC_SWLOCK7_SWLOCK247			(0x1u<<23)
#define	BSEC_SWLOCK7_SWLOCK246			(0x1u<<22)
#define	BSEC_SWLOCK7_SWLOCK245			(0x1u<<21)
#define	BSEC_SWLOCK7_SWLOCK244			(0x1u<<20)
#define	BSEC_SWLOCK7_SWLOCK243			(0x1u<<19)
#define	BSEC_SWLOCK7_SWLOCK242			(0x1u<<18)
#define	BSEC_SWLOCK7_SWLOCK241			(0x1u<<17)
#define	BSEC_SWLOCK7_SWLOCK240			(0x1u<<16)
#define	BSEC_SWLOCK7_SWLOCK239			(0x1u<<15)
#define	BSEC_SWLOCK7_SWLOCK238			(0x1u<<14)
#define	BSEC_SWLOCK7_SWLOCK237			(0x1u<<13)
#define	BSEC_SWLOCK7_SWLOCK236			(0x1u<<12)
#define	BSEC_SWLOCK7_SWLOCK235			(0x1u<<11)
#define	BSEC_SWLOCK7_SWLOCK234			(0x1u<<10)
#define	BSEC_SWLOCK7_SWLOCK233			(0x1u<<9)
#define	BSEC_SWLOCK7_SWLOCK232			(0x1u<<8)
#define	BSEC_SWLOCK7_SWLOCK231			(0x1u<<7)
#define	BSEC_SWLOCK7_SWLOCK230			(0x1u<<6)
#define	BSEC_SWLOCK7_SWLOCK229			(0x1u<<5)
#define	BSEC_SWLOCK7_SWLOCK228			(0x1u<<4)
#define	BSEC_SWLOCK7_SWLOCK227			(0x1u<<3)
#define	BSEC_SWLOCK7_SWLOCK226			(0x1u<<2)
#define	BSEC_SWLOCK7_SWLOCK225			(0x1u<<1)
#define	BSEC_SWLOCK7_SWLOCK224			(0x1u<<0)

#define	BSEC_SWLOCK7_SWLOCK255_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK7_SWLOCK255_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK7_SWLOCK254_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK7_SWLOCK254_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK7_SWLOCK253_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK7_SWLOCK253_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK7_SWLOCK252_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK7_SWLOCK252_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK7_SWLOCK251_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK7_SWLOCK251_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK7_SWLOCK250_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK7_SWLOCK250_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK7_SWLOCK249_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK7_SWLOCK249_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK7_SWLOCK248_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK7_SWLOCK248_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK7_SWLOCK247_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK7_SWLOCK247_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK7_SWLOCK246_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK7_SWLOCK246_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK7_SWLOCK245_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK7_SWLOCK245_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK7_SWLOCK244_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK7_SWLOCK244_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK7_SWLOCK243_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK7_SWLOCK243_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK7_SWLOCK242_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK7_SWLOCK242_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK7_SWLOCK241_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK7_SWLOCK241_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK7_SWLOCK240_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK7_SWLOCK240_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK7_SWLOCK239_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK7_SWLOCK239_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK7_SWLOCK238_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK7_SWLOCK238_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK7_SWLOCK237_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK7_SWLOCK237_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK7_SWLOCK236_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK7_SWLOCK236_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK7_SWLOCK235_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK7_SWLOCK235_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK7_SWLOCK234_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK7_SWLOCK234_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK7_SWLOCK233_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK7_SWLOCK233_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK7_SWLOCK232_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK7_SWLOCK232_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK7_SWLOCK231_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK7_SWLOCK231_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK7_SWLOCK230_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK7_SWLOCK230_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK7_SWLOCK229_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK7_SWLOCK229_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK7_SWLOCK228_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK7_SWLOCK228_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK7_SWLOCK227_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK7_SWLOCK227_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK7_SWLOCK226_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK7_SWLOCK226_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK7_SWLOCK225_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK7_SWLOCK225_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK7_SWLOCK224_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK7_SWLOCK224_B_0X1	(0x1u<<0)

