hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SWLOCK8 Configuration

#define	BSEC_SWLOCK8_SWLOCK287			(0x1u<<31)
#define	BSEC_SWLOCK8_SWLOCK286			(0x1u<<30)
#define	BSEC_SWLOCK8_SWLOCK285			(0x1u<<29)
#define	BSEC_SWLOCK8_SWLOCK284			(0x1u<<28)
#define	BSEC_SWLOCK8_SWLOCK283			(0x1u<<27)
#define	BSEC_SWLOCK8_SWLOCK282			(0x1u<<26)
#define	BSEC_SWLOCK8_SWLOCK281			(0x1u<<25)
#define	BSEC_SWLOCK8_SWLOCK280			(0x1u<<24)
#define	BSEC_SWLOCK8_SWLOCK279			(0x1u<<23)
#define	BSEC_SWLOCK8_SWLOCK278			(0x1u<<22)
#define	BSEC_SWLOCK8_SWLOCK277			(0x1u<<21)
#define	BSEC_SWLOCK8_SWLOCK276			(0x1u<<20)
#define	BSEC_SWLOCK8_SWLOCK275			(0x1u<<19)
#define	BSEC_SWLOCK8_SWLOCK274			(0x1u<<18)
#define	BSEC_SWLOCK8_SWLOCK273			(0x1u<<17)
#define	BSEC_SWLOCK8_SWLOCK272			(0x1u<<16)
#define	BSEC_SWLOCK8_SWLOCK271			(0x1u<<15)
#define	BSEC_SWLOCK8_SWLOCK270			(0x1u<<14)
#define	BSEC_SWLOCK8_SWLOCK269			(0x1u<<13)
#define	BSEC_SWLOCK8_SWLOCK268			(0x1u<<12)
#define	BSEC_SWLOCK8_SWLOCK267			(0x1u<<11)
#define	BSEC_SWLOCK8_SWLOCK266			(0x1u<<10)
#define	BSEC_SWLOCK8_SWLOCK265			(0x1u<<9)
#define	BSEC_SWLOCK8_SWLOCK264			(0x1u<<8)
#define	BSEC_SWLOCK8_SWLOCK263			(0x1u<<7)
#define	BSEC_SWLOCK8_SWLOCK262			(0x1u<<6)
#define	BSEC_SWLOCK8_SWLOCK261			(0x1u<<5)
#define	BSEC_SWLOCK8_SWLOCK260			(0x1u<<4)
#define	BSEC_SWLOCK8_SWLOCK259			(0x1u<<3)
#define	BSEC_SWLOCK8_SWLOCK258			(0x1u<<2)
#define	BSEC_SWLOCK8_SWLOCK257			(0x1u<<1)
#define	BSEC_SWLOCK8_SWLOCK256			(0x1u<<0)

#define	BSEC_SWLOCK8_SWLOCK287_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK8_SWLOCK287_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK8_SWLOCK286_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK8_SWLOCK286_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK8_SWLOCK285_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK8_SWLOCK285_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK8_SWLOCK284_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK8_SWLOCK284_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK8_SWLOCK283_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK8_SWLOCK283_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK8_SWLOCK282_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK8_SWLOCK282_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK8_SWLOCK281_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK8_SWLOCK281_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK8_SWLOCK280_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK8_SWLOCK280_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK8_SWLOCK279_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK8_SWLOCK279_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK8_SWLOCK278_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK8_SWLOCK278_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK8_SWLOCK277_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK8_SWLOCK277_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK8_SWLOCK276_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK8_SWLOCK276_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK8_SWLOCK275_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK8_SWLOCK275_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK8_SWLOCK274_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK8_SWLOCK274_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK8_SWLOCK273_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK8_SWLOCK273_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK8_SWLOCK272_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK8_SWLOCK272_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK8_SWLOCK271_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK8_SWLOCK271_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK8_SWLOCK270_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK8_SWLOCK270_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK8_SWLOCK269_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK8_SWLOCK269_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK8_SWLOCK268_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK8_SWLOCK268_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK8_SWLOCK267_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK8_SWLOCK267_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK8_SWLOCK266_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK8_SWLOCK266_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK8_SWLOCK265_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK8_SWLOCK265_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK8_SWLOCK264_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK8_SWLOCK264_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK8_SWLOCK263_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK8_SWLOCK263_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK8_SWLOCK262_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK8_SWLOCK262_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK8_SWLOCK261_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK8_SWLOCK261_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK8_SWLOCK260_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK8_SWLOCK260_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK8_SWLOCK259_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK8_SWLOCK259_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK8_SWLOCK258_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK8_SWLOCK258_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK8_SWLOCK257_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK8_SWLOCK257_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK8_SWLOCK256_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK8_SWLOCK256_B_0X1	(0x1u<<0)

// SWLOCK9 Configuration

#define	BSEC_SWLOCK9_SWLOCK319			(0x1u<<31)
#define	BSEC_SWLOCK9_SWLOCK318			(0x1u<<30)
#define	BSEC_SWLOCK9_SWLOCK317			(0x1u<<29)
#define	BSEC_SWLOCK9_SWLOCK316			(0x1u<<28)
#define	BSEC_SWLOCK9_SWLOCK315			(0x1u<<27)
#define	BSEC_SWLOCK9_SWLOCK314			(0x1u<<26)
#define	BSEC_SWLOCK9_SWLOCK313			(0x1u<<25)
#define	BSEC_SWLOCK9_SWLOCK312			(0x1u<<24)
#define	BSEC_SWLOCK9_SWLOCK311			(0x1u<<23)
#define	BSEC_SWLOCK9_SWLOCK310			(0x1u<<22)
#define	BSEC_SWLOCK9_SWLOCK309			(0x1u<<21)
#define	BSEC_SWLOCK9_SWLOCK308			(0x1u<<20)
#define	BSEC_SWLOCK9_SWLOCK307			(0x1u<<19)
#define	BSEC_SWLOCK9_SWLOCK306			(0x1u<<18)
#define	BSEC_SWLOCK9_SWLOCK305			(0x1u<<17)
#define	BSEC_SWLOCK9_SWLOCK304			(0x1u<<16)
#define	BSEC_SWLOCK9_SWLOCK303			(0x1u<<15)
#define	BSEC_SWLOCK9_SWLOCK302			(0x1u<<14)
#define	BSEC_SWLOCK9_SWLOCK301			(0x1u<<13)
#define	BSEC_SWLOCK9_SWLOCK300			(0x1u<<12)
#define	BSEC_SWLOCK9_SWLOCK299			(0x1u<<11)
#define	BSEC_SWLOCK9_SWLOCK298			(0x1u<<10)
#define	BSEC_SWLOCK9_SWLOCK297			(0x1u<<9)
#define	BSEC_SWLOCK9_SWLOCK296			(0x1u<<8)
#define	BSEC_SWLOCK9_SWLOCK295			(0x1u<<7)
#define	BSEC_SWLOCK9_SWLOCK294			(0x1u<<6)
#define	BSEC_SWLOCK9_SWLOCK293			(0x1u<<5)
#define	BSEC_SWLOCK9_SWLOCK292			(0x1u<<4)
#define	BSEC_SWLOCK9_SWLOCK291			(0x1u<<3)
#define	BSEC_SWLOCK9_SWLOCK290			(0x1u<<2)
#define	BSEC_SWLOCK9_SWLOCK289			(0x1u<<1)
#define	BSEC_SWLOCK9_SWLOCK288			(0x1u<<0)

#define	BSEC_SWLOCK9_SWLOCK319_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK9_SWLOCK319_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK9_SWLOCK318_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK9_SWLOCK318_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK9_SWLOCK317_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK9_SWLOCK317_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK9_SWLOCK316_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK9_SWLOCK316_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK9_SWLOCK315_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK9_SWLOCK315_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK9_SWLOCK314_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK9_SWLOCK314_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK9_SWLOCK313_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK9_SWLOCK313_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK9_SWLOCK312_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK9_SWLOCK312_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK9_SWLOCK311_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK9_SWLOCK311_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK9_SWLOCK310_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK9_SWLOCK310_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK9_SWLOCK309_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK9_SWLOCK309_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK9_SWLOCK308_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK9_SWLOCK308_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK9_SWLOCK307_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK9_SWLOCK307_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK9_SWLOCK306_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK9_SWLOCK306_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK9_SWLOCK305_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK9_SWLOCK305_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK9_SWLOCK304_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK9_SWLOCK304_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK9_SWLOCK303_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK9_SWLOCK303_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK9_SWLOCK302_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK9_SWLOCK302_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK9_SWLOCK301_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK9_SWLOCK301_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK9_SWLOCK300_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK9_SWLOCK300_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK9_SWLOCK299_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK9_SWLOCK299_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK9_SWLOCK298_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK9_SWLOCK298_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK9_SWLOCK297_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK9_SWLOCK297_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK9_SWLOCK296_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK9_SWLOCK296_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK9_SWLOCK295_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK9_SWLOCK295_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK9_SWLOCK294_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK9_SWLOCK294_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK9_SWLOCK293_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK9_SWLOCK293_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK9_SWLOCK292_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK9_SWLOCK292_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK9_SWLOCK291_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK9_SWLOCK291_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK9_SWLOCK290_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK9_SWLOCK290_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK9_SWLOCK289_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK9_SWLOCK289_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK9_SWLOCK288_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK9_SWLOCK288_B_0X1	(0x1u<<0)

