hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SWLOCK10 Configuration

#define	BSEC_SWLOCK10_SWLOCK351			(0x1u<<31)
#define	BSEC_SWLOCK10_SWLOCK350			(0x1u<<30)
#define	BSEC_SWLOCK10_SWLOCK349			(0x1u<<29)
#define	BSEC_SWLOCK10_SWLOCK348			(0x1u<<28)
#define	BSEC_SWLOCK10_SWLOCK347			(0x1u<<27)
#define	BSEC_SWLOCK10_SWLOCK346			(0x1u<<26)
#define	BSEC_SWLOCK10_SWLOCK345			(0x1u<<25)
#define	BSEC_SWLOCK10_SWLOCK344			(0x1u<<24)
#define	BSEC_SWLOCK10_SWLOCK343			(0x1u<<23)
#define	BSEC_SWLOCK10_SWLOCK342			(0x1u<<22)
#define	BSEC_SWLOCK10_SWLOCK341			(0x1u<<21)
#define	BSEC_SWLOCK10_SWLOCK340			(0x1u<<20)
#define	BSEC_SWLOCK10_SWLOCK339			(0x1u<<19)
#define	BSEC_SWLOCK10_SWLOCK338			(0x1u<<18)
#define	BSEC_SWLOCK10_SWLOCK337			(0x1u<<17)
#define	BSEC_SWLOCK10_SWLOCK336			(0x1u<<16)
#define	BSEC_SWLOCK10_SWLOCK335			(0x1u<<15)
#define	BSEC_SWLOCK10_SWLOCK334			(0x1u<<14)
#define	BSEC_SWLOCK10_SWLOCK333			(0x1u<<13)
#define	BSEC_SWLOCK10_SWLOCK332			(0x1u<<12)
#define	BSEC_SWLOCK10_SWLOCK331			(0x1u<<11)
#define	BSEC_SWLOCK10_SWLOCK330			(0x1u<<10)
#define	BSEC_SWLOCK10_SWLOCK329			(0x1u<<9)
#define	BSEC_SWLOCK10_SWLOCK328			(0x1u<<8)
#define	BSEC_SWLOCK10_SWLOCK327			(0x1u<<7)
#define	BSEC_SWLOCK10_SWLOCK326			(0x1u<<6)
#define	BSEC_SWLOCK10_SWLOCK325			(0x1u<<5)
#define	BSEC_SWLOCK10_SWLOCK324			(0x1u<<4)
#define	BSEC_SWLOCK10_SWLOCK323			(0x1u<<3)
#define	BSEC_SWLOCK10_SWLOCK322			(0x1u<<2)
#define	BSEC_SWLOCK10_SWLOCK321			(0x1u<<1)
#define	BSEC_SWLOCK10_SWLOCK320			(0x1u<<0)

#define	BSEC_SWLOCK10_SWLOCK351_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK10_SWLOCK351_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK10_SWLOCK350_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK10_SWLOCK350_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK10_SWLOCK349_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK10_SWLOCK349_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK10_SWLOCK348_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK10_SWLOCK348_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK10_SWLOCK347_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK10_SWLOCK347_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK10_SWLOCK346_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK10_SWLOCK346_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK10_SWLOCK345_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK10_SWLOCK345_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK10_SWLOCK344_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK10_SWLOCK344_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK10_SWLOCK343_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK10_SWLOCK343_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK10_SWLOCK342_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK10_SWLOCK342_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK10_SWLOCK341_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK10_SWLOCK341_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK10_SWLOCK340_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK10_SWLOCK340_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK10_SWLOCK339_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK10_SWLOCK339_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK10_SWLOCK338_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK10_SWLOCK338_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK10_SWLOCK337_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK10_SWLOCK337_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK10_SWLOCK336_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK10_SWLOCK336_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK10_SWLOCK335_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK10_SWLOCK335_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK10_SWLOCK334_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK10_SWLOCK334_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK10_SWLOCK333_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK10_SWLOCK333_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK10_SWLOCK332_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK10_SWLOCK332_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK10_SWLOCK331_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK10_SWLOCK331_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK10_SWLOCK330_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK10_SWLOCK330_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK10_SWLOCK329_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK10_SWLOCK329_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK10_SWLOCK328_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK10_SWLOCK328_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK10_SWLOCK327_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK10_SWLOCK327_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK10_SWLOCK326_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK10_SWLOCK326_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK10_SWLOCK325_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK10_SWLOCK325_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK10_SWLOCK324_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK10_SWLOCK324_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK10_SWLOCK323_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK10_SWLOCK323_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK10_SWLOCK322_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK10_SWLOCK322_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK10_SWLOCK321_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK10_SWLOCK321_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK10_SWLOCK320_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK10_SWLOCK320_B_0X1	(0x1u<<0)

// SWLOCK11 Configuration

#define	BSEC_SWLOCK11_SWLOCK383			(0x1u<<31)
#define	BSEC_SWLOCK11_SWLOCK382			(0x1u<<30)
#define	BSEC_SWLOCK11_SWLOCK381			(0x1u<<29)
#define	BSEC_SWLOCK11_SWLOCK380			(0x1u<<28)
#define	BSEC_SWLOCK11_SWLOCK379			(0x1u<<27)
#define	BSEC_SWLOCK11_SWLOCK378			(0x1u<<26)
#define	BSEC_SWLOCK11_SWLOCK377			(0x1u<<25)
#define	BSEC_SWLOCK11_SWLOCK376			(0x1u<<24)
#define	BSEC_SWLOCK11_SWLOCK375			(0x1u<<23)
#define	BSEC_SWLOCK11_SWLOCK374			(0x1u<<22)
#define	BSEC_SWLOCK11_SWLOCK373			(0x1u<<21)
#define	BSEC_SWLOCK11_SWLOCK372			(0x1u<<20)
#define	BSEC_SWLOCK11_SWLOCK371			(0x1u<<19)
#define	BSEC_SWLOCK11_SWLOCK370			(0x1u<<18)
#define	BSEC_SWLOCK11_SWLOCK369			(0x1u<<17)
#define	BSEC_SWLOCK11_SWLOCK368			(0x1u<<16)
#define	BSEC_SWLOCK11_SWLOCK367			(0x1u<<15)
#define	BSEC_SWLOCK11_SWLOCK366			(0x1u<<14)
#define	BSEC_SWLOCK11_SWLOCK365			(0x1u<<13)
#define	BSEC_SWLOCK11_SWLOCK364			(0x1u<<12)
#define	BSEC_SWLOCK11_SWLOCK363			(0x1u<<11)
#define	BSEC_SWLOCK11_SWLOCK362			(0x1u<<10)
#define	BSEC_SWLOCK11_SWLOCK361			(0x1u<<9)
#define	BSEC_SWLOCK11_SWLOCK360			(0x1u<<8)
#define	BSEC_SWLOCK11_SWLOCK359			(0x1u<<7)
#define	BSEC_SWLOCK11_SWLOCK358			(0x1u<<6)
#define	BSEC_SWLOCK11_SWLOCK357			(0x1u<<5)
#define	BSEC_SWLOCK11_SWLOCK356			(0x1u<<4)
#define	BSEC_SWLOCK11_SWLOCK355			(0x1u<<3)
#define	BSEC_SWLOCK11_SWLOCK354			(0x1u<<2)
#define	BSEC_SWLOCK11_SWLOCK353			(0x1u<<1)
#define	BSEC_SWLOCK11_SWLOCK352			(0x1u<<0)

#define	BSEC_SWLOCK11_SWLOCK383_B_0X0	(0x0u<<31)
#define	BSEC_SWLOCK11_SWLOCK383_B_0X1	(0x1u<<31)
#define	BSEC_SWLOCK11_SWLOCK382_B_0X0	(0x0u<<30)
#define	BSEC_SWLOCK11_SWLOCK382_B_0X1	(0x1u<<30)
#define	BSEC_SWLOCK11_SWLOCK381_B_0X0	(0x0u<<29)
#define	BSEC_SWLOCK11_SWLOCK381_B_0X1	(0x1u<<29)
#define	BSEC_SWLOCK11_SWLOCK380_B_0X0	(0x0u<<28)
#define	BSEC_SWLOCK11_SWLOCK380_B_0X1	(0x1u<<28)
#define	BSEC_SWLOCK11_SWLOCK379_B_0X0	(0x0u<<27)
#define	BSEC_SWLOCK11_SWLOCK379_B_0X1	(0x1u<<27)
#define	BSEC_SWLOCK11_SWLOCK378_B_0X0	(0x0u<<26)
#define	BSEC_SWLOCK11_SWLOCK378_B_0X1	(0x1u<<26)
#define	BSEC_SWLOCK11_SWLOCK377_B_0X0	(0x0u<<25)
#define	BSEC_SWLOCK11_SWLOCK377_B_0X1	(0x1u<<25)
#define	BSEC_SWLOCK11_SWLOCK376_B_0X0	(0x0u<<24)
#define	BSEC_SWLOCK11_SWLOCK376_B_0X1	(0x1u<<24)
#define	BSEC_SWLOCK11_SWLOCK375_B_0X0	(0x0u<<23)
#define	BSEC_SWLOCK11_SWLOCK375_B_0X1	(0x1u<<23)
#define	BSEC_SWLOCK11_SWLOCK374_B_0X0	(0x0u<<22)
#define	BSEC_SWLOCK11_SWLOCK374_B_0X1	(0x1u<<22)
#define	BSEC_SWLOCK11_SWLOCK373_B_0X0	(0x0u<<21)
#define	BSEC_SWLOCK11_SWLOCK373_B_0X1	(0x1u<<21)
#define	BSEC_SWLOCK11_SWLOCK372_B_0X0	(0x0u<<20)
#define	BSEC_SWLOCK11_SWLOCK372_B_0X1	(0x1u<<20)
#define	BSEC_SWLOCK11_SWLOCK371_B_0X0	(0x0u<<19)
#define	BSEC_SWLOCK11_SWLOCK371_B_0X1	(0x1u<<19)
#define	BSEC_SWLOCK11_SWLOCK370_B_0X0	(0x0u<<18)
#define	BSEC_SWLOCK11_SWLOCK370_B_0X1	(0x1u<<18)
#define	BSEC_SWLOCK11_SWLOCK369_B_0X0	(0x0u<<17)
#define	BSEC_SWLOCK11_SWLOCK369_B_0X1	(0x1u<<17)
#define	BSEC_SWLOCK11_SWLOCK368_B_0X0	(0x0u<<16)
#define	BSEC_SWLOCK11_SWLOCK368_B_0X1	(0x1u<<16)
#define	BSEC_SWLOCK11_SWLOCK367_B_0X0	(0x0u<<15)
#define	BSEC_SWLOCK11_SWLOCK367_B_0X1	(0x1u<<15)
#define	BSEC_SWLOCK11_SWLOCK366_B_0X0	(0x0u<<14)
#define	BSEC_SWLOCK11_SWLOCK366_B_0X1	(0x1u<<14)
#define	BSEC_SWLOCK11_SWLOCK365_B_0X0	(0x0u<<13)
#define	BSEC_SWLOCK11_SWLOCK365_B_0X1	(0x1u<<13)
#define	BSEC_SWLOCK11_SWLOCK364_B_0X0	(0x0u<<12)
#define	BSEC_SWLOCK11_SWLOCK364_B_0X1	(0x1u<<12)
#define	BSEC_SWLOCK11_SWLOCK363_B_0X0	(0x0u<<11)
#define	BSEC_SWLOCK11_SWLOCK363_B_0X1	(0x1u<<11)
#define	BSEC_SWLOCK11_SWLOCK362_B_0X0	(0x0u<<10)
#define	BSEC_SWLOCK11_SWLOCK362_B_0X1	(0x1u<<10)
#define	BSEC_SWLOCK11_SWLOCK361_B_0X0	(0x0u<<9)
#define	BSEC_SWLOCK11_SWLOCK361_B_0X1	(0x1u<<9)
#define	BSEC_SWLOCK11_SWLOCK360_B_0X0	(0x0u<<8)
#define	BSEC_SWLOCK11_SWLOCK360_B_0X1	(0x1u<<8)
#define	BSEC_SWLOCK11_SWLOCK359_B_0X0	(0x0u<<7)
#define	BSEC_SWLOCK11_SWLOCK359_B_0X1	(0x1u<<7)
#define	BSEC_SWLOCK11_SWLOCK358_B_0X0	(0x0u<<6)
#define	BSEC_SWLOCK11_SWLOCK358_B_0X1	(0x1u<<6)
#define	BSEC_SWLOCK11_SWLOCK357_B_0X0	(0x0u<<5)
#define	BSEC_SWLOCK11_SWLOCK357_B_0X1	(0x1u<<5)
#define	BSEC_SWLOCK11_SWLOCK356_B_0X0	(0x0u<<4)
#define	BSEC_SWLOCK11_SWLOCK356_B_0X1	(0x1u<<4)
#define	BSEC_SWLOCK11_SWLOCK355_B_0X0	(0x0u<<3)
#define	BSEC_SWLOCK11_SWLOCK355_B_0X1	(0x1u<<3)
#define	BSEC_SWLOCK11_SWLOCK354_B_0X0	(0x0u<<2)
#define	BSEC_SWLOCK11_SWLOCK354_B_0X1	(0x1u<<2)
#define	BSEC_SWLOCK11_SWLOCK353_B_0X0	(0x0u<<1)
#define	BSEC_SWLOCK11_SWLOCK353_B_0X1	(0x1u<<1)
#define	BSEC_SWLOCK11_SWLOCK352_B_0X0	(0x0u<<0)
#define	BSEC_SWLOCK11_SWLOCK352_B_0X1	(0x1u<<0)

