hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SRLOCK0 Configuration

#define	BSEC_SRLOCK0_SRLOCK31			(0x1u<<31)
#define	BSEC_SRLOCK0_SRLOCK30			(0x1u<<30)
#define	BSEC_SRLOCK0_SRLOCK29			(0x1u<<29)
#define	BSEC_SRLOCK0_SRLOCK28			(0x1u<<28)
#define	BSEC_SRLOCK0_SRLOCK27			(0x1u<<27)
#define	BSEC_SRLOCK0_SRLOCK26			(0x1u<<26)
#define	BSEC_SRLOCK0_SRLOCK25			(0x1u<<25)
#define	BSEC_SRLOCK0_SRLOCK24			(0x1u<<24)
#define	BSEC_SRLOCK0_SRLOCK23			(0x1u<<23)
#define	BSEC_SRLOCK0_SRLOCK22			(0x1u<<22)
#define	BSEC_SRLOCK0_SRLOCK21			(0x1u<<21)
#define	BSEC_SRLOCK0_SRLOCK20			(0x1u<<20)
#define	BSEC_SRLOCK0_SRLOCK19			(0x1u<<19)
#define	BSEC_SRLOCK0_SRLOCK18			(0x1u<<18)
#define	BSEC_SRLOCK0_SRLOCK17			(0x1u<<17)
#define	BSEC_SRLOCK0_SRLOCK16			(0x1u<<16)
#define	BSEC_SRLOCK0_SRLOCK15			(0x1u<<15)
#define	BSEC_SRLOCK0_SRLOCK14			(0x1u<<14)
#define	BSEC_SRLOCK0_SRLOCK13			(0x1u<<13)
#define	BSEC_SRLOCK0_SRLOCK12			(0x1u<<12)
#define	BSEC_SRLOCK0_SRLOCK11			(0x1u<<11)
#define	BSEC_SRLOCK0_SRLOCK10			(0x1u<<10)
#define	BSEC_SRLOCK0_SRLOCK9			(0x1u<<9)
#define	BSEC_SRLOCK0_SRLOCK8			(0x1u<<8)
#define	BSEC_SRLOCK0_SRLOCK7			(0x1u<<7)
#define	BSEC_SRLOCK0_SRLOCK6			(0x1u<<6)
#define	BSEC_SRLOCK0_SRLOCK5			(0x1u<<5)
#define	BSEC_SRLOCK0_SRLOCK4			(0x1u<<4)
#define	BSEC_SRLOCK0_SRLOCK3			(0x1u<<3)
#define	BSEC_SRLOCK0_SRLOCK2			(0x1u<<2)
#define	BSEC_SRLOCK0_SRLOCK1			(0x1u<<1)
#define	BSEC_SRLOCK0_SRLOCK0			(0x1u<<0)

#define	BSEC_SRLOCK0_SRLOCK31_B_0X0		(0x0u<<31)
#define	BSEC_SRLOCK0_SRLOCK31_B_0X1		(0x1u<<31)
#define	BSEC_SRLOCK0_SRLOCK30_B_0X0		(0x0u<<30)
#define	BSEC_SRLOCK0_SRLOCK30_B_0X1		(0x1u<<30)
#define	BSEC_SRLOCK0_SRLOCK29_B_0X0		(0x0u<<29)
#define	BSEC_SRLOCK0_SRLOCK29_B_0X1		(0x1u<<29)
#define	BSEC_SRLOCK0_SRLOCK28_B_0X0		(0x0u<<28)
#define	BSEC_SRLOCK0_SRLOCK28_B_0X1		(0x1u<<28)
#define	BSEC_SRLOCK0_SRLOCK27_B_0X0		(0x0u<<27)
#define	BSEC_SRLOCK0_SRLOCK27_B_0X1		(0x1u<<27)
#define	BSEC_SRLOCK0_SRLOCK26_B_0X0		(0x0u<<26)
#define	BSEC_SRLOCK0_SRLOCK26_B_0X1		(0x1u<<26)
#define	BSEC_SRLOCK0_SRLOCK25_B_0X0		(0x0u<<25)
#define	BSEC_SRLOCK0_SRLOCK25_B_0X1		(0x1u<<25)
#define	BSEC_SRLOCK0_SRLOCK24_B_0X0		(0x0u<<24)
#define	BSEC_SRLOCK0_SRLOCK24_B_0X1		(0x1u<<24)
#define	BSEC_SRLOCK0_SRLOCK23_B_0X0		(0x0u<<23)
#define	BSEC_SRLOCK0_SRLOCK23_B_0X1		(0x1u<<23)
#define	BSEC_SRLOCK0_SRLOCK22_B_0X0		(0x0u<<22)
#define	BSEC_SRLOCK0_SRLOCK22_B_0X1		(0x1u<<22)
#define	BSEC_SRLOCK0_SRLOCK21_B_0X0		(0x0u<<21)
#define	BSEC_SRLOCK0_SRLOCK21_B_0X1		(0x1u<<21)
#define	BSEC_SRLOCK0_SRLOCK20_B_0X0		(0x0u<<20)
#define	BSEC_SRLOCK0_SRLOCK20_B_0X1		(0x1u<<20)
#define	BSEC_SRLOCK0_SRLOCK19_B_0X0		(0x0u<<19)
#define	BSEC_SRLOCK0_SRLOCK19_B_0X1		(0x1u<<19)
#define	BSEC_SRLOCK0_SRLOCK18_B_0X0		(0x0u<<18)
#define	BSEC_SRLOCK0_SRLOCK18_B_0X1		(0x1u<<18)
#define	BSEC_SRLOCK0_SRLOCK17_B_0X0		(0x0u<<17)
#define	BSEC_SRLOCK0_SRLOCK17_B_0X1		(0x1u<<17)
#define	BSEC_SRLOCK0_SRLOCK16_B_0X0		(0x0u<<16)
#define	BSEC_SRLOCK0_SRLOCK16_B_0X1		(0x1u<<16)
#define	BSEC_SRLOCK0_SRLOCK15_B_0X0		(0x0u<<15)
#define	BSEC_SRLOCK0_SRLOCK15_B_0X1		(0x1u<<15)
#define	BSEC_SRLOCK0_SRLOCK14_B_0X0		(0x0u<<14)
#define	BSEC_SRLOCK0_SRLOCK14_B_0X1		(0x1u<<14)
#define	BSEC_SRLOCK0_SRLOCK13_B_0X0		(0x0u<<13)
#define	BSEC_SRLOCK0_SRLOCK13_B_0X1		(0x1u<<13)
#define	BSEC_SRLOCK0_SRLOCK12_B_0X0		(0x0u<<12)
#define	BSEC_SRLOCK0_SRLOCK12_B_0X1		(0x1u<<12)
#define	BSEC_SRLOCK0_SRLOCK11_B_0X0		(0x0u<<11)
#define	BSEC_SRLOCK0_SRLOCK11_B_0X1		(0x1u<<11)
#define	BSEC_SRLOCK0_SRLOCK10_B_0X0		(0x0u<<10)
#define	BSEC_SRLOCK0_SRLOCK10_B_0X1		(0x1u<<10)
#define	BSEC_SRLOCK0_SRLOCK9_B_0X0		(0x0u<<9)
#define	BSEC_SRLOCK0_SRLOCK9_B_0X1		(0x1u<<9)
#define	BSEC_SRLOCK0_SRLOCK8_B_0X0		(0x0u<<8)
#define	BSEC_SRLOCK0_SRLOCK8_B_0X1		(0x1u<<8)
#define	BSEC_SRLOCK0_SRLOCK7_B_0X0		(0x0u<<7)
#define	BSEC_SRLOCK0_SRLOCK7_B_0X1		(0x1u<<7)
#define	BSEC_SRLOCK0_SRLOCK6_B_0X0		(0x0u<<6)
#define	BSEC_SRLOCK0_SRLOCK6_B_0X1		(0x1u<<6)
#define	BSEC_SRLOCK0_SRLOCK5_B_0X0		(0x0u<<5)
#define	BSEC_SRLOCK0_SRLOCK5_B_0X1		(0x1u<<5)
#define	BSEC_SRLOCK0_SRLOCK4_B_0X0		(0x0u<<4)
#define	BSEC_SRLOCK0_SRLOCK4_B_0X1		(0x1u<<4)
#define	BSEC_SRLOCK0_SRLOCK3_B_0X0		(0x0u<<3)
#define	BSEC_SRLOCK0_SRLOCK3_B_0X1		(0x1u<<3)
#define	BSEC_SRLOCK0_SRLOCK2_B_0X0		(0x0u<<2)
#define	BSEC_SRLOCK0_SRLOCK2_B_0X1		(0x1u<<2)
#define	BSEC_SRLOCK0_SRLOCK1_B_0X0		(0x0u<<1)
#define	BSEC_SRLOCK0_SRLOCK1_B_0X1		(0x1u<<1)
#define	BSEC_SRLOCK0_SRLOCK0_B_0X0		(0x0u<<0)
#define	BSEC_SRLOCK0_SRLOCK0_B_0X1		(0x1u<<0)

// SRLOCK1 Configuration

#define	BSEC_SRLOCK1_SRLOCK63			(0x1u<<31)
#define	BSEC_SRLOCK1_SRLOCK62			(0x1u<<30)
#define	BSEC_SRLOCK1_SRLOCK61			(0x1u<<29)
#define	BSEC_SRLOCK1_SRLOCK60			(0x1u<<28)
#define	BSEC_SRLOCK1_SRLOCK59			(0x1u<<27)
#define	BSEC_SRLOCK1_SRLOCK58			(0x1u<<26)
#define	BSEC_SRLOCK1_SRLOCK57			(0x1u<<25)
#define	BSEC_SRLOCK1_SRLOCK56			(0x1u<<24)
#define	BSEC_SRLOCK1_SRLOCK55			(0x1u<<23)
#define	BSEC_SRLOCK1_SRLOCK54			(0x1u<<22)
#define	BSEC_SRLOCK1_SRLOCK53			(0x1u<<21)
#define	BSEC_SRLOCK1_SRLOCK52			(0x1u<<20)
#define	BSEC_SRLOCK1_SRLOCK51			(0x1u<<19)
#define	BSEC_SRLOCK1_SRLOCK50			(0x1u<<18)
#define	BSEC_SRLOCK1_SRLOCK49			(0x1u<<17)
#define	BSEC_SRLOCK1_SRLOCK48			(0x1u<<16)
#define	BSEC_SRLOCK1_SRLOCK47			(0x1u<<15)
#define	BSEC_SRLOCK1_SRLOCK46			(0x1u<<14)
#define	BSEC_SRLOCK1_SRLOCK45			(0x1u<<13)
#define	BSEC_SRLOCK1_SRLOCK44			(0x1u<<12)
#define	BSEC_SRLOCK1_SRLOCK43			(0x1u<<11)
#define	BSEC_SRLOCK1_SRLOCK42			(0x1u<<10)
#define	BSEC_SRLOCK1_SRLOCK41			(0x1u<<9)
#define	BSEC_SRLOCK1_SRLOCK40			(0x1u<<8)
#define	BSEC_SRLOCK1_SRLOCK39			(0x1u<<7)
#define	BSEC_SRLOCK1_SRLOCK38			(0x1u<<6)
#define	BSEC_SRLOCK1_SRLOCK37			(0x1u<<5)
#define	BSEC_SRLOCK1_SRLOCK36			(0x1u<<4)
#define	BSEC_SRLOCK1_SRLOCK35			(0x1u<<3)
#define	BSEC_SRLOCK1_SRLOCK34			(0x1u<<2)
#define	BSEC_SRLOCK1_SRLOCK33			(0x1u<<1)
#define	BSEC_SRLOCK1_SRLOCK32			(0x1u<<0)

#define	BSEC_SRLOCK1_SRLOCK63_B_0X0		(0x0u<<31)
#define	BSEC_SRLOCK1_SRLOCK63_B_0X1		(0x1u<<31)
#define	BSEC_SRLOCK1_SRLOCK62_B_0X0		(0x0u<<30)
#define	BSEC_SRLOCK1_SRLOCK62_B_0X1		(0x1u<<30)
#define	BSEC_SRLOCK1_SRLOCK61_B_0X0		(0x0u<<29)
#define	BSEC_SRLOCK1_SRLOCK61_B_0X1		(0x1u<<29)
#define	BSEC_SRLOCK1_SRLOCK60_B_0X0		(0x0u<<28)
#define	BSEC_SRLOCK1_SRLOCK60_B_0X1		(0x1u<<28)
#define	BSEC_SRLOCK1_SRLOCK59_B_0X0		(0x0u<<27)
#define	BSEC_SRLOCK1_SRLOCK59_B_0X1		(0x1u<<27)
#define	BSEC_SRLOCK1_SRLOCK58_B_0X0		(0x0u<<26)
#define	BSEC_SRLOCK1_SRLOCK58_B_0X1		(0x1u<<26)
#define	BSEC_SRLOCK1_SRLOCK57_B_0X0		(0x0u<<25)
#define	BSEC_SRLOCK1_SRLOCK57_B_0X1		(0x1u<<25)
#define	BSEC_SRLOCK1_SRLOCK56_B_0X0		(0x0u<<24)
#define	BSEC_SRLOCK1_SRLOCK56_B_0X1		(0x1u<<24)
#define	BSEC_SRLOCK1_SRLOCK55_B_0X0		(0x0u<<23)
#define	BSEC_SRLOCK1_SRLOCK55_B_0X1		(0x1u<<23)
#define	BSEC_SRLOCK1_SRLOCK54_B_0X0		(0x0u<<22)
#define	BSEC_SRLOCK1_SRLOCK54_B_0X1		(0x1u<<22)
#define	BSEC_SRLOCK1_SRLOCK53_B_0X0		(0x0u<<21)
#define	BSEC_SRLOCK1_SRLOCK53_B_0X1		(0x1u<<21)
#define	BSEC_SRLOCK1_SRLOCK52_B_0X0		(0x0u<<20)
#define	BSEC_SRLOCK1_SRLOCK52_B_0X1		(0x1u<<20)
#define	BSEC_SRLOCK1_SRLOCK51_B_0X0		(0x0u<<19)
#define	BSEC_SRLOCK1_SRLOCK51_B_0X1		(0x1u<<19)
#define	BSEC_SRLOCK1_SRLOCK50_B_0X0		(0x0u<<18)
#define	BSEC_SRLOCK1_SRLOCK50_B_0X1		(0x1u<<18)
#define	BSEC_SRLOCK1_SRLOCK49_B_0X0		(0x0u<<17)
#define	BSEC_SRLOCK1_SRLOCK49_B_0X1		(0x1u<<17)
#define	BSEC_SRLOCK1_SRLOCK48_B_0X0		(0x0u<<16)
#define	BSEC_SRLOCK1_SRLOCK48_B_0X1		(0x1u<<16)
#define	BSEC_SRLOCK1_SRLOCK47_B_0X0		(0x0u<<15)
#define	BSEC_SRLOCK1_SRLOCK47_B_0X1		(0x1u<<15)
#define	BSEC_SRLOCK1_SRLOCK46_B_0X0		(0x0u<<14)
#define	BSEC_SRLOCK1_SRLOCK46_B_0X1		(0x1u<<14)
#define	BSEC_SRLOCK1_SRLOCK45_B_0X0		(0x0u<<13)
#define	BSEC_SRLOCK1_SRLOCK45_B_0X1		(0x1u<<13)
#define	BSEC_SRLOCK1_SRLOCK44_B_0X0		(0x0u<<12)
#define	BSEC_SRLOCK1_SRLOCK44_B_0X1		(0x1u<<12)
#define	BSEC_SRLOCK1_SRLOCK43_B_0X0		(0x0u<<11)
#define	BSEC_SRLOCK1_SRLOCK43_B_0X1		(0x1u<<11)
#define	BSEC_SRLOCK1_SRLOCK42_B_0X0		(0x0u<<10)
#define	BSEC_SRLOCK1_SRLOCK42_B_0X1		(0x1u<<10)
#define	BSEC_SRLOCK1_SRLOCK41_B_0X0		(0x0u<<9)
#define	BSEC_SRLOCK1_SRLOCK41_B_0X1		(0x1u<<9)
#define	BSEC_SRLOCK1_SRLOCK40_B_0X0		(0x0u<<8)
#define	BSEC_SRLOCK1_SRLOCK40_B_0X1		(0x1u<<8)
#define	BSEC_SRLOCK1_SRLOCK39_B_0X0		(0x0u<<7)
#define	BSEC_SRLOCK1_SRLOCK39_B_0X1		(0x1u<<7)
#define	BSEC_SRLOCK1_SRLOCK38_B_0X0		(0x0u<<6)
#define	BSEC_SRLOCK1_SRLOCK38_B_0X1		(0x1u<<6)
#define	BSEC_SRLOCK1_SRLOCK37_B_0X0		(0x0u<<5)
#define	BSEC_SRLOCK1_SRLOCK37_B_0X1		(0x1u<<5)
#define	BSEC_SRLOCK1_SRLOCK36_B_0X0		(0x0u<<4)
#define	BSEC_SRLOCK1_SRLOCK36_B_0X1		(0x1u<<4)
#define	BSEC_SRLOCK1_SRLOCK35_B_0X0		(0x0u<<3)
#define	BSEC_SRLOCK1_SRLOCK35_B_0X1		(0x1u<<3)
#define	BSEC_SRLOCK1_SRLOCK34_B_0X0		(0x0u<<2)
#define	BSEC_SRLOCK1_SRLOCK34_B_0X1		(0x1u<<2)
#define	BSEC_SRLOCK1_SRLOCK33_B_0X0		(0x0u<<1)
#define	BSEC_SRLOCK1_SRLOCK33_B_0X1		(0x1u<<1)
#define	BSEC_SRLOCK1_SRLOCK32_B_0X0		(0x0u<<0)
#define	BSEC_SRLOCK1_SRLOCK32_B_0X1		(0x1u<<0)

// SRLOCK2 Configuration

#define	BSEC_SRLOCK2_SRLOCK95			(0x1u<<31)
#define	BSEC_SRLOCK2_SRLOCK94			(0x1u<<30)
#define	BSEC_SRLOCK2_SRLOCK93			(0x1u<<29)
#define	BSEC_SRLOCK2_SRLOCK92			(0x1u<<28)
#define	BSEC_SRLOCK2_SRLOCK91			(0x1u<<27)
#define	BSEC_SRLOCK2_SRLOCK90			(0x1u<<26)
#define	BSEC_SRLOCK2_SRLOCK89			(0x1u<<25)
#define	BSEC_SRLOCK2_SRLOCK88			(0x1u<<24)
#define	BSEC_SRLOCK2_SRLOCK87			(0x1u<<23)
#define	BSEC_SRLOCK2_SRLOCK86			(0x1u<<22)
#define	BSEC_SRLOCK2_SRLOCK85			(0x1u<<21)
#define	BSEC_SRLOCK2_SRLOCK84			(0x1u<<20)
#define	BSEC_SRLOCK2_SRLOCK83			(0x1u<<19)
#define	BSEC_SRLOCK2_SRLOCK82			(0x1u<<18)
#define	BSEC_SRLOCK2_SRLOCK81			(0x1u<<17)
#define	BSEC_SRLOCK2_SRLOCK80			(0x1u<<16)
#define	BSEC_SRLOCK2_SRLOCK79			(0x1u<<15)
#define	BSEC_SRLOCK2_SRLOCK78			(0x1u<<14)
#define	BSEC_SRLOCK2_SRLOCK77			(0x1u<<13)
#define	BSEC_SRLOCK2_SRLOCK76			(0x1u<<12)
#define	BSEC_SRLOCK2_SRLOCK75			(0x1u<<11)
#define	BSEC_SRLOCK2_SRLOCK74			(0x1u<<10)
#define	BSEC_SRLOCK2_SRLOCK73			(0x1u<<9)
#define	BSEC_SRLOCK2_SRLOCK72			(0x1u<<8)
#define	BSEC_SRLOCK2_SRLOCK71			(0x1u<<7)
#define	BSEC_SRLOCK2_SRLOCK70			(0x1u<<6)
#define	BSEC_SRLOCK2_SRLOCK69			(0x1u<<5)
#define	BSEC_SRLOCK2_SRLOCK68			(0x1u<<4)
#define	BSEC_SRLOCK2_SRLOCK67			(0x1u<<3)
#define	BSEC_SRLOCK2_SRLOCK66			(0x1u<<2)
#define	BSEC_SRLOCK2_SRLOCK65			(0x1u<<1)
#define	BSEC_SRLOCK2_SRLOCK64			(0x1u<<0)

#define	BSEC_SRLOCK2_SRLOCK95_B_0X0		(0x0u<<31)
#define	BSEC_SRLOCK2_SRLOCK95_B_0X1		(0x1u<<31)
#define	BSEC_SRLOCK2_SRLOCK94_B_0X0		(0x0u<<30)
#define	BSEC_SRLOCK2_SRLOCK94_B_0X1		(0x1u<<30)
#define	BSEC_SRLOCK2_SRLOCK93_B_0X0		(0x0u<<29)
#define	BSEC_SRLOCK2_SRLOCK93_B_0X1		(0x1u<<29)
#define	BSEC_SRLOCK2_SRLOCK92_B_0X0		(0x0u<<28)
#define	BSEC_SRLOCK2_SRLOCK92_B_0X1		(0x1u<<28)
#define	BSEC_SRLOCK2_SRLOCK91_B_0X0		(0x0u<<27)
#define	BSEC_SRLOCK2_SRLOCK91_B_0X1		(0x1u<<27)
#define	BSEC_SRLOCK2_SRLOCK90_B_0X0		(0x0u<<26)
#define	BSEC_SRLOCK2_SRLOCK90_B_0X1		(0x1u<<26)
#define	BSEC_SRLOCK2_SRLOCK89_B_0X0		(0x0u<<25)
#define	BSEC_SRLOCK2_SRLOCK89_B_0X1		(0x1u<<25)
#define	BSEC_SRLOCK2_SRLOCK88_B_0X0		(0x0u<<24)
#define	BSEC_SRLOCK2_SRLOCK88_B_0X1		(0x1u<<24)
#define	BSEC_SRLOCK2_SRLOCK87_B_0X0		(0x0u<<23)
#define	BSEC_SRLOCK2_SRLOCK87_B_0X1		(0x1u<<23)
#define	BSEC_SRLOCK2_SRLOCK86_B_0X0		(0x0u<<22)
#define	BSEC_SRLOCK2_SRLOCK86_B_0X1		(0x1u<<22)
#define	BSEC_SRLOCK2_SRLOCK85_B_0X0		(0x0u<<21)
#define	BSEC_SRLOCK2_SRLOCK85_B_0X1		(0x1u<<21)
#define	BSEC_SRLOCK2_SRLOCK84_B_0X0		(0x0u<<20)
#define	BSEC_SRLOCK2_SRLOCK84_B_0X1		(0x1u<<20)
#define	BSEC_SRLOCK2_SRLOCK83_B_0X0		(0x0u<<19)
#define	BSEC_SRLOCK2_SRLOCK83_B_0X1		(0x1u<<19)
#define	BSEC_SRLOCK2_SRLOCK82_B_0X0		(0x0u<<18)
#define	BSEC_SRLOCK2_SRLOCK82_B_0X1		(0x1u<<18)
#define	BSEC_SRLOCK2_SRLOCK81_B_0X0		(0x0u<<17)
#define	BSEC_SRLOCK2_SRLOCK81_B_0X1		(0x1u<<17)
#define	BSEC_SRLOCK2_SRLOCK80_B_0X0		(0x0u<<16)
#define	BSEC_SRLOCK2_SRLOCK80_B_0X1		(0x1u<<16)
#define	BSEC_SRLOCK2_SRLOCK79_B_0X0		(0x0u<<15)
#define	BSEC_SRLOCK2_SRLOCK79_B_0X1		(0x1u<<15)
#define	BSEC_SRLOCK2_SRLOCK78_B_0X0		(0x0u<<14)
#define	BSEC_SRLOCK2_SRLOCK78_B_0X1		(0x1u<<14)
#define	BSEC_SRLOCK2_SRLOCK77_B_0X0		(0x0u<<13)
#define	BSEC_SRLOCK2_SRLOCK77_B_0X1		(0x1u<<13)
#define	BSEC_SRLOCK2_SRLOCK76_B_0X0		(0x0u<<12)
#define	BSEC_SRLOCK2_SRLOCK76_B_0X1		(0x1u<<12)
#define	BSEC_SRLOCK2_SRLOCK75_B_0X0		(0x0u<<11)
#define	BSEC_SRLOCK2_SRLOCK75_B_0X1		(0x1u<<11)
#define	BSEC_SRLOCK2_SRLOCK74_B_0X0		(0x0u<<10)
#define	BSEC_SRLOCK2_SRLOCK74_B_0X1		(0x1u<<10)
#define	BSEC_SRLOCK2_SRLOCK73_B_0X0		(0x0u<<9)
#define	BSEC_SRLOCK2_SRLOCK73_B_0X1		(0x1u<<9)
#define	BSEC_SRLOCK2_SRLOCK72_B_0X0		(0x0u<<8)
#define	BSEC_SRLOCK2_SRLOCK72_B_0X1		(0x1u<<8)
#define	BSEC_SRLOCK2_SRLOCK71_B_0X0		(0x0u<<7)
#define	BSEC_SRLOCK2_SRLOCK71_B_0X1		(0x1u<<7)
#define	BSEC_SRLOCK2_SRLOCK70_B_0X0		(0x0u<<6)
#define	BSEC_SRLOCK2_SRLOCK70_B_0X1		(0x1u<<6)
#define	BSEC_SRLOCK2_SRLOCK69_B_0X0		(0x0u<<5)
#define	BSEC_SRLOCK2_SRLOCK69_B_0X1		(0x1u<<5)
#define	BSEC_SRLOCK2_SRLOCK68_B_0X0		(0x0u<<4)
#define	BSEC_SRLOCK2_SRLOCK68_B_0X1		(0x1u<<4)
#define	BSEC_SRLOCK2_SRLOCK67_B_0X0		(0x0u<<3)
#define	BSEC_SRLOCK2_SRLOCK67_B_0X1		(0x1u<<3)
#define	BSEC_SRLOCK2_SRLOCK66_B_0X0		(0x0u<<2)
#define	BSEC_SRLOCK2_SRLOCK66_B_0X1		(0x1u<<2)
#define	BSEC_SRLOCK2_SRLOCK65_B_0X0		(0x0u<<1)
#define	BSEC_SRLOCK2_SRLOCK65_B_0X1		(0x1u<<1)
#define	BSEC_SRLOCK2_SRLOCK64_B_0X0		(0x0u<<0)
#define	BSEC_SRLOCK2_SRLOCK64_B_0X1		(0x1u<<0)

// SRLOCK3 Configuration

#define	BSEC_SRLOCK3_SRLOCK127			(0x1u<<31)
#define	BSEC_SRLOCK3_SRLOCK126			(0x1u<<30)
#define	BSEC_SRLOCK3_SRLOCK125			(0x1u<<29)
#define	BSEC_SRLOCK3_SRLOCK124			(0x1u<<28)
#define	BSEC_SRLOCK3_SRLOCK123			(0x1u<<27)
#define	BSEC_SRLOCK3_SRLOCK122			(0x1u<<26)
#define	BSEC_SRLOCK3_SRLOCK121			(0x1u<<25)
#define	BSEC_SRLOCK3_SRLOCK120			(0x1u<<24)
#define	BSEC_SRLOCK3_SRLOCK119			(0x1u<<23)
#define	BSEC_SRLOCK3_SRLOCK118			(0x1u<<22)
#define	BSEC_SRLOCK3_SRLOCK117			(0x1u<<21)
#define	BSEC_SRLOCK3_SRLOCK116			(0x1u<<20)
#define	BSEC_SRLOCK3_SRLOCK115			(0x1u<<19)
#define	BSEC_SRLOCK3_SRLOCK114			(0x1u<<18)
#define	BSEC_SRLOCK3_SRLOCK113			(0x1u<<17)
#define	BSEC_SRLOCK3_SRLOCK112			(0x1u<<16)
#define	BSEC_SRLOCK3_SRLOCK111			(0x1u<<15)
#define	BSEC_SRLOCK3_SRLOCK110			(0x1u<<14)
#define	BSEC_SRLOCK3_SRLOCK109			(0x1u<<13)
#define	BSEC_SRLOCK3_SRLOCK108			(0x1u<<12)
#define	BSEC_SRLOCK3_SRLOCK107			(0x1u<<11)
#define	BSEC_SRLOCK3_SRLOCK106			(0x1u<<10)
#define	BSEC_SRLOCK3_SRLOCK105			(0x1u<<9)
#define	BSEC_SRLOCK3_SRLOCK104			(0x1u<<8)
#define	BSEC_SRLOCK3_SRLOCK103			(0x1u<<7)
#define	BSEC_SRLOCK3_SRLOCK102			(0x1u<<6)
#define	BSEC_SRLOCK3_SRLOCK101			(0x1u<<5)
#define	BSEC_SRLOCK3_SRLOCK100			(0x1u<<4)
#define	BSEC_SRLOCK3_SRLOCK99			(0x1u<<3)
#define	BSEC_SRLOCK3_SRLOCK98			(0x1u<<2)
#define	BSEC_SRLOCK3_SRLOCK97			(0x1u<<1)
#define	BSEC_SRLOCK3_SRLOCK96			(0x1u<<0)

#define	BSEC_SRLOCK3_SRLOCK127_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK3_SRLOCK127_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK3_SRLOCK126_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK3_SRLOCK126_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK3_SRLOCK125_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK3_SRLOCK125_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK3_SRLOCK124_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK3_SRLOCK124_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK3_SRLOCK123_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK3_SRLOCK123_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK3_SRLOCK122_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK3_SRLOCK122_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK3_SRLOCK121_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK3_SRLOCK121_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK3_SRLOCK120_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK3_SRLOCK120_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK3_SRLOCK119_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK3_SRLOCK119_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK3_SRLOCK118_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK3_SRLOCK118_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK3_SRLOCK117_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK3_SRLOCK117_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK3_SRLOCK116_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK3_SRLOCK116_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK3_SRLOCK115_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK3_SRLOCK115_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK3_SRLOCK114_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK3_SRLOCK114_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK3_SRLOCK113_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK3_SRLOCK113_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK3_SRLOCK112_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK3_SRLOCK112_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK3_SRLOCK111_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK3_SRLOCK111_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK3_SRLOCK110_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK3_SRLOCK110_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK3_SRLOCK109_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK3_SRLOCK109_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK3_SRLOCK108_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK3_SRLOCK108_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK3_SRLOCK107_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK3_SRLOCK107_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK3_SRLOCK106_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK3_SRLOCK106_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK3_SRLOCK105_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK3_SRLOCK105_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK3_SRLOCK104_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK3_SRLOCK104_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK3_SRLOCK103_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK3_SRLOCK103_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK3_SRLOCK102_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK3_SRLOCK102_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK3_SRLOCK101_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK3_SRLOCK101_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK3_SRLOCK100_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK3_SRLOCK100_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK3_SRLOCK99_B_0X0		(0x0u<<3)
#define	BSEC_SRLOCK3_SRLOCK99_B_0X1		(0x1u<<3)
#define	BSEC_SRLOCK3_SRLOCK98_B_0X0		(0x0u<<2)
#define	BSEC_SRLOCK3_SRLOCK98_B_0X1		(0x1u<<2)
#define	BSEC_SRLOCK3_SRLOCK97_B_0X0		(0x0u<<1)
#define	BSEC_SRLOCK3_SRLOCK97_B_0X1		(0x1u<<1)
#define	BSEC_SRLOCK3_SRLOCK96_B_0X0		(0x0u<<0)
#define	BSEC_SRLOCK3_SRLOCK96_B_0X1		(0x1u<<0)

// SRLOCK4 Configuration

#define	BSEC_SRLOCK4_SRLOCK159			(0x1u<<31)
#define	BSEC_SRLOCK4_SRLOCK158			(0x1u<<30)
#define	BSEC_SRLOCK4_SRLOCK157			(0x1u<<29)
#define	BSEC_SRLOCK4_SRLOCK156			(0x1u<<28)
#define	BSEC_SRLOCK4_SRLOCK155			(0x1u<<27)
#define	BSEC_SRLOCK4_SRLOCK154			(0x1u<<26)
#define	BSEC_SRLOCK4_SRLOCK153			(0x1u<<25)
#define	BSEC_SRLOCK4_SRLOCK152			(0x1u<<24)
#define	BSEC_SRLOCK4_SRLOCK151			(0x1u<<23)
#define	BSEC_SRLOCK4_SRLOCK150			(0x1u<<22)
#define	BSEC_SRLOCK4_SRLOCK149			(0x1u<<21)
#define	BSEC_SRLOCK4_SRLOCK148			(0x1u<<20)
#define	BSEC_SRLOCK4_SRLOCK147			(0x1u<<19)
#define	BSEC_SRLOCK4_SRLOCK146			(0x1u<<18)
#define	BSEC_SRLOCK4_SRLOCK145			(0x1u<<17)
#define	BSEC_SRLOCK4_SRLOCK144			(0x1u<<16)
#define	BSEC_SRLOCK4_SRLOCK143			(0x1u<<15)
#define	BSEC_SRLOCK4_SRLOCK142			(0x1u<<14)
#define	BSEC_SRLOCK4_SRLOCK141			(0x1u<<13)
#define	BSEC_SRLOCK4_SRLOCK140			(0x1u<<12)
#define	BSEC_SRLOCK4_SRLOCK139			(0x1u<<11)
#define	BSEC_SRLOCK4_SRLOCK138			(0x1u<<10)
#define	BSEC_SRLOCK4_SRLOCK137			(0x1u<<9)
#define	BSEC_SRLOCK4_SRLOCK136			(0x1u<<8)
#define	BSEC_SRLOCK4_SRLOCK135			(0x1u<<7)
#define	BSEC_SRLOCK4_SRLOCK134			(0x1u<<6)
#define	BSEC_SRLOCK4_SRLOCK133			(0x1u<<5)
#define	BSEC_SRLOCK4_SRLOCK132			(0x1u<<4)
#define	BSEC_SRLOCK4_SRLOCK131			(0x1u<<3)
#define	BSEC_SRLOCK4_SRLOCK130			(0x1u<<2)
#define	BSEC_SRLOCK4_SRLOCK129			(0x1u<<1)
#define	BSEC_SRLOCK4_SRLOCK128			(0x1u<<0)

