hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SRLOCK4_SRLOCK159_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK4_SRLOCK159_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK4_SRLOCK158_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK4_SRLOCK158_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK4_SRLOCK157_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK4_SRLOCK157_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK4_SRLOCK156_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK4_SRLOCK156_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK4_SRLOCK155_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK4_SRLOCK155_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK4_SRLOCK154_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK4_SRLOCK154_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK4_SRLOCK153_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK4_SRLOCK153_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK4_SRLOCK152_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK4_SRLOCK152_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK4_SRLOCK151_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK4_SRLOCK151_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK4_SRLOCK150_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK4_SRLOCK150_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK4_SRLOCK149_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK4_SRLOCK149_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK4_SRLOCK148_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK4_SRLOCK148_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK4_SRLOCK147_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK4_SRLOCK147_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK4_SRLOCK146_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK4_SRLOCK146_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK4_SRLOCK145_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK4_SRLOCK145_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK4_SRLOCK144_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK4_SRLOCK144_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK4_SRLOCK143_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK4_SRLOCK143_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK4_SRLOCK142_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK4_SRLOCK142_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK4_SRLOCK141_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK4_SRLOCK141_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK4_SRLOCK140_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK4_SRLOCK140_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK4_SRLOCK139_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK4_SRLOCK139_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK4_SRLOCK138_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK4_SRLOCK138_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK4_SRLOCK137_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK4_SRLOCK137_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK4_SRLOCK136_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK4_SRLOCK136_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK4_SRLOCK135_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK4_SRLOCK135_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK4_SRLOCK134_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK4_SRLOCK134_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK4_SRLOCK133_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK4_SRLOCK133_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK4_SRLOCK132_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK4_SRLOCK132_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK4_SRLOCK131_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK4_SRLOCK131_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK4_SRLOCK130_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK4_SRLOCK130_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK4_SRLOCK129_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK4_SRLOCK129_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK4_SRLOCK128_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK4_SRLOCK128_B_0X1	(0x1u<<0)

// SRLOCK5 Configuration

#define	BSEC_SRLOCK5_SRLOCK191			(0x1u<<31)
#define	BSEC_SRLOCK5_SRLOCK190			(0x1u<<30)
#define	BSEC_SRLOCK5_SRLOCK189			(0x1u<<29)
#define	BSEC_SRLOCK5_SRLOCK188			(0x1u<<28)
#define	BSEC_SRLOCK5_SRLOCK187			(0x1u<<27)
#define	BSEC_SRLOCK5_SRLOCK186			(0x1u<<26)
#define	BSEC_SRLOCK5_SRLOCK185			(0x1u<<25)
#define	BSEC_SRLOCK5_SRLOCK184			(0x1u<<24)
#define	BSEC_SRLOCK5_SRLOCK183			(0x1u<<23)
#define	BSEC_SRLOCK5_SRLOCK182			(0x1u<<22)
#define	BSEC_SRLOCK5_SRLOCK181			(0x1u<<21)
#define	BSEC_SRLOCK5_SRLOCK180			(0x1u<<20)
#define	BSEC_SRLOCK5_SRLOCK179			(0x1u<<19)
#define	BSEC_SRLOCK5_SRLOCK178			(0x1u<<18)
#define	BSEC_SRLOCK5_SRLOCK177			(0x1u<<17)
#define	BSEC_SRLOCK5_SRLOCK176			(0x1u<<16)
#define	BSEC_SRLOCK5_SRLOCK175			(0x1u<<15)
#define	BSEC_SRLOCK5_SRLOCK174			(0x1u<<14)
#define	BSEC_SRLOCK5_SRLOCK173			(0x1u<<13)
#define	BSEC_SRLOCK5_SRLOCK172			(0x1u<<12)
#define	BSEC_SRLOCK5_SRLOCK171			(0x1u<<11)
#define	BSEC_SRLOCK5_SRLOCK170			(0x1u<<10)
#define	BSEC_SRLOCK5_SRLOCK169			(0x1u<<9)
#define	BSEC_SRLOCK5_SRLOCK168			(0x1u<<8)
#define	BSEC_SRLOCK5_SRLOCK167			(0x1u<<7)
#define	BSEC_SRLOCK5_SRLOCK166			(0x1u<<6)
#define	BSEC_SRLOCK5_SRLOCK165			(0x1u<<5)
#define	BSEC_SRLOCK5_SRLOCK164			(0x1u<<4)
#define	BSEC_SRLOCK5_SRLOCK163			(0x1u<<3)
#define	BSEC_SRLOCK5_SRLOCK162			(0x1u<<2)
#define	BSEC_SRLOCK5_SRLOCK161			(0x1u<<1)
#define	BSEC_SRLOCK5_SRLOCK160			(0x1u<<0)

#define	BSEC_SRLOCK5_SRLOCK191_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK5_SRLOCK191_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK5_SRLOCK190_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK5_SRLOCK190_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK5_SRLOCK189_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK5_SRLOCK189_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK5_SRLOCK188_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK5_SRLOCK188_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK5_SRLOCK187_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK5_SRLOCK187_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK5_SRLOCK186_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK5_SRLOCK186_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK5_SRLOCK185_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK5_SRLOCK185_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK5_SRLOCK184_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK5_SRLOCK184_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK5_SRLOCK183_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK5_SRLOCK183_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK5_SRLOCK182_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK5_SRLOCK182_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK5_SRLOCK181_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK5_SRLOCK181_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK5_SRLOCK180_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK5_SRLOCK180_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK5_SRLOCK179_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK5_SRLOCK179_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK5_SRLOCK178_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK5_SRLOCK178_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK5_SRLOCK177_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK5_SRLOCK177_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK5_SRLOCK176_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK5_SRLOCK176_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK5_SRLOCK175_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK5_SRLOCK175_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK5_SRLOCK174_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK5_SRLOCK174_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK5_SRLOCK173_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK5_SRLOCK173_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK5_SRLOCK172_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK5_SRLOCK172_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK5_SRLOCK171_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK5_SRLOCK171_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK5_SRLOCK170_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK5_SRLOCK170_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK5_SRLOCK169_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK5_SRLOCK169_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK5_SRLOCK168_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK5_SRLOCK168_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK5_SRLOCK167_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK5_SRLOCK167_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK5_SRLOCK166_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK5_SRLOCK166_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK5_SRLOCK165_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK5_SRLOCK165_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK5_SRLOCK164_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK5_SRLOCK164_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK5_SRLOCK163_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK5_SRLOCK163_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK5_SRLOCK162_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK5_SRLOCK162_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK5_SRLOCK161_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK5_SRLOCK161_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK5_SRLOCK160_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK5_SRLOCK160_B_0X1	(0x1u<<0)

// SRLOCK6 Configuration

#define	BSEC_SRLOCK6_SRLOCK223			(0x1u<<31)
#define	BSEC_SRLOCK6_SRLOCK222			(0x1u<<30)
#define	BSEC_SRLOCK6_SRLOCK221			(0x1u<<29)
#define	BSEC_SRLOCK6_SRLOCK220			(0x1u<<28)
#define	BSEC_SRLOCK6_SRLOCK219			(0x1u<<27)
#define	BSEC_SRLOCK6_SRLOCK218			(0x1u<<26)
#define	BSEC_SRLOCK6_SRLOCK217			(0x1u<<25)
#define	BSEC_SRLOCK6_SRLOCK216			(0x1u<<24)
#define	BSEC_SRLOCK6_SRLOCK215			(0x1u<<23)
#define	BSEC_SRLOCK6_SRLOCK214			(0x1u<<22)
#define	BSEC_SRLOCK6_SRLOCK213			(0x1u<<21)
#define	BSEC_SRLOCK6_SRLOCK212			(0x1u<<20)
#define	BSEC_SRLOCK6_SRLOCK211			(0x1u<<19)
#define	BSEC_SRLOCK6_SRLOCK210			(0x1u<<18)
#define	BSEC_SRLOCK6_SRLOCK209			(0x1u<<17)
#define	BSEC_SRLOCK6_SRLOCK208			(0x1u<<16)
#define	BSEC_SRLOCK6_SRLOCK207			(0x1u<<15)
#define	BSEC_SRLOCK6_SRLOCK206			(0x1u<<14)
#define	BSEC_SRLOCK6_SRLOCK205			(0x1u<<13)
#define	BSEC_SRLOCK6_SRLOCK204			(0x1u<<12)
#define	BSEC_SRLOCK6_SRLOCK203			(0x1u<<11)
#define	BSEC_SRLOCK6_SRLOCK202			(0x1u<<10)
#define	BSEC_SRLOCK6_SRLOCK201			(0x1u<<9)
#define	BSEC_SRLOCK6_SRLOCK200			(0x1u<<8)
#define	BSEC_SRLOCK6_SRLOCK199			(0x1u<<7)
#define	BSEC_SRLOCK6_SRLOCK198			(0x1u<<6)
#define	BSEC_SRLOCK6_SRLOCK197			(0x1u<<5)
#define	BSEC_SRLOCK6_SRLOCK196			(0x1u<<4)
#define	BSEC_SRLOCK6_SRLOCK195			(0x1u<<3)
#define	BSEC_SRLOCK6_SRLOCK194			(0x1u<<2)
#define	BSEC_SRLOCK6_SRLOCK193			(0x1u<<1)
#define	BSEC_SRLOCK6_SRLOCK192			(0x1u<<0)

