hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SRLOCK6_SRLOCK223_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK6_SRLOCK223_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK6_SRLOCK222_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK6_SRLOCK222_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK6_SRLOCK221_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK6_SRLOCK221_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK6_SRLOCK220_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK6_SRLOCK220_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK6_SRLOCK219_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK6_SRLOCK219_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK6_SRLOCK218_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK6_SRLOCK218_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK6_SRLOCK217_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK6_SRLOCK217_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK6_SRLOCK216_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK6_SRLOCK216_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK6_SRLOCK215_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK6_SRLOCK215_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK6_SRLOCK214_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK6_SRLOCK214_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK6_SRLOCK213_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK6_SRLOCK213_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK6_SRLOCK212_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK6_SRLOCK212_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK6_SRLOCK211_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK6_SRLOCK211_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK6_SRLOCK210_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK6_SRLOCK210_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK6_SRLOCK209_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK6_SRLOCK209_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK6_SRLOCK208_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK6_SRLOCK208_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK6_SRLOCK207_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK6_SRLOCK207_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK6_SRLOCK206_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK6_SRLOCK206_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK6_SRLOCK205_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK6_SRLOCK205_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK6_SRLOCK204_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK6_SRLOCK204_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK6_SRLOCK203_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK6_SRLOCK203_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK6_SRLOCK202_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK6_SRLOCK202_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK6_SRLOCK201_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK6_SRLOCK201_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK6_SRLOCK200_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK6_SRLOCK200_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK6_SRLOCK199_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK6_SRLOCK199_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK6_SRLOCK198_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK6_SRLOCK198_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK6_SRLOCK197_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK6_SRLOCK197_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK6_SRLOCK196_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK6_SRLOCK196_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK6_SRLOCK195_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK6_SRLOCK195_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK6_SRLOCK194_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK6_SRLOCK194_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK6_SRLOCK193_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK6_SRLOCK193_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK6_SRLOCK192_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK6_SRLOCK192_B_0X1	(0x1u<<0)

// SRLOCK7 Configuration

#define	BSEC_SRLOCK7_SRLOCK255			(0x1u<<31)
#define	BSEC_SRLOCK7_SRLOCK254			(0x1u<<30)
#define	BSEC_SRLOCK7_SRLOCK253			(0x1u<<29)
#define	BSEC_SRLOCK7_SRLOCK252			(0x1u<<28)
#define	BSEC_SRLOCK7_SRLOCK251			(0x1u<<27)
#define	BSEC_SRLOCK7_SRLOCK250			(0x1u<<26)
#define	BSEC_SRLOCK7_SRLOCK249			(0x1u<<25)
#define	BSEC_SRLOCK7_SRLOCK248			(0x1u<<24)
#define	BSEC_SRLOCK7_SRLOCK247			(0x1u<<23)
#define	BSEC_SRLOCK7_SRLOCK246			(0x1u<<22)
#define	BSEC_SRLOCK7_SRLOCK245			(0x1u<<21)
#define	BSEC_SRLOCK7_SRLOCK244			(0x1u<<20)
#define	BSEC_SRLOCK7_SRLOCK243			(0x1u<<19)
#define	BSEC_SRLOCK7_SRLOCK242			(0x1u<<18)
#define	BSEC_SRLOCK7_SRLOCK241			(0x1u<<17)
#define	BSEC_SRLOCK7_SRLOCK240			(0x1u<<16)
#define	BSEC_SRLOCK7_SRLOCK239			(0x1u<<15)
#define	BSEC_SRLOCK7_SRLOCK238			(0x1u<<14)
#define	BSEC_SRLOCK7_SRLOCK237			(0x1u<<13)
#define	BSEC_SRLOCK7_SRLOCK236			(0x1u<<12)
#define	BSEC_SRLOCK7_SRLOCK235			(0x1u<<11)
#define	BSEC_SRLOCK7_SRLOCK234			(0x1u<<10)
#define	BSEC_SRLOCK7_SRLOCK233			(0x1u<<9)
#define	BSEC_SRLOCK7_SRLOCK232			(0x1u<<8)
#define	BSEC_SRLOCK7_SRLOCK231			(0x1u<<7)
#define	BSEC_SRLOCK7_SRLOCK230			(0x1u<<6)
#define	BSEC_SRLOCK7_SRLOCK229			(0x1u<<5)
#define	BSEC_SRLOCK7_SRLOCK228			(0x1u<<4)
#define	BSEC_SRLOCK7_SRLOCK227			(0x1u<<3)
#define	BSEC_SRLOCK7_SRLOCK226			(0x1u<<2)
#define	BSEC_SRLOCK7_SRLOCK225			(0x1u<<1)
#define	BSEC_SRLOCK7_SRLOCK224			(0x1u<<0)

#define	BSEC_SRLOCK7_SRLOCK255_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK7_SRLOCK255_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK7_SRLOCK254_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK7_SRLOCK254_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK7_SRLOCK253_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK7_SRLOCK253_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK7_SRLOCK252_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK7_SRLOCK252_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK7_SRLOCK251_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK7_SRLOCK251_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK7_SRLOCK250_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK7_SRLOCK250_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK7_SRLOCK249_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK7_SRLOCK249_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK7_SRLOCK248_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK7_SRLOCK248_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK7_SRLOCK247_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK7_SRLOCK247_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK7_SRLOCK246_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK7_SRLOCK246_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK7_SRLOCK245_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK7_SRLOCK245_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK7_SRLOCK244_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK7_SRLOCK244_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK7_SRLOCK243_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK7_SRLOCK243_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK7_SRLOCK242_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK7_SRLOCK242_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK7_SRLOCK241_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK7_SRLOCK241_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK7_SRLOCK240_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK7_SRLOCK240_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK7_SRLOCK239_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK7_SRLOCK239_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK7_SRLOCK238_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK7_SRLOCK238_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK7_SRLOCK237_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK7_SRLOCK237_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK7_SRLOCK236_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK7_SRLOCK236_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK7_SRLOCK235_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK7_SRLOCK235_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK7_SRLOCK234_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK7_SRLOCK234_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK7_SRLOCK233_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK7_SRLOCK233_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK7_SRLOCK232_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK7_SRLOCK232_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK7_SRLOCK231_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK7_SRLOCK231_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK7_SRLOCK230_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK7_SRLOCK230_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK7_SRLOCK229_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK7_SRLOCK229_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK7_SRLOCK228_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK7_SRLOCK228_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK7_SRLOCK227_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK7_SRLOCK227_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK7_SRLOCK226_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK7_SRLOCK226_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK7_SRLOCK225_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK7_SRLOCK225_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK7_SRLOCK224_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK7_SRLOCK224_B_0X1	(0x1u<<0)

// SRLOCK8 Configuration

#define	BSEC_SRLOCK8_SRLOCK287			(0x1u<<31)
#define	BSEC_SRLOCK8_SRLOCK286			(0x1u<<30)
#define	BSEC_SRLOCK8_SRLOCK285			(0x1u<<29)
#define	BSEC_SRLOCK8_SRLOCK284			(0x1u<<28)
#define	BSEC_SRLOCK8_SRLOCK283			(0x1u<<27)
#define	BSEC_SRLOCK8_SRLOCK282			(0x1u<<26)
#define	BSEC_SRLOCK8_SRLOCK281			(0x1u<<25)
#define	BSEC_SRLOCK8_SRLOCK280			(0x1u<<24)
#define	BSEC_SRLOCK8_SRLOCK279			(0x1u<<23)
#define	BSEC_SRLOCK8_SRLOCK278			(0x1u<<22)
#define	BSEC_SRLOCK8_SRLOCK277			(0x1u<<21)
#define	BSEC_SRLOCK8_SRLOCK276			(0x1u<<20)
#define	BSEC_SRLOCK8_SRLOCK275			(0x1u<<19)
#define	BSEC_SRLOCK8_SRLOCK274			(0x1u<<18)
#define	BSEC_SRLOCK8_SRLOCK273			(0x1u<<17)
#define	BSEC_SRLOCK8_SRLOCK272			(0x1u<<16)
#define	BSEC_SRLOCK8_SRLOCK271			(0x1u<<15)
#define	BSEC_SRLOCK8_SRLOCK270			(0x1u<<14)
#define	BSEC_SRLOCK8_SRLOCK269			(0x1u<<13)
#define	BSEC_SRLOCK8_SRLOCK268			(0x1u<<12)
#define	BSEC_SRLOCK8_SRLOCK267			(0x1u<<11)
#define	BSEC_SRLOCK8_SRLOCK266			(0x1u<<10)
#define	BSEC_SRLOCK8_SRLOCK265			(0x1u<<9)
#define	BSEC_SRLOCK8_SRLOCK264			(0x1u<<8)
#define	BSEC_SRLOCK8_SRLOCK263			(0x1u<<7)
#define	BSEC_SRLOCK8_SRLOCK262			(0x1u<<6)
#define	BSEC_SRLOCK8_SRLOCK261			(0x1u<<5)
#define	BSEC_SRLOCK8_SRLOCK260			(0x1u<<4)
#define	BSEC_SRLOCK8_SRLOCK259			(0x1u<<3)
#define	BSEC_SRLOCK8_SRLOCK258			(0x1u<<2)
#define	BSEC_SRLOCK8_SRLOCK257			(0x1u<<1)
#define	BSEC_SRLOCK8_SRLOCK256			(0x1u<<0)

