hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SRLOCK8_SRLOCK287_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK8_SRLOCK287_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK8_SRLOCK286_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK8_SRLOCK286_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK8_SRLOCK285_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK8_SRLOCK285_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK8_SRLOCK284_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK8_SRLOCK284_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK8_SRLOCK283_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK8_SRLOCK283_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK8_SRLOCK282_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK8_SRLOCK282_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK8_SRLOCK281_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK8_SRLOCK281_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK8_SRLOCK280_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK8_SRLOCK280_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK8_SRLOCK279_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK8_SRLOCK279_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK8_SRLOCK278_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK8_SRLOCK278_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK8_SRLOCK277_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK8_SRLOCK277_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK8_SRLOCK276_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK8_SRLOCK276_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK8_SRLOCK275_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK8_SRLOCK275_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK8_SRLOCK274_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK8_SRLOCK274_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK8_SRLOCK273_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK8_SRLOCK273_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK8_SRLOCK272_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK8_SRLOCK272_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK8_SRLOCK271_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK8_SRLOCK271_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK8_SRLOCK270_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK8_SRLOCK270_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK8_SRLOCK269_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK8_SRLOCK269_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK8_SRLOCK268_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK8_SRLOCK268_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK8_SRLOCK267_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK8_SRLOCK267_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK8_SRLOCK266_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK8_SRLOCK266_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK8_SRLOCK265_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK8_SRLOCK265_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK8_SRLOCK264_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK8_SRLOCK264_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK8_SRLOCK263_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK8_SRLOCK263_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK8_SRLOCK262_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK8_SRLOCK262_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK8_SRLOCK261_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK8_SRLOCK261_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK8_SRLOCK260_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK8_SRLOCK260_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK8_SRLOCK259_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK8_SRLOCK259_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK8_SRLOCK258_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK8_SRLOCK258_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK8_SRLOCK257_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK8_SRLOCK257_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK8_SRLOCK256_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK8_SRLOCK256_B_0X1	(0x1u<<0)

// SRLOCK9 Configuration

#define	BSEC_SRLOCK9_SRLOCK319			(0x1u<<31)
#define	BSEC_SRLOCK9_SRLOCK318			(0x1u<<30)
#define	BSEC_SRLOCK9_SRLOCK317			(0x1u<<29)
#define	BSEC_SRLOCK9_SRLOCK316			(0x1u<<28)
#define	BSEC_SRLOCK9_SRLOCK315			(0x1u<<27)
#define	BSEC_SRLOCK9_SRLOCK314			(0x1u<<26)
#define	BSEC_SRLOCK9_SRLOCK313			(0x1u<<25)
#define	BSEC_SRLOCK9_SRLOCK312			(0x1u<<24)
#define	BSEC_SRLOCK9_SRLOCK311			(0x1u<<23)
#define	BSEC_SRLOCK9_SRLOCK310			(0x1u<<22)
#define	BSEC_SRLOCK9_SRLOCK309			(0x1u<<21)
#define	BSEC_SRLOCK9_SRLOCK308			(0x1u<<20)
#define	BSEC_SRLOCK9_SRLOCK307			(0x1u<<19)
#define	BSEC_SRLOCK9_SRLOCK306			(0x1u<<18)
#define	BSEC_SRLOCK9_SRLOCK305			(0x1u<<17)
#define	BSEC_SRLOCK9_SRLOCK304			(0x1u<<16)
#define	BSEC_SRLOCK9_SRLOCK303			(0x1u<<15)
#define	BSEC_SRLOCK9_SRLOCK302			(0x1u<<14)
#define	BSEC_SRLOCK9_SRLOCK301			(0x1u<<13)
#define	BSEC_SRLOCK9_SRLOCK300			(0x1u<<12)
#define	BSEC_SRLOCK9_SRLOCK299			(0x1u<<11)
#define	BSEC_SRLOCK9_SRLOCK298			(0x1u<<10)
#define	BSEC_SRLOCK9_SRLOCK297			(0x1u<<9)
#define	BSEC_SRLOCK9_SRLOCK296			(0x1u<<8)
#define	BSEC_SRLOCK9_SRLOCK295			(0x1u<<7)
#define	BSEC_SRLOCK9_SRLOCK294			(0x1u<<6)
#define	BSEC_SRLOCK9_SRLOCK293			(0x1u<<5)
#define	BSEC_SRLOCK9_SRLOCK292			(0x1u<<4)
#define	BSEC_SRLOCK9_SRLOCK291			(0x1u<<3)
#define	BSEC_SRLOCK9_SRLOCK290			(0x1u<<2)
#define	BSEC_SRLOCK9_SRLOCK289			(0x1u<<1)
#define	BSEC_SRLOCK9_SRLOCK288			(0x1u<<0)

#define	BSEC_SRLOCK9_SRLOCK319_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK9_SRLOCK319_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK9_SRLOCK318_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK9_SRLOCK318_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK9_SRLOCK317_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK9_SRLOCK317_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK9_SRLOCK316_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK9_SRLOCK316_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK9_SRLOCK315_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK9_SRLOCK315_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK9_SRLOCK314_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK9_SRLOCK314_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK9_SRLOCK313_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK9_SRLOCK313_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK9_SRLOCK312_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK9_SRLOCK312_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK9_SRLOCK311_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK9_SRLOCK311_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK9_SRLOCK310_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK9_SRLOCK310_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK9_SRLOCK309_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK9_SRLOCK309_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK9_SRLOCK308_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK9_SRLOCK308_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK9_SRLOCK307_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK9_SRLOCK307_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK9_SRLOCK306_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK9_SRLOCK306_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK9_SRLOCK305_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK9_SRLOCK305_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK9_SRLOCK304_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK9_SRLOCK304_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK9_SRLOCK303_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK9_SRLOCK303_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK9_SRLOCK302_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK9_SRLOCK302_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK9_SRLOCK301_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK9_SRLOCK301_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK9_SRLOCK300_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK9_SRLOCK300_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK9_SRLOCK299_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK9_SRLOCK299_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK9_SRLOCK298_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK9_SRLOCK298_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK9_SRLOCK297_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK9_SRLOCK297_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK9_SRLOCK296_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK9_SRLOCK296_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK9_SRLOCK295_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK9_SRLOCK295_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK9_SRLOCK294_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK9_SRLOCK294_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK9_SRLOCK293_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK9_SRLOCK293_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK9_SRLOCK292_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK9_SRLOCK292_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK9_SRLOCK291_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK9_SRLOCK291_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK9_SRLOCK290_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK9_SRLOCK290_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK9_SRLOCK289_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK9_SRLOCK289_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK9_SRLOCK288_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK9_SRLOCK288_B_0X1	(0x1u<<0)

// SRLOCK10 Configuration

#define	BSEC_SRLOCK10_SRLOCK351			(0x1u<<31)
#define	BSEC_SRLOCK10_SRLOCK350			(0x1u<<30)
#define	BSEC_SRLOCK10_SRLOCK349			(0x1u<<29)
#define	BSEC_SRLOCK10_SRLOCK348			(0x1u<<28)
#define	BSEC_SRLOCK10_SRLOCK347			(0x1u<<27)
#define	BSEC_SRLOCK10_SRLOCK346			(0x1u<<26)
#define	BSEC_SRLOCK10_SRLOCK345			(0x1u<<25)
#define	BSEC_SRLOCK10_SRLOCK344			(0x1u<<24)
#define	BSEC_SRLOCK10_SRLOCK343			(0x1u<<23)
#define	BSEC_SRLOCK10_SRLOCK342			(0x1u<<22)
#define	BSEC_SRLOCK10_SRLOCK341			(0x1u<<21)
#define	BSEC_SRLOCK10_SRLOCK340			(0x1u<<20)
#define	BSEC_SRLOCK10_SRLOCK339			(0x1u<<19)
#define	BSEC_SRLOCK10_SRLOCK338			(0x1u<<18)
#define	BSEC_SRLOCK10_SRLOCK337			(0x1u<<17)
#define	BSEC_SRLOCK10_SRLOCK336			(0x1u<<16)
#define	BSEC_SRLOCK10_SRLOCK335			(0x1u<<15)
#define	BSEC_SRLOCK10_SRLOCK334			(0x1u<<14)
#define	BSEC_SRLOCK10_SRLOCK333			(0x1u<<13)
#define	BSEC_SRLOCK10_SRLOCK332			(0x1u<<12)
#define	BSEC_SRLOCK10_SRLOCK331			(0x1u<<11)
#define	BSEC_SRLOCK10_SRLOCK330			(0x1u<<10)
#define	BSEC_SRLOCK10_SRLOCK329			(0x1u<<9)
#define	BSEC_SRLOCK10_SRLOCK328			(0x1u<<8)
#define	BSEC_SRLOCK10_SRLOCK327			(0x1u<<7)
#define	BSEC_SRLOCK10_SRLOCK326			(0x1u<<6)
#define	BSEC_SRLOCK10_SRLOCK325			(0x1u<<5)
#define	BSEC_SRLOCK10_SRLOCK324			(0x1u<<4)
#define	BSEC_SRLOCK10_SRLOCK323			(0x1u<<3)
#define	BSEC_SRLOCK10_SRLOCK322			(0x1u<<2)
#define	BSEC_SRLOCK10_SRLOCK321			(0x1u<<1)
#define	BSEC_SRLOCK10_SRLOCK320			(0x1u<<0)

#define	BSEC_SRLOCK10_SRLOCK351_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK10_SRLOCK351_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK10_SRLOCK350_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK10_SRLOCK350_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK10_SRLOCK349_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK10_SRLOCK349_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK10_SRLOCK348_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK10_SRLOCK348_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK10_SRLOCK347_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK10_SRLOCK347_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK10_SRLOCK346_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK10_SRLOCK346_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK10_SRLOCK345_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK10_SRLOCK345_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK10_SRLOCK344_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK10_SRLOCK344_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK10_SRLOCK343_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK10_SRLOCK343_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK10_SRLOCK342_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK10_SRLOCK342_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK10_SRLOCK341_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK10_SRLOCK341_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK10_SRLOCK340_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK10_SRLOCK340_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK10_SRLOCK339_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK10_SRLOCK339_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK10_SRLOCK338_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK10_SRLOCK338_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK10_SRLOCK337_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK10_SRLOCK337_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK10_SRLOCK336_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK10_SRLOCK336_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK10_SRLOCK335_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK10_SRLOCK335_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK10_SRLOCK334_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK10_SRLOCK334_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK10_SRLOCK333_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK10_SRLOCK333_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK10_SRLOCK332_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK10_SRLOCK332_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK10_SRLOCK331_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK10_SRLOCK331_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK10_SRLOCK330_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK10_SRLOCK330_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK10_SRLOCK329_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK10_SRLOCK329_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK10_SRLOCK328_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK10_SRLOCK328_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK10_SRLOCK327_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK10_SRLOCK327_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK10_SRLOCK326_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK10_SRLOCK326_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK10_SRLOCK325_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK10_SRLOCK325_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK10_SRLOCK324_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK10_SRLOCK324_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK10_SRLOCK323_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK10_SRLOCK323_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK10_SRLOCK322_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK10_SRLOCK322_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK10_SRLOCK321_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK10_SRLOCK321_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK10_SRLOCK320_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK10_SRLOCK320_B_0X1	(0x1u<<0)

// SRLOCK11 Configuration

