hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SRLOCK11_SRLOCK383			(0x1u<<31)
#define	BSEC_SRLOCK11_SRLOCK382			(0x1u<<30)
#define	BSEC_SRLOCK11_SRLOCK381			(0x1u<<29)
#define	BSEC_SRLOCK11_SRLOCK380			(0x1u<<28)
#define	BSEC_SRLOCK11_SRLOCK379			(0x1u<<27)
#define	BSEC_SRLOCK11_SRLOCK378			(0x1u<<26)
#define	BSEC_SRLOCK11_SRLOCK377			(0x1u<<25)
#define	BSEC_SRLOCK11_SRLOCK376			(0x1u<<24)
#define	BSEC_SRLOCK11_SRLOCK375			(0x1u<<23)
#define	BSEC_SRLOCK11_SRLOCK374			(0x1u<<22)
#define	BSEC_SRLOCK11_SRLOCK373			(0x1u<<21)
#define	BSEC_SRLOCK11_SRLOCK372			(0x1u<<20)
#define	BSEC_SRLOCK11_SRLOCK371			(0x1u<<19)
#define	BSEC_SRLOCK11_SRLOCK370			(0x1u<<18)
#define	BSEC_SRLOCK11_SRLOCK369			(0x1u<<17)
#define	BSEC_SRLOCK11_SRLOCK368			(0x1u<<16)
#define	BSEC_SRLOCK11_SRLOCK367			(0x1u<<15)
#define	BSEC_SRLOCK11_SRLOCK366			(0x1u<<14)
#define	BSEC_SRLOCK11_SRLOCK365			(0x1u<<13)
#define	BSEC_SRLOCK11_SRLOCK364			(0x1u<<12)
#define	BSEC_SRLOCK11_SRLOCK363			(0x1u<<11)
#define	BSEC_SRLOCK11_SRLOCK362			(0x1u<<10)
#define	BSEC_SRLOCK11_SRLOCK361			(0x1u<<9)
#define	BSEC_SRLOCK11_SRLOCK360			(0x1u<<8)
#define	BSEC_SRLOCK11_SRLOCK359			(0x1u<<7)
#define	BSEC_SRLOCK11_SRLOCK358			(0x1u<<6)
#define	BSEC_SRLOCK11_SRLOCK357			(0x1u<<5)
#define	BSEC_SRLOCK11_SRLOCK356			(0x1u<<4)
#define	BSEC_SRLOCK11_SRLOCK355			(0x1u<<3)
#define	BSEC_SRLOCK11_SRLOCK354			(0x1u<<2)
#define	BSEC_SRLOCK11_SRLOCK353			(0x1u<<1)
#define	BSEC_SRLOCK11_SRLOCK352			(0x1u<<0)

#define	BSEC_SRLOCK11_SRLOCK383_B_0X0	(0x0u<<31)
#define	BSEC_SRLOCK11_SRLOCK383_B_0X1	(0x1u<<31)
#define	BSEC_SRLOCK11_SRLOCK382_B_0X0	(0x0u<<30)
#define	BSEC_SRLOCK11_SRLOCK382_B_0X1	(0x1u<<30)
#define	BSEC_SRLOCK11_SRLOCK381_B_0X0	(0x0u<<29)
#define	BSEC_SRLOCK11_SRLOCK381_B_0X1	(0x1u<<29)
#define	BSEC_SRLOCK11_SRLOCK380_B_0X0	(0x0u<<28)
#define	BSEC_SRLOCK11_SRLOCK380_B_0X1	(0x1u<<28)
#define	BSEC_SRLOCK11_SRLOCK379_B_0X0	(0x0u<<27)
#define	BSEC_SRLOCK11_SRLOCK379_B_0X1	(0x1u<<27)
#define	BSEC_SRLOCK11_SRLOCK378_B_0X0	(0x0u<<26)
#define	BSEC_SRLOCK11_SRLOCK378_B_0X1	(0x1u<<26)
#define	BSEC_SRLOCK11_SRLOCK377_B_0X0	(0x0u<<25)
#define	BSEC_SRLOCK11_SRLOCK377_B_0X1	(0x1u<<25)
#define	BSEC_SRLOCK11_SRLOCK376_B_0X0	(0x0u<<24)
#define	BSEC_SRLOCK11_SRLOCK376_B_0X1	(0x1u<<24)
#define	BSEC_SRLOCK11_SRLOCK375_B_0X0	(0x0u<<23)
#define	BSEC_SRLOCK11_SRLOCK375_B_0X1	(0x1u<<23)
#define	BSEC_SRLOCK11_SRLOCK374_B_0X0	(0x0u<<22)
#define	BSEC_SRLOCK11_SRLOCK374_B_0X1	(0x1u<<22)
#define	BSEC_SRLOCK11_SRLOCK373_B_0X0	(0x0u<<21)
#define	BSEC_SRLOCK11_SRLOCK373_B_0X1	(0x1u<<21)
#define	BSEC_SRLOCK11_SRLOCK372_B_0X0	(0x0u<<20)
#define	BSEC_SRLOCK11_SRLOCK372_B_0X1	(0x1u<<20)
#define	BSEC_SRLOCK11_SRLOCK371_B_0X0	(0x0u<<19)
#define	BSEC_SRLOCK11_SRLOCK371_B_0X1	(0x1u<<19)
#define	BSEC_SRLOCK11_SRLOCK370_B_0X0	(0x0u<<18)
#define	BSEC_SRLOCK11_SRLOCK370_B_0X1	(0x1u<<18)
#define	BSEC_SRLOCK11_SRLOCK369_B_0X0	(0x0u<<17)
#define	BSEC_SRLOCK11_SRLOCK369_B_0X1	(0x1u<<17)
#define	BSEC_SRLOCK11_SRLOCK368_B_0X0	(0x0u<<16)
#define	BSEC_SRLOCK11_SRLOCK368_B_0X1	(0x1u<<16)
#define	BSEC_SRLOCK11_SRLOCK367_B_0X0	(0x0u<<15)
#define	BSEC_SRLOCK11_SRLOCK367_B_0X1	(0x1u<<15)
#define	BSEC_SRLOCK11_SRLOCK366_B_0X0	(0x0u<<14)
#define	BSEC_SRLOCK11_SRLOCK366_B_0X1	(0x1u<<14)
#define	BSEC_SRLOCK11_SRLOCK365_B_0X0	(0x0u<<13)
#define	BSEC_SRLOCK11_SRLOCK365_B_0X1	(0x1u<<13)
#define	BSEC_SRLOCK11_SRLOCK364_B_0X0	(0x0u<<12)
#define	BSEC_SRLOCK11_SRLOCK364_B_0X1	(0x1u<<12)
#define	BSEC_SRLOCK11_SRLOCK363_B_0X0	(0x0u<<11)
#define	BSEC_SRLOCK11_SRLOCK363_B_0X1	(0x1u<<11)
#define	BSEC_SRLOCK11_SRLOCK362_B_0X0	(0x0u<<10)
#define	BSEC_SRLOCK11_SRLOCK362_B_0X1	(0x1u<<10)
#define	BSEC_SRLOCK11_SRLOCK361_B_0X0	(0x0u<<9)
#define	BSEC_SRLOCK11_SRLOCK361_B_0X1	(0x1u<<9)
#define	BSEC_SRLOCK11_SRLOCK360_B_0X0	(0x0u<<8)
#define	BSEC_SRLOCK11_SRLOCK360_B_0X1	(0x1u<<8)
#define	BSEC_SRLOCK11_SRLOCK359_B_0X0	(0x0u<<7)
#define	BSEC_SRLOCK11_SRLOCK359_B_0X1	(0x1u<<7)
#define	BSEC_SRLOCK11_SRLOCK358_B_0X0	(0x0u<<6)
#define	BSEC_SRLOCK11_SRLOCK358_B_0X1	(0x1u<<6)
#define	BSEC_SRLOCK11_SRLOCK357_B_0X0	(0x0u<<5)
#define	BSEC_SRLOCK11_SRLOCK357_B_0X1	(0x1u<<5)
#define	BSEC_SRLOCK11_SRLOCK356_B_0X0	(0x0u<<4)
#define	BSEC_SRLOCK11_SRLOCK356_B_0X1	(0x1u<<4)
#define	BSEC_SRLOCK11_SRLOCK355_B_0X0	(0x0u<<3)
#define	BSEC_SRLOCK11_SRLOCK355_B_0X1	(0x1u<<3)
#define	BSEC_SRLOCK11_SRLOCK354_B_0X0	(0x0u<<2)
#define	BSEC_SRLOCK11_SRLOCK354_B_0X1	(0x1u<<2)
#define	BSEC_SRLOCK11_SRLOCK353_B_0X0	(0x0u<<1)
#define	BSEC_SRLOCK11_SRLOCK353_B_0X1	(0x1u<<1)
#define	BSEC_SRLOCK11_SRLOCK352_B_0X0	(0x0u<<0)
#define	BSEC_SRLOCK11_SRLOCK352_B_0X1	(0x1u<<0)

// OTPVLDR0 Configuration

#define	BSEC_OTPVLDR0_VLDF31			(0x1u<<31)
#define	BSEC_OTPVLDR0_VLDF30			(0x1u<<30)
#define	BSEC_OTPVLDR0_VLDF29			(0x1u<<29)
#define	BSEC_OTPVLDR0_VLDF28			(0x1u<<28)
#define	BSEC_OTPVLDR0_VLDF27			(0x1u<<27)
#define	BSEC_OTPVLDR0_VLDF26			(0x1u<<26)
#define	BSEC_OTPVLDR0_VLDF25			(0x1u<<25)
#define	BSEC_OTPVLDR0_VLDF24			(0x1u<<24)
#define	BSEC_OTPVLDR0_VLDF23			(0x1u<<23)
#define	BSEC_OTPVLDR0_VLDF22			(0x1u<<22)
#define	BSEC_OTPVLDR0_VLDF21			(0x1u<<21)
#define	BSEC_OTPVLDR0_VLDF20			(0x1u<<20)
#define	BSEC_OTPVLDR0_VLDF19			(0x1u<<19)
#define	BSEC_OTPVLDR0_VLDF18			(0x1u<<18)
#define	BSEC_OTPVLDR0_VLDF17			(0x1u<<17)
#define	BSEC_OTPVLDR0_VLDF16			(0x1u<<16)
#define	BSEC_OTPVLDR0_VLDF15			(0x1u<<15)
#define	BSEC_OTPVLDR0_VLDF14			(0x1u<<14)
#define	BSEC_OTPVLDR0_VLDF13			(0x1u<<13)
#define	BSEC_OTPVLDR0_VLDF12			(0x1u<<12)
#define	BSEC_OTPVLDR0_VLDF11			(0x1u<<11)
#define	BSEC_OTPVLDR0_VLDF10			(0x1u<<10)
#define	BSEC_OTPVLDR0_VLDF9				(0x1u<<9)
#define	BSEC_OTPVLDR0_VLDF8				(0x1u<<8)
#define	BSEC_OTPVLDR0_VLDF7				(0x1u<<7)
#define	BSEC_OTPVLDR0_VLDF6				(0x1u<<6)
#define	BSEC_OTPVLDR0_VLDF5				(0x1u<<5)
#define	BSEC_OTPVLDR0_VLDF4				(0x1u<<4)
#define	BSEC_OTPVLDR0_VLDF3				(0x1u<<3)
#define	BSEC_OTPVLDR0_VLDF2				(0x1u<<2)
#define	BSEC_OTPVLDR0_VLDF1				(0x1u<<1)
#define	BSEC_OTPVLDR0_VLDF0				(0x1u<<0)

#define	BSEC_OTPVLDR0_VLDF31_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR0_VLDF31_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR0_VLDF30_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR0_VLDF30_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR0_VLDF29_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR0_VLDF29_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR0_VLDF28_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR0_VLDF28_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR0_VLDF27_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR0_VLDF27_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR0_VLDF26_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR0_VLDF26_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR0_VLDF25_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR0_VLDF25_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR0_VLDF24_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR0_VLDF24_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR0_VLDF23_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR0_VLDF23_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR0_VLDF22_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR0_VLDF22_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR0_VLDF21_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR0_VLDF21_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR0_VLDF20_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR0_VLDF20_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR0_VLDF19_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR0_VLDF19_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR0_VLDF18_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR0_VLDF18_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR0_VLDF17_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR0_VLDF17_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR0_VLDF16_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR0_VLDF16_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR0_VLDF15_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR0_VLDF15_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR0_VLDF14_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR0_VLDF14_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR0_VLDF13_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR0_VLDF13_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR0_VLDF12_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR0_VLDF12_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR0_VLDF11_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR0_VLDF11_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR0_VLDF10_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR0_VLDF10_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR0_VLDF9_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR0_VLDF9_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR0_VLDF8_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR0_VLDF8_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR0_VLDF7_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR0_VLDF7_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR0_VLDF6_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR0_VLDF6_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR0_VLDF5_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR0_VLDF5_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR0_VLDF4_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR0_VLDF4_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR0_VLDF3_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR0_VLDF3_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR0_VLDF2_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR0_VLDF2_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR0_VLDF1_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR0_VLDF1_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR0_VLDF0_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR0_VLDF0_B_0X1		(0x1u<<0)

// OTPVLDR1 Configuration

#define	BSEC_OTPVLDR1_VLDF63			(0x1u<<31)
#define	BSEC_OTPVLDR1_VLDF62			(0x1u<<30)
#define	BSEC_OTPVLDR1_VLDF61			(0x1u<<29)
#define	BSEC_OTPVLDR1_VLDF60			(0x1u<<28)
#define	BSEC_OTPVLDR1_VLDF59			(0x1u<<27)
#define	BSEC_OTPVLDR1_VLDF58			(0x1u<<26)
#define	BSEC_OTPVLDR1_VLDF57			(0x1u<<25)
#define	BSEC_OTPVLDR1_VLDF56			(0x1u<<24)
#define	BSEC_OTPVLDR1_VLDF55			(0x1u<<23)
#define	BSEC_OTPVLDR1_VLDF54			(0x1u<<22)
#define	BSEC_OTPVLDR1_VLDF53			(0x1u<<21)
#define	BSEC_OTPVLDR1_VLDF52			(0x1u<<20)
#define	BSEC_OTPVLDR1_VLDF51			(0x1u<<19)
#define	BSEC_OTPVLDR1_VLDF50			(0x1u<<18)
#define	BSEC_OTPVLDR1_VLDF49			(0x1u<<17)
#define	BSEC_OTPVLDR1_VLDF48			(0x1u<<16)
#define	BSEC_OTPVLDR1_VLDF47			(0x1u<<15)
#define	BSEC_OTPVLDR1_VLDF46			(0x1u<<14)
#define	BSEC_OTPVLDR1_VLDF45			(0x1u<<13)
#define	BSEC_OTPVLDR1_VLDF44			(0x1u<<12)
#define	BSEC_OTPVLDR1_VLDF43			(0x1u<<11)
#define	BSEC_OTPVLDR1_VLDF42			(0x1u<<10)
#define	BSEC_OTPVLDR1_VLDF41			(0x1u<<9)
#define	BSEC_OTPVLDR1_VLDF40			(0x1u<<8)
#define	BSEC_OTPVLDR1_VLDF39			(0x1u<<7)
#define	BSEC_OTPVLDR1_VLDF38			(0x1u<<6)
#define	BSEC_OTPVLDR1_VLDF37			(0x1u<<5)
#define	BSEC_OTPVLDR1_VLDF36			(0x1u<<4)
#define	BSEC_OTPVLDR1_VLDF35			(0x1u<<3)
#define	BSEC_OTPVLDR1_VLDF34			(0x1u<<2)
#define	BSEC_OTPVLDR1_VLDF33			(0x1u<<1)
#define	BSEC_OTPVLDR1_VLDF32			(0x1u<<0)

#define	BSEC_OTPVLDR1_VLDF63_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR1_VLDF63_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR1_VLDF62_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR1_VLDF62_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR1_VLDF61_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR1_VLDF61_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR1_VLDF60_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR1_VLDF60_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR1_VLDF59_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR1_VLDF59_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR1_VLDF58_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR1_VLDF58_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR1_VLDF57_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR1_VLDF57_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR1_VLDF56_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR1_VLDF56_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR1_VLDF55_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR1_VLDF55_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR1_VLDF54_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR1_VLDF54_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR1_VLDF53_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR1_VLDF53_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR1_VLDF52_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR1_VLDF52_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR1_VLDF51_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR1_VLDF51_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR1_VLDF50_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR1_VLDF50_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR1_VLDF49_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR1_VLDF49_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR1_VLDF48_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR1_VLDF48_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR1_VLDF47_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR1_VLDF47_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR1_VLDF46_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR1_VLDF46_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR1_VLDF45_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR1_VLDF45_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR1_VLDF44_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR1_VLDF44_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR1_VLDF43_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR1_VLDF43_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR1_VLDF42_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR1_VLDF42_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR1_VLDF41_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR1_VLDF41_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR1_VLDF40_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR1_VLDF40_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR1_VLDF39_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR1_VLDF39_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR1_VLDF38_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR1_VLDF38_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR1_VLDF37_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR1_VLDF37_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR1_VLDF36_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR1_VLDF36_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR1_VLDF35_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR1_VLDF35_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR1_VLDF34_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR1_VLDF34_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR1_VLDF33_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR1_VLDF33_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR1_VLDF32_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR1_VLDF32_B_0X1		(0x1u<<0)

// OTPVLDR2 Configuration

#define	BSEC_OTPVLDR2_VLDF95			(0x1u<<31)
#define	BSEC_OTPVLDR2_VLDF94			(0x1u<<30)
#define	BSEC_OTPVLDR2_VLDF93			(0x1u<<29)
#define	BSEC_OTPVLDR2_VLDF92			(0x1u<<28)
#define	BSEC_OTPVLDR2_VLDF91			(0x1u<<27)
#define	BSEC_OTPVLDR2_VLDF90			(0x1u<<26)
#define	BSEC_OTPVLDR2_VLDF89			(0x1u<<25)
#define	BSEC_OTPVLDR2_VLDF88			(0x1u<<24)
#define	BSEC_OTPVLDR2_VLDF87			(0x1u<<23)
#define	BSEC_OTPVLDR2_VLDF86			(0x1u<<22)
#define	BSEC_OTPVLDR2_VLDF85			(0x1u<<21)
#define	BSEC_OTPVLDR2_VLDF84			(0x1u<<20)
#define	BSEC_OTPVLDR2_VLDF83			(0x1u<<19)
#define	BSEC_OTPVLDR2_VLDF82			(0x1u<<18)
#define	BSEC_OTPVLDR2_VLDF81			(0x1u<<17)
#define	BSEC_OTPVLDR2_VLDF80			(0x1u<<16)
#define	BSEC_OTPVLDR2_VLDF79			(0x1u<<15)
#define	BSEC_OTPVLDR2_VLDF78			(0x1u<<14)
#define	BSEC_OTPVLDR2_VLDF77			(0x1u<<13)
#define	BSEC_OTPVLDR2_VLDF76			(0x1u<<12)
#define	BSEC_OTPVLDR2_VLDF75			(0x1u<<11)
#define	BSEC_OTPVLDR2_VLDF74			(0x1u<<10)
#define	BSEC_OTPVLDR2_VLDF73			(0x1u<<9)
#define	BSEC_OTPVLDR2_VLDF72			(0x1u<<8)
#define	BSEC_OTPVLDR2_VLDF71			(0x1u<<7)
#define	BSEC_OTPVLDR2_VLDF70			(0x1u<<6)
#define	BSEC_OTPVLDR2_VLDF69			(0x1u<<5)
#define	BSEC_OTPVLDR2_VLDF68			(0x1u<<4)
#define	BSEC_OTPVLDR2_VLDF67			(0x1u<<3)
#define	BSEC_OTPVLDR2_VLDF66			(0x1u<<2)
#define	BSEC_OTPVLDR2_VLDF65			(0x1u<<1)
#define	BSEC_OTPVLDR2_VLDF64			(0x1u<<0)

#define	BSEC_OTPVLDR2_VLDF95_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR2_VLDF95_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR2_VLDF94_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR2_VLDF94_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR2_VLDF93_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR2_VLDF93_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR2_VLDF92_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR2_VLDF92_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR2_VLDF91_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR2_VLDF91_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR2_VLDF90_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR2_VLDF90_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR2_VLDF89_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR2_VLDF89_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR2_VLDF88_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR2_VLDF88_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR2_VLDF87_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR2_VLDF87_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR2_VLDF86_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR2_VLDF86_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR2_VLDF85_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR2_VLDF85_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR2_VLDF84_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR2_VLDF84_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR2_VLDF83_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR2_VLDF83_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR2_VLDF82_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR2_VLDF82_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR2_VLDF81_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR2_VLDF81_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR2_VLDF80_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR2_VLDF80_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR2_VLDF79_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR2_VLDF79_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR2_VLDF78_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR2_VLDF78_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR2_VLDF77_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR2_VLDF77_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR2_VLDF76_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR2_VLDF76_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR2_VLDF75_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR2_VLDF75_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR2_VLDF74_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR2_VLDF74_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR2_VLDF73_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR2_VLDF73_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR2_VLDF72_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR2_VLDF72_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR2_VLDF71_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR2_VLDF71_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR2_VLDF70_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR2_VLDF70_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR2_VLDF69_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR2_VLDF69_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR2_VLDF68_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR2_VLDF68_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR2_VLDF67_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR2_VLDF67_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR2_VLDF66_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR2_VLDF66_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR2_VLDF65_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR2_VLDF65_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR2_VLDF64_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR2_VLDF64_B_0X1		(0x1u<<0)

// OTPVLDR3 Configuration

#define	BSEC_OTPVLDR3_VLDF127			(0x1u<<31)
#define	BSEC_OTPVLDR3_VLDF126			(0x1u<<30)
#define	BSEC_OTPVLDR3_VLDF125			(0x1u<<29)
#define	BSEC_OTPVLDR3_VLDF124			(0x1u<<28)
#define	BSEC_OTPVLDR3_VLDF123			(0x1u<<27)
#define	BSEC_OTPVLDR3_VLDF122			(0x1u<<26)
#define	BSEC_OTPVLDR3_VLDF121			(0x1u<<25)
#define	BSEC_OTPVLDR3_VLDF120			(0x1u<<24)
#define	BSEC_OTPVLDR3_VLDF119			(0x1u<<23)
#define	BSEC_OTPVLDR3_VLDF118			(0x1u<<22)
#define	BSEC_OTPVLDR3_VLDF117			(0x1u<<21)
#define	BSEC_OTPVLDR3_VLDF116			(0x1u<<20)
#define	BSEC_OTPVLDR3_VLDF115			(0x1u<<19)
#define	BSEC_OTPVLDR3_VLDF114			(0x1u<<18)
#define	BSEC_OTPVLDR3_VLDF113			(0x1u<<17)
#define	BSEC_OTPVLDR3_VLDF112			(0x1u<<16)
#define	BSEC_OTPVLDR3_VLDF111			(0x1u<<15)
#define	BSEC_OTPVLDR3_VLDF110			(0x1u<<14)
#define	BSEC_OTPVLDR3_VLDF109			(0x1u<<13)
#define	BSEC_OTPVLDR3_VLDF108			(0x1u<<12)
#define	BSEC_OTPVLDR3_VLDF107			(0x1u<<11)
#define	BSEC_OTPVLDR3_VLDF106			(0x1u<<10)
#define	BSEC_OTPVLDR3_VLDF105			(0x1u<<9)
#define	BSEC_OTPVLDR3_VLDF104			(0x1u<<8)
#define	BSEC_OTPVLDR3_VLDF103			(0x1u<<7)
#define	BSEC_OTPVLDR3_VLDF102			(0x1u<<6)
#define	BSEC_OTPVLDR3_VLDF101			(0x1u<<5)
#define	BSEC_OTPVLDR3_VLDF100			(0x1u<<4)
#define	BSEC_OTPVLDR3_VLDF99			(0x1u<<3)
#define	BSEC_OTPVLDR3_VLDF98			(0x1u<<2)
#define	BSEC_OTPVLDR3_VLDF97			(0x1u<<1)
#define	BSEC_OTPVLDR3_VLDF96			(0x1u<<0)

#define	BSEC_OTPVLDR3_VLDF127_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR3_VLDF127_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR3_VLDF126_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR3_VLDF126_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR3_VLDF125_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR3_VLDF125_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR3_VLDF124_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR3_VLDF124_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR3_VLDF123_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR3_VLDF123_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR3_VLDF122_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR3_VLDF122_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR3_VLDF121_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR3_VLDF121_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR3_VLDF120_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR3_VLDF120_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR3_VLDF119_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR3_VLDF119_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR3_VLDF118_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR3_VLDF118_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR3_VLDF117_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR3_VLDF117_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR3_VLDF116_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR3_VLDF116_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR3_VLDF115_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR3_VLDF115_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR3_VLDF114_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR3_VLDF114_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR3_VLDF113_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR3_VLDF113_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR3_VLDF112_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR3_VLDF112_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR3_VLDF111_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR3_VLDF111_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR3_VLDF110_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR3_VLDF110_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR3_VLDF109_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR3_VLDF109_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR3_VLDF108_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR3_VLDF108_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR3_VLDF107_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR3_VLDF107_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR3_VLDF106_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR3_VLDF106_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR3_VLDF105_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR3_VLDF105_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR3_VLDF104_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR3_VLDF104_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR3_VLDF103_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR3_VLDF103_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR3_VLDF102_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR3_VLDF102_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR3_VLDF101_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR3_VLDF101_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR3_VLDF100_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR3_VLDF100_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR3_VLDF99_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR3_VLDF99_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR3_VLDF98_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR3_VLDF98_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR3_VLDF97_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR3_VLDF97_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR3_VLDF96_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR3_VLDF96_B_0X1		(0x1u<<0)

