hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// OTPVLDR4 Configuration

#define	BSEC_OTPVLDR4_VLDF159			(0x1u<<31)
#define	BSEC_OTPVLDR4_VLDF158			(0x1u<<30)
#define	BSEC_OTPVLDR4_VLDF157			(0x1u<<29)
#define	BSEC_OTPVLDR4_VLDF156			(0x1u<<28)
#define	BSEC_OTPVLDR4_VLDF155			(0x1u<<27)
#define	BSEC_OTPVLDR4_VLDF154			(0x1u<<26)
#define	BSEC_OTPVLDR4_VLDF153			(0x1u<<25)
#define	BSEC_OTPVLDR4_VLDF152			(0x1u<<24)
#define	BSEC_OTPVLDR4_VLDF151			(0x1u<<23)
#define	BSEC_OTPVLDR4_VLDF150			(0x1u<<22)
#define	BSEC_OTPVLDR4_VLDF149			(0x1u<<21)
#define	BSEC_OTPVLDR4_VLDF148			(0x1u<<20)
#define	BSEC_OTPVLDR4_VLDF147			(0x1u<<19)
#define	BSEC_OTPVLDR4_VLDF146			(0x1u<<18)
#define	BSEC_OTPVLDR4_VLDF145			(0x1u<<17)
#define	BSEC_OTPVLDR4_VLDF144			(0x1u<<16)
#define	BSEC_OTPVLDR4_VLDF143			(0x1u<<15)
#define	BSEC_OTPVLDR4_VLDF142			(0x1u<<14)
#define	BSEC_OTPVLDR4_VLDF141			(0x1u<<13)
#define	BSEC_OTPVLDR4_VLDF140			(0x1u<<12)
#define	BSEC_OTPVLDR4_VLDF139			(0x1u<<11)
#define	BSEC_OTPVLDR4_VLDF138			(0x1u<<10)
#define	BSEC_OTPVLDR4_VLDF137			(0x1u<<9)
#define	BSEC_OTPVLDR4_VLDF136			(0x1u<<8)
#define	BSEC_OTPVLDR4_VLDF135			(0x1u<<7)
#define	BSEC_OTPVLDR4_VLDF134			(0x1u<<6)
#define	BSEC_OTPVLDR4_VLDF133			(0x1u<<5)
#define	BSEC_OTPVLDR4_VLDF132			(0x1u<<4)
#define	BSEC_OTPVLDR4_VLDF131			(0x1u<<3)
#define	BSEC_OTPVLDR4_VLDF130			(0x1u<<2)
#define	BSEC_OTPVLDR4_VLDF129			(0x1u<<1)
#define	BSEC_OTPVLDR4_VLDF128			(0x1u<<0)

#define	BSEC_OTPVLDR4_VLDF159_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR4_VLDF159_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR4_VLDF158_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR4_VLDF158_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR4_VLDF157_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR4_VLDF157_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR4_VLDF156_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR4_VLDF156_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR4_VLDF155_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR4_VLDF155_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR4_VLDF154_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR4_VLDF154_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR4_VLDF153_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR4_VLDF153_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR4_VLDF152_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR4_VLDF152_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR4_VLDF151_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR4_VLDF151_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR4_VLDF150_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR4_VLDF150_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR4_VLDF149_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR4_VLDF149_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR4_VLDF148_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR4_VLDF148_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR4_VLDF147_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR4_VLDF147_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR4_VLDF146_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR4_VLDF146_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR4_VLDF145_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR4_VLDF145_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR4_VLDF144_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR4_VLDF144_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR4_VLDF143_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR4_VLDF143_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR4_VLDF142_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR4_VLDF142_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR4_VLDF141_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR4_VLDF141_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR4_VLDF140_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR4_VLDF140_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR4_VLDF139_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR4_VLDF139_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR4_VLDF138_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR4_VLDF138_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR4_VLDF137_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR4_VLDF137_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR4_VLDF136_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR4_VLDF136_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR4_VLDF135_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR4_VLDF135_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR4_VLDF134_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR4_VLDF134_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR4_VLDF133_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR4_VLDF133_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR4_VLDF132_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR4_VLDF132_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR4_VLDF131_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR4_VLDF131_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR4_VLDF130_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR4_VLDF130_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR4_VLDF129_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR4_VLDF129_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR4_VLDF128_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR4_VLDF128_B_0X1		(0x1u<<0)

// OTPVLDR5 Configuration

#define	BSEC_OTPVLDR5_VLDF191			(0x1u<<31)
#define	BSEC_OTPVLDR5_VLDF190			(0x1u<<30)
#define	BSEC_OTPVLDR5_VLDF189			(0x1u<<29)
#define	BSEC_OTPVLDR5_VLDF188			(0x1u<<28)
#define	BSEC_OTPVLDR5_VLDF187			(0x1u<<27)
#define	BSEC_OTPVLDR5_VLDF186			(0x1u<<26)
#define	BSEC_OTPVLDR5_VLDF185			(0x1u<<25)
#define	BSEC_OTPVLDR5_VLDF184			(0x1u<<24)
#define	BSEC_OTPVLDR5_VLDF183			(0x1u<<23)
#define	BSEC_OTPVLDR5_VLDF182			(0x1u<<22)
#define	BSEC_OTPVLDR5_VLDF181			(0x1u<<21)
#define	BSEC_OTPVLDR5_VLDF180			(0x1u<<20)
#define	BSEC_OTPVLDR5_VLDF179			(0x1u<<19)
#define	BSEC_OTPVLDR5_VLDF178			(0x1u<<18)
#define	BSEC_OTPVLDR5_VLDF177			(0x1u<<17)
#define	BSEC_OTPVLDR5_VLDF176			(0x1u<<16)
#define	BSEC_OTPVLDR5_VLDF175			(0x1u<<15)
#define	BSEC_OTPVLDR5_VLDF174			(0x1u<<14)
#define	BSEC_OTPVLDR5_VLDF173			(0x1u<<13)
#define	BSEC_OTPVLDR5_VLDF172			(0x1u<<12)
#define	BSEC_OTPVLDR5_VLDF171			(0x1u<<11)
#define	BSEC_OTPVLDR5_VLDF170			(0x1u<<10)
#define	BSEC_OTPVLDR5_VLDF169			(0x1u<<9)
#define	BSEC_OTPVLDR5_VLDF168			(0x1u<<8)
#define	BSEC_OTPVLDR5_VLDF167			(0x1u<<7)
#define	BSEC_OTPVLDR5_VLDF166			(0x1u<<6)
#define	BSEC_OTPVLDR5_VLDF165			(0x1u<<5)
#define	BSEC_OTPVLDR5_VLDF164			(0x1u<<4)
#define	BSEC_OTPVLDR5_VLDF163			(0x1u<<3)
#define	BSEC_OTPVLDR5_VLDF162			(0x1u<<2)
#define	BSEC_OTPVLDR5_VLDF161			(0x1u<<1)
#define	BSEC_OTPVLDR5_VLDF160			(0x1u<<0)

#define	BSEC_OTPVLDR5_VLDF191_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR5_VLDF191_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR5_VLDF190_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR5_VLDF190_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR5_VLDF189_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR5_VLDF189_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR5_VLDF188_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR5_VLDF188_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR5_VLDF187_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR5_VLDF187_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR5_VLDF186_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR5_VLDF186_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR5_VLDF185_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR5_VLDF185_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR5_VLDF184_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR5_VLDF184_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR5_VLDF183_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR5_VLDF183_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR5_VLDF182_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR5_VLDF182_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR5_VLDF181_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR5_VLDF181_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR5_VLDF180_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR5_VLDF180_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR5_VLDF179_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR5_VLDF179_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR5_VLDF178_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR5_VLDF178_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR5_VLDF177_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR5_VLDF177_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR5_VLDF176_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR5_VLDF176_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR5_VLDF175_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR5_VLDF175_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR5_VLDF174_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR5_VLDF174_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR5_VLDF173_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR5_VLDF173_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR5_VLDF172_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR5_VLDF172_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR5_VLDF171_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR5_VLDF171_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR5_VLDF170_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR5_VLDF170_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR5_VLDF169_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR5_VLDF169_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR5_VLDF168_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR5_VLDF168_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR5_VLDF167_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR5_VLDF167_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR5_VLDF166_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR5_VLDF166_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR5_VLDF165_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR5_VLDF165_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR5_VLDF164_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR5_VLDF164_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR5_VLDF163_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR5_VLDF163_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR5_VLDF162_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR5_VLDF162_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR5_VLDF161_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR5_VLDF161_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR5_VLDF160_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR5_VLDF160_B_0X1		(0x1u<<0)

// OTPVLDR6 Configuration

#define	BSEC_OTPVLDR6_VLDF223			(0x1u<<31)
#define	BSEC_OTPVLDR6_VLDF222			(0x1u<<30)
#define	BSEC_OTPVLDR6_VLDF221			(0x1u<<29)
#define	BSEC_OTPVLDR6_VLDF220			(0x1u<<28)
#define	BSEC_OTPVLDR6_VLDF219			(0x1u<<27)
#define	BSEC_OTPVLDR6_VLDF218			(0x1u<<26)
#define	BSEC_OTPVLDR6_VLDF217			(0x1u<<25)
#define	BSEC_OTPVLDR6_VLDF216			(0x1u<<24)
#define	BSEC_OTPVLDR6_VLDF215			(0x1u<<23)
#define	BSEC_OTPVLDR6_VLDF214			(0x1u<<22)
#define	BSEC_OTPVLDR6_VLDF213			(0x1u<<21)
#define	BSEC_OTPVLDR6_VLDF212			(0x1u<<20)
#define	BSEC_OTPVLDR6_VLDF211			(0x1u<<19)
#define	BSEC_OTPVLDR6_VLDF210			(0x1u<<18)
#define	BSEC_OTPVLDR6_VLDF209			(0x1u<<17)
#define	BSEC_OTPVLDR6_VLDF208			(0x1u<<16)
#define	BSEC_OTPVLDR6_VLDF207			(0x1u<<15)
#define	BSEC_OTPVLDR6_VLDF206			(0x1u<<14)
#define	BSEC_OTPVLDR6_VLDF205			(0x1u<<13)
#define	BSEC_OTPVLDR6_VLDF204			(0x1u<<12)
#define	BSEC_OTPVLDR6_VLDF203			(0x1u<<11)
#define	BSEC_OTPVLDR6_VLDF202			(0x1u<<10)
#define	BSEC_OTPVLDR6_VLDF201			(0x1u<<9)
#define	BSEC_OTPVLDR6_VLDF200			(0x1u<<8)
#define	BSEC_OTPVLDR6_VLDF199			(0x1u<<7)
#define	BSEC_OTPVLDR6_VLDF198			(0x1u<<6)
#define	BSEC_OTPVLDR6_VLDF197			(0x1u<<5)
#define	BSEC_OTPVLDR6_VLDF196			(0x1u<<4)
#define	BSEC_OTPVLDR6_VLDF195			(0x1u<<3)
#define	BSEC_OTPVLDR6_VLDF194			(0x1u<<2)
#define	BSEC_OTPVLDR6_VLDF193			(0x1u<<1)
#define	BSEC_OTPVLDR6_VLDF192			(0x1u<<0)

#define	BSEC_OTPVLDR6_VLDF223_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR6_VLDF223_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR6_VLDF222_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR6_VLDF222_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR6_VLDF221_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR6_VLDF221_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR6_VLDF220_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR6_VLDF220_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR6_VLDF219_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR6_VLDF219_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR6_VLDF218_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR6_VLDF218_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR6_VLDF217_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR6_VLDF217_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR6_VLDF216_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR6_VLDF216_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR6_VLDF215_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR6_VLDF215_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR6_VLDF214_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR6_VLDF214_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR6_VLDF213_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR6_VLDF213_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR6_VLDF212_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR6_VLDF212_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR6_VLDF211_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR6_VLDF211_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR6_VLDF210_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR6_VLDF210_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR6_VLDF209_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR6_VLDF209_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR6_VLDF208_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR6_VLDF208_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR6_VLDF207_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR6_VLDF207_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR6_VLDF206_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR6_VLDF206_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR6_VLDF205_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR6_VLDF205_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR6_VLDF204_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR6_VLDF204_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR6_VLDF203_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR6_VLDF203_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR6_VLDF202_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR6_VLDF202_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR6_VLDF201_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR6_VLDF201_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR6_VLDF200_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR6_VLDF200_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR6_VLDF199_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR6_VLDF199_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR6_VLDF198_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR6_VLDF198_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR6_VLDF197_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR6_VLDF197_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR6_VLDF196_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR6_VLDF196_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR6_VLDF195_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR6_VLDF195_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR6_VLDF194_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR6_VLDF194_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR6_VLDF193_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR6_VLDF193_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR6_VLDF192_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR6_VLDF192_B_0X1		(0x1u<<0)

// OTPVLDR7 Configuration

#define	BSEC_OTPVLDR7_VLDF255			(0x1u<<31)
#define	BSEC_OTPVLDR7_VLDF254			(0x1u<<30)
#define	BSEC_OTPVLDR7_VLDF253			(0x1u<<29)
#define	BSEC_OTPVLDR7_VLDF252			(0x1u<<28)
#define	BSEC_OTPVLDR7_VLDF251			(0x1u<<27)
#define	BSEC_OTPVLDR7_VLDF250			(0x1u<<26)
#define	BSEC_OTPVLDR7_VLDF249			(0x1u<<25)
#define	BSEC_OTPVLDR7_VLDF248			(0x1u<<24)
#define	BSEC_OTPVLDR7_VLDF247			(0x1u<<23)
#define	BSEC_OTPVLDR7_VLDF246			(0x1u<<22)
#define	BSEC_OTPVLDR7_VLDF245			(0x1u<<21)
#define	BSEC_OTPVLDR7_VLDF244			(0x1u<<20)
#define	BSEC_OTPVLDR7_VLDF243			(0x1u<<19)
#define	BSEC_OTPVLDR7_VLDF242			(0x1u<<18)
#define	BSEC_OTPVLDR7_VLDF241			(0x1u<<17)
#define	BSEC_OTPVLDR7_VLDF240			(0x1u<<16)
#define	BSEC_OTPVLDR7_VLDF239			(0x1u<<15)
#define	BSEC_OTPVLDR7_VLDF238			(0x1u<<14)
#define	BSEC_OTPVLDR7_VLDF237			(0x1u<<13)
#define	BSEC_OTPVLDR7_VLDF236			(0x1u<<12)
#define	BSEC_OTPVLDR7_VLDF235			(0x1u<<11)
#define	BSEC_OTPVLDR7_VLDF234			(0x1u<<10)
#define	BSEC_OTPVLDR7_VLDF233			(0x1u<<9)
#define	BSEC_OTPVLDR7_VLDF232			(0x1u<<8)
#define	BSEC_OTPVLDR7_VLDF231			(0x1u<<7)
#define	BSEC_OTPVLDR7_VLDF230			(0x1u<<6)
#define	BSEC_OTPVLDR7_VLDF229			(0x1u<<5)
#define	BSEC_OTPVLDR7_VLDF228			(0x1u<<4)
#define	BSEC_OTPVLDR7_VLDF227			(0x1u<<3)
#define	BSEC_OTPVLDR7_VLDF226			(0x1u<<2)
#define	BSEC_OTPVLDR7_VLDF225			(0x1u<<1)
#define	BSEC_OTPVLDR7_VLDF224			(0x1u<<0)

#define	BSEC_OTPVLDR7_VLDF255_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR7_VLDF255_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR7_VLDF254_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR7_VLDF254_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR7_VLDF253_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR7_VLDF253_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR7_VLDF252_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR7_VLDF252_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR7_VLDF251_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR7_VLDF251_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR7_VLDF250_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR7_VLDF250_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR7_VLDF249_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR7_VLDF249_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR7_VLDF248_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR7_VLDF248_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR7_VLDF247_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR7_VLDF247_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR7_VLDF246_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR7_VLDF246_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR7_VLDF245_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR7_VLDF245_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR7_VLDF244_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR7_VLDF244_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR7_VLDF243_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR7_VLDF243_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR7_VLDF242_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR7_VLDF242_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR7_VLDF241_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR7_VLDF241_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR7_VLDF240_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR7_VLDF240_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR7_VLDF239_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR7_VLDF239_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR7_VLDF238_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR7_VLDF238_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR7_VLDF237_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR7_VLDF237_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR7_VLDF236_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR7_VLDF236_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR7_VLDF235_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR7_VLDF235_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR7_VLDF234_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR7_VLDF234_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR7_VLDF233_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR7_VLDF233_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR7_VLDF232_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR7_VLDF232_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR7_VLDF231_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR7_VLDF231_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR7_VLDF230_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR7_VLDF230_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR7_VLDF229_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR7_VLDF229_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR7_VLDF228_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR7_VLDF228_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR7_VLDF227_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR7_VLDF227_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR7_VLDF226_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR7_VLDF226_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR7_VLDF225_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR7_VLDF225_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR7_VLDF224_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR7_VLDF224_B_0X1		(0x1u<<0)

