hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// OTPVLDR8 Configuration

#define	BSEC_OTPVLDR8_VLDF287			(0x1u<<31)
#define	BSEC_OTPVLDR8_VLDF286			(0x1u<<30)
#define	BSEC_OTPVLDR8_VLDF285			(0x1u<<29)
#define	BSEC_OTPVLDR8_VLDF284			(0x1u<<28)
#define	BSEC_OTPVLDR8_VLDF283			(0x1u<<27)
#define	BSEC_OTPVLDR8_VLDF282			(0x1u<<26)
#define	BSEC_OTPVLDR8_VLDF281			(0x1u<<25)
#define	BSEC_OTPVLDR8_VLDF280			(0x1u<<24)
#define	BSEC_OTPVLDR8_VLDF279			(0x1u<<23)
#define	BSEC_OTPVLDR8_VLDF278			(0x1u<<22)
#define	BSEC_OTPVLDR8_VLDF277			(0x1u<<21)
#define	BSEC_OTPVLDR8_VLDF276			(0x1u<<20)
#define	BSEC_OTPVLDR8_VLDF275			(0x1u<<19)
#define	BSEC_OTPVLDR8_VLDF274			(0x1u<<18)
#define	BSEC_OTPVLDR8_VLDF273			(0x1u<<17)
#define	BSEC_OTPVLDR8_VLDF272			(0x1u<<16)
#define	BSEC_OTPVLDR8_VLDF271			(0x1u<<15)
#define	BSEC_OTPVLDR8_VLDF270			(0x1u<<14)
#define	BSEC_OTPVLDR8_VLDF269			(0x1u<<13)
#define	BSEC_OTPVLDR8_VLDF268			(0x1u<<12)
#define	BSEC_OTPVLDR8_VLDF267			(0x1u<<11)
#define	BSEC_OTPVLDR8_VLDF266			(0x1u<<10)
#define	BSEC_OTPVLDR8_VLDF265			(0x1u<<9)
#define	BSEC_OTPVLDR8_VLDF264			(0x1u<<8)
#define	BSEC_OTPVLDR8_VLDF263			(0x1u<<7)
#define	BSEC_OTPVLDR8_VLDF262			(0x1u<<6)
#define	BSEC_OTPVLDR8_VLDF261			(0x1u<<5)
#define	BSEC_OTPVLDR8_VLDF260			(0x1u<<4)
#define	BSEC_OTPVLDR8_VLDF259			(0x1u<<3)
#define	BSEC_OTPVLDR8_VLDF258			(0x1u<<2)
#define	BSEC_OTPVLDR8_VLDF257			(0x1u<<1)
#define	BSEC_OTPVLDR8_VLDF256			(0x1u<<0)

#define	BSEC_OTPVLDR8_VLDF287_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR8_VLDF287_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR8_VLDF286_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR8_VLDF286_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR8_VLDF285_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR8_VLDF285_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR8_VLDF284_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR8_VLDF284_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR8_VLDF283_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR8_VLDF283_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR8_VLDF282_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR8_VLDF282_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR8_VLDF281_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR8_VLDF281_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR8_VLDF280_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR8_VLDF280_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR8_VLDF279_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR8_VLDF279_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR8_VLDF278_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR8_VLDF278_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR8_VLDF277_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR8_VLDF277_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR8_VLDF276_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR8_VLDF276_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR8_VLDF275_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR8_VLDF275_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR8_VLDF274_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR8_VLDF274_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR8_VLDF273_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR8_VLDF273_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR8_VLDF272_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR8_VLDF272_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR8_VLDF271_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR8_VLDF271_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR8_VLDF270_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR8_VLDF270_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR8_VLDF269_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR8_VLDF269_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR8_VLDF268_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR8_VLDF268_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR8_VLDF267_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR8_VLDF267_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR8_VLDF266_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR8_VLDF266_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR8_VLDF265_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR8_VLDF265_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR8_VLDF264_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR8_VLDF264_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR8_VLDF263_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR8_VLDF263_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR8_VLDF262_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR8_VLDF262_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR8_VLDF261_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR8_VLDF261_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR8_VLDF260_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR8_VLDF260_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR8_VLDF259_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR8_VLDF259_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR8_VLDF258_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR8_VLDF258_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR8_VLDF257_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR8_VLDF257_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR8_VLDF256_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR8_VLDF256_B_0X1		(0x1u<<0)

// OTPVLDR9 Configuration

#define	BSEC_OTPVLDR9_VLDF319			(0x1u<<31)
#define	BSEC_OTPVLDR9_VLDF318			(0x1u<<30)
#define	BSEC_OTPVLDR9_VLDF317			(0x1u<<29)
#define	BSEC_OTPVLDR9_VLDF316			(0x1u<<28)
#define	BSEC_OTPVLDR9_VLDF315			(0x1u<<27)
#define	BSEC_OTPVLDR9_VLDF314			(0x1u<<26)
#define	BSEC_OTPVLDR9_VLDF313			(0x1u<<25)
#define	BSEC_OTPVLDR9_VLDF312			(0x1u<<24)
#define	BSEC_OTPVLDR9_VLDF311			(0x1u<<23)
#define	BSEC_OTPVLDR9_VLDF310			(0x1u<<22)
#define	BSEC_OTPVLDR9_VLDF309			(0x1u<<21)
#define	BSEC_OTPVLDR9_VLDF308			(0x1u<<20)
#define	BSEC_OTPVLDR9_VLDF307			(0x1u<<19)
#define	BSEC_OTPVLDR9_VLDF306			(0x1u<<18)
#define	BSEC_OTPVLDR9_VLDF305			(0x1u<<17)
#define	BSEC_OTPVLDR9_VLDF304			(0x1u<<16)
#define	BSEC_OTPVLDR9_VLDF303			(0x1u<<15)
#define	BSEC_OTPVLDR9_VLDF302			(0x1u<<14)
#define	BSEC_OTPVLDR9_VLDF301			(0x1u<<13)
#define	BSEC_OTPVLDR9_VLDF300			(0x1u<<12)
#define	BSEC_OTPVLDR9_VLDF299			(0x1u<<11)
#define	BSEC_OTPVLDR9_VLDF298			(0x1u<<10)
#define	BSEC_OTPVLDR9_VLDF297			(0x1u<<9)
#define	BSEC_OTPVLDR9_VLDF296			(0x1u<<8)
#define	BSEC_OTPVLDR9_VLDF295			(0x1u<<7)
#define	BSEC_OTPVLDR9_VLDF294			(0x1u<<6)
#define	BSEC_OTPVLDR9_VLDF293			(0x1u<<5)
#define	BSEC_OTPVLDR9_VLDF292			(0x1u<<4)
#define	BSEC_OTPVLDR9_VLDF291			(0x1u<<3)
#define	BSEC_OTPVLDR9_VLDF290			(0x1u<<2)
#define	BSEC_OTPVLDR9_VLDF289			(0x1u<<1)
#define	BSEC_OTPVLDR9_VLDF288			(0x1u<<0)

#define	BSEC_OTPVLDR9_VLDF319_B_0X0		(0x0u<<31)
#define	BSEC_OTPVLDR9_VLDF319_B_0X1		(0x1u<<31)
#define	BSEC_OTPVLDR9_VLDF318_B_0X0		(0x0u<<30)
#define	BSEC_OTPVLDR9_VLDF318_B_0X1		(0x1u<<30)
#define	BSEC_OTPVLDR9_VLDF317_B_0X0		(0x0u<<29)
#define	BSEC_OTPVLDR9_VLDF317_B_0X1		(0x1u<<29)
#define	BSEC_OTPVLDR9_VLDF316_B_0X0		(0x0u<<28)
#define	BSEC_OTPVLDR9_VLDF316_B_0X1		(0x1u<<28)
#define	BSEC_OTPVLDR9_VLDF315_B_0X0		(0x0u<<27)
#define	BSEC_OTPVLDR9_VLDF315_B_0X1		(0x1u<<27)
#define	BSEC_OTPVLDR9_VLDF314_B_0X0		(0x0u<<26)
#define	BSEC_OTPVLDR9_VLDF314_B_0X1		(0x1u<<26)
#define	BSEC_OTPVLDR9_VLDF313_B_0X0		(0x0u<<25)
#define	BSEC_OTPVLDR9_VLDF313_B_0X1		(0x1u<<25)
#define	BSEC_OTPVLDR9_VLDF312_B_0X0		(0x0u<<24)
#define	BSEC_OTPVLDR9_VLDF312_B_0X1		(0x1u<<24)
#define	BSEC_OTPVLDR9_VLDF311_B_0X0		(0x0u<<23)
#define	BSEC_OTPVLDR9_VLDF311_B_0X1		(0x1u<<23)
#define	BSEC_OTPVLDR9_VLDF310_B_0X0		(0x0u<<22)
#define	BSEC_OTPVLDR9_VLDF310_B_0X1		(0x1u<<22)
#define	BSEC_OTPVLDR9_VLDF309_B_0X0		(0x0u<<21)
#define	BSEC_OTPVLDR9_VLDF309_B_0X1		(0x1u<<21)
#define	BSEC_OTPVLDR9_VLDF308_B_0X0		(0x0u<<20)
#define	BSEC_OTPVLDR9_VLDF308_B_0X1		(0x1u<<20)
#define	BSEC_OTPVLDR9_VLDF307_B_0X0		(0x0u<<19)
#define	BSEC_OTPVLDR9_VLDF307_B_0X1		(0x1u<<19)
#define	BSEC_OTPVLDR9_VLDF306_B_0X0		(0x0u<<18)
#define	BSEC_OTPVLDR9_VLDF306_B_0X1		(0x1u<<18)
#define	BSEC_OTPVLDR9_VLDF305_B_0X0		(0x0u<<17)
#define	BSEC_OTPVLDR9_VLDF305_B_0X1		(0x1u<<17)
#define	BSEC_OTPVLDR9_VLDF304_B_0X0		(0x0u<<16)
#define	BSEC_OTPVLDR9_VLDF304_B_0X1		(0x1u<<16)
#define	BSEC_OTPVLDR9_VLDF303_B_0X0		(0x0u<<15)
#define	BSEC_OTPVLDR9_VLDF303_B_0X1		(0x1u<<15)
#define	BSEC_OTPVLDR9_VLDF302_B_0X0		(0x0u<<14)
#define	BSEC_OTPVLDR9_VLDF302_B_0X1		(0x1u<<14)
#define	BSEC_OTPVLDR9_VLDF301_B_0X0		(0x0u<<13)
#define	BSEC_OTPVLDR9_VLDF301_B_0X1		(0x1u<<13)
#define	BSEC_OTPVLDR9_VLDF300_B_0X0		(0x0u<<12)
#define	BSEC_OTPVLDR9_VLDF300_B_0X1		(0x1u<<12)
#define	BSEC_OTPVLDR9_VLDF299_B_0X0		(0x0u<<11)
#define	BSEC_OTPVLDR9_VLDF299_B_0X1		(0x1u<<11)
#define	BSEC_OTPVLDR9_VLDF298_B_0X0		(0x0u<<10)
#define	BSEC_OTPVLDR9_VLDF298_B_0X1		(0x1u<<10)
#define	BSEC_OTPVLDR9_VLDF297_B_0X0		(0x0u<<9)
#define	BSEC_OTPVLDR9_VLDF297_B_0X1		(0x1u<<9)
#define	BSEC_OTPVLDR9_VLDF296_B_0X0		(0x0u<<8)
#define	BSEC_OTPVLDR9_VLDF296_B_0X1		(0x1u<<8)
#define	BSEC_OTPVLDR9_VLDF295_B_0X0		(0x0u<<7)
#define	BSEC_OTPVLDR9_VLDF295_B_0X1		(0x1u<<7)
#define	BSEC_OTPVLDR9_VLDF294_B_0X0		(0x0u<<6)
#define	BSEC_OTPVLDR9_VLDF294_B_0X1		(0x1u<<6)
#define	BSEC_OTPVLDR9_VLDF293_B_0X0		(0x0u<<5)
#define	BSEC_OTPVLDR9_VLDF293_B_0X1		(0x1u<<5)
#define	BSEC_OTPVLDR9_VLDF292_B_0X0		(0x0u<<4)
#define	BSEC_OTPVLDR9_VLDF292_B_0X1		(0x1u<<4)
#define	BSEC_OTPVLDR9_VLDF291_B_0X0		(0x0u<<3)
#define	BSEC_OTPVLDR9_VLDF291_B_0X1		(0x1u<<3)
#define	BSEC_OTPVLDR9_VLDF290_B_0X0		(0x0u<<2)
#define	BSEC_OTPVLDR9_VLDF290_B_0X1		(0x1u<<2)
#define	BSEC_OTPVLDR9_VLDF289_B_0X0		(0x0u<<1)
#define	BSEC_OTPVLDR9_VLDF289_B_0X1		(0x1u<<1)
#define	BSEC_OTPVLDR9_VLDF288_B_0X0		(0x0u<<0)
#define	BSEC_OTPVLDR9_VLDF288_B_0X1		(0x1u<<0)

// OTPVLDR10 Configuration

#define	BSEC_OTPVLDR10_VLDF351			(0x1u<<31)
#define	BSEC_OTPVLDR10_VLDF350			(0x1u<<30)
#define	BSEC_OTPVLDR10_VLDF349			(0x1u<<29)
#define	BSEC_OTPVLDR10_VLDF348			(0x1u<<28)
#define	BSEC_OTPVLDR10_VLDF347			(0x1u<<27)
#define	BSEC_OTPVLDR10_VLDF346			(0x1u<<26)
#define	BSEC_OTPVLDR10_VLDF345			(0x1u<<25)
#define	BSEC_OTPVLDR10_VLDF344			(0x1u<<24)
#define	BSEC_OTPVLDR10_VLDF343			(0x1u<<23)
#define	BSEC_OTPVLDR10_VLDF342			(0x1u<<22)
#define	BSEC_OTPVLDR10_VLDF341			(0x1u<<21)
#define	BSEC_OTPVLDR10_VLDF340			(0x1u<<20)
#define	BSEC_OTPVLDR10_VLDF339			(0x1u<<19)
#define	BSEC_OTPVLDR10_VLDF338			(0x1u<<18)
#define	BSEC_OTPVLDR10_VLDF337			(0x1u<<17)
#define	BSEC_OTPVLDR10_VLDF336			(0x1u<<16)
#define	BSEC_OTPVLDR10_VLDF335			(0x1u<<15)
#define	BSEC_OTPVLDR10_VLDF334			(0x1u<<14)
#define	BSEC_OTPVLDR10_VLDF333			(0x1u<<13)
#define	BSEC_OTPVLDR10_VLDF332			(0x1u<<12)
#define	BSEC_OTPVLDR10_VLDF331			(0x1u<<11)
#define	BSEC_OTPVLDR10_VLDF330			(0x1u<<10)
#define	BSEC_OTPVLDR10_VLDF329			(0x1u<<9)
#define	BSEC_OTPVLDR10_VLDF328			(0x1u<<8)
#define	BSEC_OTPVLDR10_VLDF327			(0x1u<<7)
#define	BSEC_OTPVLDR10_VLDF326			(0x1u<<6)
#define	BSEC_OTPVLDR10_VLDF325			(0x1u<<5)
#define	BSEC_OTPVLDR10_VLDF324			(0x1u<<4)
#define	BSEC_OTPVLDR10_VLDF323			(0x1u<<3)
#define	BSEC_OTPVLDR10_VLDF322			(0x1u<<2)
#define	BSEC_OTPVLDR10_VLDF321			(0x1u<<1)
#define	BSEC_OTPVLDR10_VLDF320			(0x1u<<0)

#define	BSEC_OTPVLDR10_VLDF351_B_0X0	(0x0u<<31)
#define	BSEC_OTPVLDR10_VLDF351_B_0X1	(0x1u<<31)
#define	BSEC_OTPVLDR10_VLDF350_B_0X0	(0x0u<<30)
#define	BSEC_OTPVLDR10_VLDF350_B_0X1	(0x1u<<30)
#define	BSEC_OTPVLDR10_VLDF349_B_0X0	(0x0u<<29)
#define	BSEC_OTPVLDR10_VLDF349_B_0X1	(0x1u<<29)
#define	BSEC_OTPVLDR10_VLDF348_B_0X0	(0x0u<<28)
#define	BSEC_OTPVLDR10_VLDF348_B_0X1	(0x1u<<28)
#define	BSEC_OTPVLDR10_VLDF347_B_0X0	(0x0u<<27)
#define	BSEC_OTPVLDR10_VLDF347_B_0X1	(0x1u<<27)
#define	BSEC_OTPVLDR10_VLDF346_B_0X0	(0x0u<<26)
#define	BSEC_OTPVLDR10_VLDF346_B_0X1	(0x1u<<26)
#define	BSEC_OTPVLDR10_VLDF345_B_0X0	(0x0u<<25)
#define	BSEC_OTPVLDR10_VLDF345_B_0X1	(0x1u<<25)
#define	BSEC_OTPVLDR10_VLDF344_B_0X0	(0x0u<<24)
#define	BSEC_OTPVLDR10_VLDF344_B_0X1	(0x1u<<24)
#define	BSEC_OTPVLDR10_VLDF343_B_0X0	(0x0u<<23)
#define	BSEC_OTPVLDR10_VLDF343_B_0X1	(0x1u<<23)
#define	BSEC_OTPVLDR10_VLDF342_B_0X0	(0x0u<<22)
#define	BSEC_OTPVLDR10_VLDF342_B_0X1	(0x1u<<22)
#define	BSEC_OTPVLDR10_VLDF341_B_0X0	(0x0u<<21)
#define	BSEC_OTPVLDR10_VLDF341_B_0X1	(0x1u<<21)
#define	BSEC_OTPVLDR10_VLDF340_B_0X0	(0x0u<<20)
#define	BSEC_OTPVLDR10_VLDF340_B_0X1	(0x1u<<20)
#define	BSEC_OTPVLDR10_VLDF339_B_0X0	(0x0u<<19)
#define	BSEC_OTPVLDR10_VLDF339_B_0X1	(0x1u<<19)
#define	BSEC_OTPVLDR10_VLDF338_B_0X0	(0x0u<<18)
#define	BSEC_OTPVLDR10_VLDF338_B_0X1	(0x1u<<18)
#define	BSEC_OTPVLDR10_VLDF337_B_0X0	(0x0u<<17)
#define	BSEC_OTPVLDR10_VLDF337_B_0X1	(0x1u<<17)
#define	BSEC_OTPVLDR10_VLDF336_B_0X0	(0x0u<<16)
#define	BSEC_OTPVLDR10_VLDF336_B_0X1	(0x1u<<16)
#define	BSEC_OTPVLDR10_VLDF335_B_0X0	(0x0u<<15)
#define	BSEC_OTPVLDR10_VLDF335_B_0X1	(0x1u<<15)
#define	BSEC_OTPVLDR10_VLDF334_B_0X0	(0x0u<<14)
#define	BSEC_OTPVLDR10_VLDF334_B_0X1	(0x1u<<14)
#define	BSEC_OTPVLDR10_VLDF333_B_0X0	(0x0u<<13)
#define	BSEC_OTPVLDR10_VLDF333_B_0X1	(0x1u<<13)
#define	BSEC_OTPVLDR10_VLDF332_B_0X0	(0x0u<<12)
#define	BSEC_OTPVLDR10_VLDF332_B_0X1	(0x1u<<12)
#define	BSEC_OTPVLDR10_VLDF331_B_0X0	(0x0u<<11)
#define	BSEC_OTPVLDR10_VLDF331_B_0X1	(0x1u<<11)
#define	BSEC_OTPVLDR10_VLDF330_B_0X0	(0x0u<<10)
#define	BSEC_OTPVLDR10_VLDF330_B_0X1	(0x1u<<10)
#define	BSEC_OTPVLDR10_VLDF329_B_0X0	(0x0u<<9)
#define	BSEC_OTPVLDR10_VLDF329_B_0X1	(0x1u<<9)
#define	BSEC_OTPVLDR10_VLDF328_B_0X0	(0x0u<<8)
#define	BSEC_OTPVLDR10_VLDF328_B_0X1	(0x1u<<8)
#define	BSEC_OTPVLDR10_VLDF327_B_0X0	(0x0u<<7)
#define	BSEC_OTPVLDR10_VLDF327_B_0X1	(0x1u<<7)
#define	BSEC_OTPVLDR10_VLDF326_B_0X0	(0x0u<<6)
#define	BSEC_OTPVLDR10_VLDF326_B_0X1	(0x1u<<6)
#define	BSEC_OTPVLDR10_VLDF325_B_0X0	(0x0u<<5)
#define	BSEC_OTPVLDR10_VLDF325_B_0X1	(0x1u<<5)
#define	BSEC_OTPVLDR10_VLDF324_B_0X0	(0x0u<<4)
#define	BSEC_OTPVLDR10_VLDF324_B_0X1	(0x1u<<4)
#define	BSEC_OTPVLDR10_VLDF323_B_0X0	(0x0u<<3)
#define	BSEC_OTPVLDR10_VLDF323_B_0X1	(0x1u<<3)
#define	BSEC_OTPVLDR10_VLDF322_B_0X0	(0x0u<<2)
#define	BSEC_OTPVLDR10_VLDF322_B_0X1	(0x1u<<2)
#define	BSEC_OTPVLDR10_VLDF321_B_0X0	(0x0u<<1)
#define	BSEC_OTPVLDR10_VLDF321_B_0X1	(0x1u<<1)
#define	BSEC_OTPVLDR10_VLDF320_B_0X0	(0x0u<<0)
#define	BSEC_OTPVLDR10_VLDF320_B_0X1	(0x1u<<0)

// OTPVLDR11 Configuration

#define	BSEC_OTPVLDR11_VLDF383			(0x1u<<31)
#define	BSEC_OTPVLDR11_VLDF382			(0x1u<<30)
#define	BSEC_OTPVLDR11_VLDF381			(0x1u<<29)
#define	BSEC_OTPVLDR11_VLDF380			(0x1u<<28)
#define	BSEC_OTPVLDR11_VLDF379			(0x1u<<27)
#define	BSEC_OTPVLDR11_VLDF378			(0x1u<<26)
#define	BSEC_OTPVLDR11_VLDF377			(0x1u<<25)
#define	BSEC_OTPVLDR11_VLDF376			(0x1u<<24)
#define	BSEC_OTPVLDR11_VLDF375			(0x1u<<23)
#define	BSEC_OTPVLDR11_VLDF374			(0x1u<<22)
#define	BSEC_OTPVLDR11_VLDF373			(0x1u<<21)
#define	BSEC_OTPVLDR11_VLDF372			(0x1u<<20)
#define	BSEC_OTPVLDR11_VLDF371			(0x1u<<19)
#define	BSEC_OTPVLDR11_VLDF370			(0x1u<<18)
#define	BSEC_OTPVLDR11_VLDF369			(0x1u<<17)
#define	BSEC_OTPVLDR11_VLDF368			(0x1u<<16)
#define	BSEC_OTPVLDR11_VLDF367			(0x1u<<15)
#define	BSEC_OTPVLDR11_VLDF366			(0x1u<<14)
#define	BSEC_OTPVLDR11_VLDF365			(0x1u<<13)
#define	BSEC_OTPVLDR11_VLDF364			(0x1u<<12)
#define	BSEC_OTPVLDR11_VLDF363			(0x1u<<11)
#define	BSEC_OTPVLDR11_VLDF362			(0x1u<<10)
#define	BSEC_OTPVLDR11_VLDF361			(0x1u<<9)
#define	BSEC_OTPVLDR11_VLDF360			(0x1u<<8)
#define	BSEC_OTPVLDR11_VLDF359			(0x1u<<7)
#define	BSEC_OTPVLDR11_VLDF358			(0x1u<<6)
#define	BSEC_OTPVLDR11_VLDF357			(0x1u<<5)
#define	BSEC_OTPVLDR11_VLDF356			(0x1u<<4)
#define	BSEC_OTPVLDR11_VLDF355			(0x1u<<3)
#define	BSEC_OTPVLDR11_VLDF354			(0x1u<<2)
#define	BSEC_OTPVLDR11_VLDF353			(0x1u<<1)
#define	BSEC_OTPVLDR11_VLDF352			(0x1u<<0)

#define	BSEC_OTPVLDR11_VLDF383_B_0X0	(0x0u<<31)
#define	BSEC_OTPVLDR11_VLDF383_B_0X1	(0x1u<<31)
#define	BSEC_OTPVLDR11_VLDF382_B_0X0	(0x0u<<30)
#define	BSEC_OTPVLDR11_VLDF382_B_0X1	(0x1u<<30)
#define	BSEC_OTPVLDR11_VLDF381_B_0X0	(0x0u<<29)
#define	BSEC_OTPVLDR11_VLDF381_B_0X1	(0x1u<<29)
#define	BSEC_OTPVLDR11_VLDF380_B_0X0	(0x0u<<28)
#define	BSEC_OTPVLDR11_VLDF380_B_0X1	(0x1u<<28)
#define	BSEC_OTPVLDR11_VLDF379_B_0X0	(0x0u<<27)
#define	BSEC_OTPVLDR11_VLDF379_B_0X1	(0x1u<<27)
#define	BSEC_OTPVLDR11_VLDF378_B_0X0	(0x0u<<26)
#define	BSEC_OTPVLDR11_VLDF378_B_0X1	(0x1u<<26)
#define	BSEC_OTPVLDR11_VLDF377_B_0X0	(0x0u<<25)
#define	BSEC_OTPVLDR11_VLDF377_B_0X1	(0x1u<<25)
#define	BSEC_OTPVLDR11_VLDF376_B_0X0	(0x0u<<24)
#define	BSEC_OTPVLDR11_VLDF376_B_0X1	(0x1u<<24)
#define	BSEC_OTPVLDR11_VLDF375_B_0X0	(0x0u<<23)
#define	BSEC_OTPVLDR11_VLDF375_B_0X1	(0x1u<<23)
#define	BSEC_OTPVLDR11_VLDF374_B_0X0	(0x0u<<22)
#define	BSEC_OTPVLDR11_VLDF374_B_0X1	(0x1u<<22)
#define	BSEC_OTPVLDR11_VLDF373_B_0X0	(0x0u<<21)
#define	BSEC_OTPVLDR11_VLDF373_B_0X1	(0x1u<<21)
#define	BSEC_OTPVLDR11_VLDF372_B_0X0	(0x0u<<20)
#define	BSEC_OTPVLDR11_VLDF372_B_0X1	(0x1u<<20)
#define	BSEC_OTPVLDR11_VLDF371_B_0X0	(0x0u<<19)
#define	BSEC_OTPVLDR11_VLDF371_B_0X1	(0x1u<<19)
#define	BSEC_OTPVLDR11_VLDF370_B_0X0	(0x0u<<18)
#define	BSEC_OTPVLDR11_VLDF370_B_0X1	(0x1u<<18)
#define	BSEC_OTPVLDR11_VLDF369_B_0X0	(0x0u<<17)
#define	BSEC_OTPVLDR11_VLDF369_B_0X1	(0x1u<<17)
#define	BSEC_OTPVLDR11_VLDF368_B_0X0	(0x0u<<16)
#define	BSEC_OTPVLDR11_VLDF368_B_0X1	(0x1u<<16)
#define	BSEC_OTPVLDR11_VLDF367_B_0X0	(0x0u<<15)
#define	BSEC_OTPVLDR11_VLDF367_B_0X1	(0x1u<<15)
#define	BSEC_OTPVLDR11_VLDF366_B_0X0	(0x0u<<14)
#define	BSEC_OTPVLDR11_VLDF366_B_0X1	(0x1u<<14)
#define	BSEC_OTPVLDR11_VLDF365_B_0X0	(0x0u<<13)
#define	BSEC_OTPVLDR11_VLDF365_B_0X1	(0x1u<<13)
#define	BSEC_OTPVLDR11_VLDF364_B_0X0	(0x0u<<12)
#define	BSEC_OTPVLDR11_VLDF364_B_0X1	(0x1u<<12)
#define	BSEC_OTPVLDR11_VLDF363_B_0X0	(0x0u<<11)
#define	BSEC_OTPVLDR11_VLDF363_B_0X1	(0x1u<<11)
#define	BSEC_OTPVLDR11_VLDF362_B_0X0	(0x0u<<10)
#define	BSEC_OTPVLDR11_VLDF362_B_0X1	(0x1u<<10)
#define	BSEC_OTPVLDR11_VLDF361_B_0X0	(0x0u<<9)
#define	BSEC_OTPVLDR11_VLDF361_B_0X1	(0x1u<<9)
#define	BSEC_OTPVLDR11_VLDF360_B_0X0	(0x0u<<8)
#define	BSEC_OTPVLDR11_VLDF360_B_0X1	(0x1u<<8)
#define	BSEC_OTPVLDR11_VLDF359_B_0X0	(0x0u<<7)
#define	BSEC_OTPVLDR11_VLDF359_B_0X1	(0x1u<<7)
#define	BSEC_OTPVLDR11_VLDF358_B_0X0	(0x0u<<6)
#define	BSEC_OTPVLDR11_VLDF358_B_0X1	(0x1u<<6)
#define	BSEC_OTPVLDR11_VLDF357_B_0X0	(0x0u<<5)
#define	BSEC_OTPVLDR11_VLDF357_B_0X1	(0x1u<<5)
#define	BSEC_OTPVLDR11_VLDF356_B_0X0	(0x0u<<4)
#define	BSEC_OTPVLDR11_VLDF356_B_0X1	(0x1u<<4)
#define	BSEC_OTPVLDR11_VLDF355_B_0X0	(0x0u<<3)
#define	BSEC_OTPVLDR11_VLDF355_B_0X1	(0x1u<<3)
#define	BSEC_OTPVLDR11_VLDF354_B_0X0	(0x0u<<2)
#define	BSEC_OTPVLDR11_VLDF354_B_0X1	(0x1u<<2)
#define	BSEC_OTPVLDR11_VLDF353_B_0X0	(0x0u<<1)
#define	BSEC_OTPVLDR11_VLDF353_B_0X1	(0x1u<<1)
#define	BSEC_OTPVLDR11_VLDF352_B_0X0	(0x0u<<0)
#define	BSEC_OTPVLDR11_VLDF352_B_0X1	(0x1u<<0)

// SFSR0 Configuration

#define	BSEC_SFSR0_SFW31				(0x1u<<31)
#define	BSEC_SFSR0_SFW30				(0x1u<<30)
#define	BSEC_SFSR0_SFW29				(0x1u<<29)
#define	BSEC_SFSR0_SFW28				(0x1u<<28)
#define	BSEC_SFSR0_SFW27				(0x1u<<27)
#define	BSEC_SFSR0_SFW26				(0x1u<<26)
#define	BSEC_SFSR0_SFW25				(0x1u<<25)
#define	BSEC_SFSR0_SFW24				(0x1u<<24)
#define	BSEC_SFSR0_SFW23				(0x1u<<23)
#define	BSEC_SFSR0_SFW22				(0x1u<<22)
#define	BSEC_SFSR0_SFW21				(0x1u<<21)
#define	BSEC_SFSR0_SFW20				(0x1u<<20)
#define	BSEC_SFSR0_SFW19				(0x1u<<19)
#define	BSEC_SFSR0_SFW18				(0x1u<<18)
#define	BSEC_SFSR0_SFW17				(0x1u<<17)
#define	BSEC_SFSR0_SFW16				(0x1u<<16)
#define	BSEC_SFSR0_SFW15				(0x1u<<15)
#define	BSEC_SFSR0_SFW14				(0x1u<<14)
#define	BSEC_SFSR0_SFW13				(0x1u<<13)
#define	BSEC_SFSR0_SFW12				(0x1u<<12)
#define	BSEC_SFSR0_SFW11				(0x1u<<11)
#define	BSEC_SFSR0_SFW10				(0x1u<<10)
#define	BSEC_SFSR0_SFW9					(0x1u<<9)
#define	BSEC_SFSR0_SFW8					(0x1u<<8)
#define	BSEC_SFSR0_SFW7					(0x1u<<7)
#define	BSEC_SFSR0_SFW6					(0x1u<<6)
#define	BSEC_SFSR0_SFW5					(0x1u<<5)
#define	BSEC_SFSR0_SFW4					(0x1u<<4)
#define	BSEC_SFSR0_SFW3					(0x1u<<3)
#define	BSEC_SFSR0_SFW2					(0x1u<<2)
#define	BSEC_SFSR0_SFW1					(0x1u<<1)
#define	BSEC_SFSR0_SFW0					(0x1u<<0)

#define	BSEC_SFSR0_SFW31_B_0X0			(0x0u<<31)
#define	BSEC_SFSR0_SFW31_B_0X1			(0x1u<<31)
#define	BSEC_SFSR0_SFW30_B_0X0			(0x0u<<30)
#define	BSEC_SFSR0_SFW30_B_0X1			(0x1u<<30)
#define	BSEC_SFSR0_SFW29_B_0X0			(0x0u<<29)
#define	BSEC_SFSR0_SFW29_B_0X1			(0x1u<<29)
#define	BSEC_SFSR0_SFW28_B_0X0			(0x0u<<28)
#define	BSEC_SFSR0_SFW28_B_0X1			(0x1u<<28)
#define	BSEC_SFSR0_SFW27_B_0X0			(0x0u<<27)
#define	BSEC_SFSR0_SFW27_B_0X1			(0x1u<<27)
#define	BSEC_SFSR0_SFW26_B_0X0			(0x0u<<26)
#define	BSEC_SFSR0_SFW26_B_0X1			(0x1u<<26)
#define	BSEC_SFSR0_SFW25_B_0X0			(0x0u<<25)
#define	BSEC_SFSR0_SFW25_B_0X1			(0x1u<<25)
#define	BSEC_SFSR0_SFW24_B_0X0			(0x0u<<24)
#define	BSEC_SFSR0_SFW24_B_0X1			(0x1u<<24)
#define	BSEC_SFSR0_SFW23_B_0X0			(0x0u<<23)
#define	BSEC_SFSR0_SFW23_B_0X1			(0x1u<<23)
#define	BSEC_SFSR0_SFW22_B_0X0			(0x0u<<22)
#define	BSEC_SFSR0_SFW22_B_0X1			(0x1u<<22)
#define	BSEC_SFSR0_SFW21_B_0X0			(0x0u<<21)
#define	BSEC_SFSR0_SFW21_B_0X1			(0x1u<<21)
#define	BSEC_SFSR0_SFW20_B_0X0			(0x0u<<20)
#define	BSEC_SFSR0_SFW20_B_0X1			(0x1u<<20)
#define	BSEC_SFSR0_SFW19_B_0X0			(0x0u<<19)
#define	BSEC_SFSR0_SFW19_B_0X1			(0x1u<<19)
#define	BSEC_SFSR0_SFW18_B_0X0			(0x0u<<18)
#define	BSEC_SFSR0_SFW18_B_0X1			(0x1u<<18)
#define	BSEC_SFSR0_SFW17_B_0X0			(0x0u<<17)
#define	BSEC_SFSR0_SFW17_B_0X1			(0x1u<<17)
#define	BSEC_SFSR0_SFW16_B_0X0			(0x0u<<16)
#define	BSEC_SFSR0_SFW16_B_0X1			(0x1u<<16)
#define	BSEC_SFSR0_SFW15_B_0X0			(0x0u<<15)
#define	BSEC_SFSR0_SFW15_B_0X1			(0x1u<<15)
#define	BSEC_SFSR0_SFW14_B_0X0			(0x0u<<14)
#define	BSEC_SFSR0_SFW14_B_0X1			(0x1u<<14)
#define	BSEC_SFSR0_SFW13_B_0X0			(0x0u<<13)
#define	BSEC_SFSR0_SFW13_B_0X1			(0x1u<<13)
#define	BSEC_SFSR0_SFW12_B_0X0			(0x0u<<12)
#define	BSEC_SFSR0_SFW12_B_0X1			(0x1u<<12)
#define	BSEC_SFSR0_SFW11_B_0X0			(0x0u<<11)
#define	BSEC_SFSR0_SFW11_B_0X1			(0x1u<<11)
#define	BSEC_SFSR0_SFW10_B_0X0			(0x0u<<10)
#define	BSEC_SFSR0_SFW10_B_0X1			(0x1u<<10)
#define	BSEC_SFSR0_SFW9_B_0X0			(0x0u<<9)
#define	BSEC_SFSR0_SFW9_B_0X1			(0x1u<<9)
#define	BSEC_SFSR0_SFW8_B_0X0			(0x0u<<8)
#define	BSEC_SFSR0_SFW8_B_0X1			(0x1u<<8)
#define	BSEC_SFSR0_SFW7_B_0X0			(0x0u<<7)
#define	BSEC_SFSR0_SFW7_B_0X1			(0x1u<<7)
#define	BSEC_SFSR0_SFW6_B_0X0			(0x0u<<6)
#define	BSEC_SFSR0_SFW6_B_0X1			(0x1u<<6)
#define	BSEC_SFSR0_SFW5_B_0X0			(0x0u<<5)
#define	BSEC_SFSR0_SFW5_B_0X1			(0x1u<<5)
#define	BSEC_SFSR0_SFW4_B_0X0			(0x0u<<4)
#define	BSEC_SFSR0_SFW4_B_0X1			(0x1u<<4)
#define	BSEC_SFSR0_SFW3_B_0X0			(0x0u<<3)
#define	BSEC_SFSR0_SFW3_B_0X1			(0x1u<<3)
#define	BSEC_SFSR0_SFW2_B_0X0			(0x0u<<2)
#define	BSEC_SFSR0_SFW2_B_0X1			(0x1u<<2)
#define	BSEC_SFSR0_SFW1_B_0X0			(0x0u<<1)
#define	BSEC_SFSR0_SFW1_B_0X1			(0x1u<<1)
#define	BSEC_SFSR0_SFW0_B_0X0			(0x0u<<0)
#define	BSEC_SFSR0_SFW0_B_0X1			(0x1u<<0)

// SFSR1 Configuration

#define	BSEC_SFSR1_SFW63				(0x1u<<31)
#define	BSEC_SFSR1_SFW62				(0x1u<<30)
#define	BSEC_SFSR1_SFW61				(0x1u<<29)
#define	BSEC_SFSR1_SFW60				(0x1u<<28)
#define	BSEC_SFSR1_SFW59				(0x1u<<27)
#define	BSEC_SFSR1_SFW58				(0x1u<<26)
#define	BSEC_SFSR1_SFW57				(0x1u<<25)
#define	BSEC_SFSR1_SFW56				(0x1u<<24)
#define	BSEC_SFSR1_SFW55				(0x1u<<23)
#define	BSEC_SFSR1_SFW54				(0x1u<<22)
#define	BSEC_SFSR1_SFW53				(0x1u<<21)
#define	BSEC_SFSR1_SFW52				(0x1u<<20)
#define	BSEC_SFSR1_SFW51				(0x1u<<19)
#define	BSEC_SFSR1_SFW50				(0x1u<<18)
#define	BSEC_SFSR1_SFW49				(0x1u<<17)
#define	BSEC_SFSR1_SFW48				(0x1u<<16)
#define	BSEC_SFSR1_SFW47				(0x1u<<15)
#define	BSEC_SFSR1_SFW46				(0x1u<<14)
#define	BSEC_SFSR1_SFW45				(0x1u<<13)
#define	BSEC_SFSR1_SFW44				(0x1u<<12)
#define	BSEC_SFSR1_SFW43				(0x1u<<11)
#define	BSEC_SFSR1_SFW42				(0x1u<<10)
#define	BSEC_SFSR1_SFW41				(0x1u<<9)
#define	BSEC_SFSR1_SFW40				(0x1u<<8)
#define	BSEC_SFSR1_SFW39				(0x1u<<7)
#define	BSEC_SFSR1_SFW38				(0x1u<<6)
#define	BSEC_SFSR1_SFW37				(0x1u<<5)
#define	BSEC_SFSR1_SFW36				(0x1u<<4)
#define	BSEC_SFSR1_SFW35				(0x1u<<3)
#define	BSEC_SFSR1_SFW34				(0x1u<<2)
#define	BSEC_SFSR1_SFW33				(0x1u<<1)
#define	BSEC_SFSR1_SFW32				(0x1u<<0)

