hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SFSR1_SFW63_B_0X0			(0x0u<<31)
#define	BSEC_SFSR1_SFW63_B_0X1			(0x1u<<31)
#define	BSEC_SFSR1_SFW62_B_0X0			(0x0u<<30)
#define	BSEC_SFSR1_SFW62_B_0X1			(0x1u<<30)
#define	BSEC_SFSR1_SFW61_B_0X0			(0x0u<<29)
#define	BSEC_SFSR1_SFW61_B_0X1			(0x1u<<29)
#define	BSEC_SFSR1_SFW60_B_0X0			(0x0u<<28)
#define	BSEC_SFSR1_SFW60_B_0X1			(0x1u<<28)
#define	BSEC_SFSR1_SFW59_B_0X0			(0x0u<<27)
#define	BSEC_SFSR1_SFW59_B_0X1			(0x1u<<27)
#define	BSEC_SFSR1_SFW58_B_0X0			(0x0u<<26)
#define	BSEC_SFSR1_SFW58_B_0X1			(0x1u<<26)
#define	BSEC_SFSR1_SFW57_B_0X0			(0x0u<<25)
#define	BSEC_SFSR1_SFW57_B_0X1			(0x1u<<25)
#define	BSEC_SFSR1_SFW56_B_0X0			(0x0u<<24)
#define	BSEC_SFSR1_SFW56_B_0X1			(0x1u<<24)
#define	BSEC_SFSR1_SFW55_B_0X0			(0x0u<<23)
#define	BSEC_SFSR1_SFW55_B_0X1			(0x1u<<23)
#define	BSEC_SFSR1_SFW54_B_0X0			(0x0u<<22)
#define	BSEC_SFSR1_SFW54_B_0X1			(0x1u<<22)
#define	BSEC_SFSR1_SFW53_B_0X0			(0x0u<<21)
#define	BSEC_SFSR1_SFW53_B_0X1			(0x1u<<21)
#define	BSEC_SFSR1_SFW52_B_0X0			(0x0u<<20)
#define	BSEC_SFSR1_SFW52_B_0X1			(0x1u<<20)
#define	BSEC_SFSR1_SFW51_B_0X0			(0x0u<<19)
#define	BSEC_SFSR1_SFW51_B_0X1			(0x1u<<19)
#define	BSEC_SFSR1_SFW50_B_0X0			(0x0u<<18)
#define	BSEC_SFSR1_SFW50_B_0X1			(0x1u<<18)
#define	BSEC_SFSR1_SFW49_B_0X0			(0x0u<<17)
#define	BSEC_SFSR1_SFW49_B_0X1			(0x1u<<17)
#define	BSEC_SFSR1_SFW48_B_0X0			(0x0u<<16)
#define	BSEC_SFSR1_SFW48_B_0X1			(0x1u<<16)
#define	BSEC_SFSR1_SFW47_B_0X0			(0x0u<<15)
#define	BSEC_SFSR1_SFW47_B_0X1			(0x1u<<15)
#define	BSEC_SFSR1_SFW46_B_0X0			(0x0u<<14)
#define	BSEC_SFSR1_SFW46_B_0X1			(0x1u<<14)
#define	BSEC_SFSR1_SFW45_B_0X0			(0x0u<<13)
#define	BSEC_SFSR1_SFW45_B_0X1			(0x1u<<13)
#define	BSEC_SFSR1_SFW44_B_0X0			(0x0u<<12)
#define	BSEC_SFSR1_SFW44_B_0X1			(0x1u<<12)
#define	BSEC_SFSR1_SFW43_B_0X0			(0x0u<<11)
#define	BSEC_SFSR1_SFW43_B_0X1			(0x1u<<11)
#define	BSEC_SFSR1_SFW42_B_0X0			(0x0u<<10)
#define	BSEC_SFSR1_SFW42_B_0X1			(0x1u<<10)
#define	BSEC_SFSR1_SFW41_B_0X0			(0x0u<<9)
#define	BSEC_SFSR1_SFW41_B_0X1			(0x1u<<9)
#define	BSEC_SFSR1_SFW40_B_0X0			(0x0u<<8)
#define	BSEC_SFSR1_SFW40_B_0X1			(0x1u<<8)
#define	BSEC_SFSR1_SFW39_B_0X0			(0x0u<<7)
#define	BSEC_SFSR1_SFW39_B_0X1			(0x1u<<7)
#define	BSEC_SFSR1_SFW38_B_0X0			(0x0u<<6)
#define	BSEC_SFSR1_SFW38_B_0X1			(0x1u<<6)
#define	BSEC_SFSR1_SFW37_B_0X0			(0x0u<<5)
#define	BSEC_SFSR1_SFW37_B_0X1			(0x1u<<5)
#define	BSEC_SFSR1_SFW36_B_0X0			(0x0u<<4)
#define	BSEC_SFSR1_SFW36_B_0X1			(0x1u<<4)
#define	BSEC_SFSR1_SFW35_B_0X0			(0x0u<<3)
#define	BSEC_SFSR1_SFW35_B_0X1			(0x1u<<3)
#define	BSEC_SFSR1_SFW34_B_0X0			(0x0u<<2)
#define	BSEC_SFSR1_SFW34_B_0X1			(0x1u<<2)
#define	BSEC_SFSR1_SFW33_B_0X0			(0x0u<<1)
#define	BSEC_SFSR1_SFW33_B_0X1			(0x1u<<1)
#define	BSEC_SFSR1_SFW32_B_0X0			(0x0u<<0)
#define	BSEC_SFSR1_SFW32_B_0X1			(0x1u<<0)

// SFSR2 Configuration

#define	BSEC_SFSR2_SFW95				(0x1u<<31)
#define	BSEC_SFSR2_SFW94				(0x1u<<30)
#define	BSEC_SFSR2_SFW93				(0x1u<<29)
#define	BSEC_SFSR2_SFW92				(0x1u<<28)
#define	BSEC_SFSR2_SFW91				(0x1u<<27)
#define	BSEC_SFSR2_SFW90				(0x1u<<26)
#define	BSEC_SFSR2_SFW89				(0x1u<<25)
#define	BSEC_SFSR2_SFW88				(0x1u<<24)
#define	BSEC_SFSR2_SFW87				(0x1u<<23)
#define	BSEC_SFSR2_SFW86				(0x1u<<22)
#define	BSEC_SFSR2_SFW85				(0x1u<<21)
#define	BSEC_SFSR2_SFW84				(0x1u<<20)
#define	BSEC_SFSR2_SFW83				(0x1u<<19)
#define	BSEC_SFSR2_SFW82				(0x1u<<18)
#define	BSEC_SFSR2_SFW81				(0x1u<<17)
#define	BSEC_SFSR2_SFW80				(0x1u<<16)
#define	BSEC_SFSR2_SFW79				(0x1u<<15)
#define	BSEC_SFSR2_SFW78				(0x1u<<14)
#define	BSEC_SFSR2_SFW77				(0x1u<<13)
#define	BSEC_SFSR2_SFW76				(0x1u<<12)
#define	BSEC_SFSR2_SFW75				(0x1u<<11)
#define	BSEC_SFSR2_SFW74				(0x1u<<10)
#define	BSEC_SFSR2_SFW73				(0x1u<<9)
#define	BSEC_SFSR2_SFW72				(0x1u<<8)
#define	BSEC_SFSR2_SFW71				(0x1u<<7)
#define	BSEC_SFSR2_SFW70				(0x1u<<6)
#define	BSEC_SFSR2_SFW69				(0x1u<<5)
#define	BSEC_SFSR2_SFW68				(0x1u<<4)
#define	BSEC_SFSR2_SFW67				(0x1u<<3)
#define	BSEC_SFSR2_SFW66				(0x1u<<2)
#define	BSEC_SFSR2_SFW65				(0x1u<<1)
#define	BSEC_SFSR2_SFW64				(0x1u<<0)

#define	BSEC_SFSR2_SFW95_B_0X0			(0x0u<<31)
#define	BSEC_SFSR2_SFW95_B_0X1			(0x1u<<31)
#define	BSEC_SFSR2_SFW94_B_0X0			(0x0u<<30)
#define	BSEC_SFSR2_SFW94_B_0X1			(0x1u<<30)
#define	BSEC_SFSR2_SFW93_B_0X0			(0x0u<<29)
#define	BSEC_SFSR2_SFW93_B_0X1			(0x1u<<29)
#define	BSEC_SFSR2_SFW92_B_0X0			(0x0u<<28)
#define	BSEC_SFSR2_SFW92_B_0X1			(0x1u<<28)
#define	BSEC_SFSR2_SFW91_B_0X0			(0x0u<<27)
#define	BSEC_SFSR2_SFW91_B_0X1			(0x1u<<27)
#define	BSEC_SFSR2_SFW90_B_0X0			(0x0u<<26)
#define	BSEC_SFSR2_SFW90_B_0X1			(0x1u<<26)
#define	BSEC_SFSR2_SFW89_B_0X0			(0x0u<<25)
#define	BSEC_SFSR2_SFW89_B_0X1			(0x1u<<25)
#define	BSEC_SFSR2_SFW88_B_0X0			(0x0u<<24)
#define	BSEC_SFSR2_SFW88_B_0X1			(0x1u<<24)
#define	BSEC_SFSR2_SFW87_B_0X0			(0x0u<<23)
#define	BSEC_SFSR2_SFW87_B_0X1			(0x1u<<23)
#define	BSEC_SFSR2_SFW86_B_0X0			(0x0u<<22)
#define	BSEC_SFSR2_SFW86_B_0X1			(0x1u<<22)
#define	BSEC_SFSR2_SFW85_B_0X0			(0x0u<<21)
#define	BSEC_SFSR2_SFW85_B_0X1			(0x1u<<21)
#define	BSEC_SFSR2_SFW84_B_0X0			(0x0u<<20)
#define	BSEC_SFSR2_SFW84_B_0X1			(0x1u<<20)
#define	BSEC_SFSR2_SFW83_B_0X0			(0x0u<<19)
#define	BSEC_SFSR2_SFW83_B_0X1			(0x1u<<19)
#define	BSEC_SFSR2_SFW82_B_0X0			(0x0u<<18)
#define	BSEC_SFSR2_SFW82_B_0X1			(0x1u<<18)
#define	BSEC_SFSR2_SFW81_B_0X0			(0x0u<<17)
#define	BSEC_SFSR2_SFW81_B_0X1			(0x1u<<17)
#define	BSEC_SFSR2_SFW80_B_0X0			(0x0u<<16)
#define	BSEC_SFSR2_SFW80_B_0X1			(0x1u<<16)
#define	BSEC_SFSR2_SFW79_B_0X0			(0x0u<<15)
#define	BSEC_SFSR2_SFW79_B_0X1			(0x1u<<15)
#define	BSEC_SFSR2_SFW78_B_0X0			(0x0u<<14)
#define	BSEC_SFSR2_SFW78_B_0X1			(0x1u<<14)
#define	BSEC_SFSR2_SFW77_B_0X0			(0x0u<<13)
#define	BSEC_SFSR2_SFW77_B_0X1			(0x1u<<13)
#define	BSEC_SFSR2_SFW76_B_0X0			(0x0u<<12)
#define	BSEC_SFSR2_SFW76_B_0X1			(0x1u<<12)
#define	BSEC_SFSR2_SFW75_B_0X0			(0x0u<<11)
#define	BSEC_SFSR2_SFW75_B_0X1			(0x1u<<11)
#define	BSEC_SFSR2_SFW74_B_0X0			(0x0u<<10)
#define	BSEC_SFSR2_SFW74_B_0X1			(0x1u<<10)
#define	BSEC_SFSR2_SFW73_B_0X0			(0x0u<<9)
#define	BSEC_SFSR2_SFW73_B_0X1			(0x1u<<9)
#define	BSEC_SFSR2_SFW72_B_0X0			(0x0u<<8)
#define	BSEC_SFSR2_SFW72_B_0X1			(0x1u<<8)
#define	BSEC_SFSR2_SFW71_B_0X0			(0x0u<<7)
#define	BSEC_SFSR2_SFW71_B_0X1			(0x1u<<7)
#define	BSEC_SFSR2_SFW70_B_0X0			(0x0u<<6)
#define	BSEC_SFSR2_SFW70_B_0X1			(0x1u<<6)
#define	BSEC_SFSR2_SFW69_B_0X0			(0x0u<<5)
#define	BSEC_SFSR2_SFW69_B_0X1			(0x1u<<5)
#define	BSEC_SFSR2_SFW68_B_0X0			(0x0u<<4)
#define	BSEC_SFSR2_SFW68_B_0X1			(0x1u<<4)
#define	BSEC_SFSR2_SFW67_B_0X0			(0x0u<<3)
#define	BSEC_SFSR2_SFW67_B_0X1			(0x1u<<3)
#define	BSEC_SFSR2_SFW66_B_0X0			(0x0u<<2)
#define	BSEC_SFSR2_SFW66_B_0X1			(0x1u<<2)
#define	BSEC_SFSR2_SFW65_B_0X0			(0x0u<<1)
#define	BSEC_SFSR2_SFW65_B_0X1			(0x1u<<1)
#define	BSEC_SFSR2_SFW64_B_0X0			(0x0u<<0)
#define	BSEC_SFSR2_SFW64_B_0X1			(0x1u<<0)

// SFSR3 Configuration

#define	BSEC_SFSR3_SFW127				(0x1u<<31)
#define	BSEC_SFSR3_SFW126				(0x1u<<30)
#define	BSEC_SFSR3_SFW125				(0x1u<<29)
#define	BSEC_SFSR3_SFW124				(0x1u<<28)
#define	BSEC_SFSR3_SFW123				(0x1u<<27)
#define	BSEC_SFSR3_SFW122				(0x1u<<26)
#define	BSEC_SFSR3_SFW121				(0x1u<<25)
#define	BSEC_SFSR3_SFW120				(0x1u<<24)
#define	BSEC_SFSR3_SFW119				(0x1u<<23)
#define	BSEC_SFSR3_SFW118				(0x1u<<22)
#define	BSEC_SFSR3_SFW117				(0x1u<<21)
#define	BSEC_SFSR3_SFW116				(0x1u<<20)
#define	BSEC_SFSR3_SFW115				(0x1u<<19)
#define	BSEC_SFSR3_SFW114				(0x1u<<18)
#define	BSEC_SFSR3_SFW113				(0x1u<<17)
#define	BSEC_SFSR3_SFW112				(0x1u<<16)
#define	BSEC_SFSR3_SFW111				(0x1u<<15)
#define	BSEC_SFSR3_SFW110				(0x1u<<14)
#define	BSEC_SFSR3_SFW109				(0x1u<<13)
#define	BSEC_SFSR3_SFW108				(0x1u<<12)
#define	BSEC_SFSR3_SFW107				(0x1u<<11)
#define	BSEC_SFSR3_SFW106				(0x1u<<10)
#define	BSEC_SFSR3_SFW105				(0x1u<<9)
#define	BSEC_SFSR3_SFW104				(0x1u<<8)
#define	BSEC_SFSR3_SFW103				(0x1u<<7)
#define	BSEC_SFSR3_SFW102				(0x1u<<6)
#define	BSEC_SFSR3_SFW101				(0x1u<<5)
#define	BSEC_SFSR3_SFW100				(0x1u<<4)
#define	BSEC_SFSR3_SFW99				(0x1u<<3)
#define	BSEC_SFSR3_SFW98				(0x1u<<2)
#define	BSEC_SFSR3_SFW97				(0x1u<<1)
#define	BSEC_SFSR3_SFW96				(0x1u<<0)

