hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
#define	BSEC_SFSR3_SFW127_B_0X0			(0x0u<<31)
#define	BSEC_SFSR3_SFW127_B_0X1			(0x1u<<31)
#define	BSEC_SFSR3_SFW126_B_0X0			(0x0u<<30)
#define	BSEC_SFSR3_SFW126_B_0X1			(0x1u<<30)
#define	BSEC_SFSR3_SFW125_B_0X0			(0x0u<<29)
#define	BSEC_SFSR3_SFW125_B_0X1			(0x1u<<29)
#define	BSEC_SFSR3_SFW124_B_0X0			(0x0u<<28)
#define	BSEC_SFSR3_SFW124_B_0X1			(0x1u<<28)
#define	BSEC_SFSR3_SFW123_B_0X0			(0x0u<<27)
#define	BSEC_SFSR3_SFW123_B_0X1			(0x1u<<27)
#define	BSEC_SFSR3_SFW122_B_0X0			(0x0u<<26)
#define	BSEC_SFSR3_SFW122_B_0X1			(0x1u<<26)
#define	BSEC_SFSR3_SFW121_B_0X0			(0x0u<<25)
#define	BSEC_SFSR3_SFW121_B_0X1			(0x1u<<25)
#define	BSEC_SFSR3_SFW120_B_0X0			(0x0u<<24)
#define	BSEC_SFSR3_SFW120_B_0X1			(0x1u<<24)
#define	BSEC_SFSR3_SFW119_B_0X0			(0x0u<<23)
#define	BSEC_SFSR3_SFW119_B_0X1			(0x1u<<23)
#define	BSEC_SFSR3_SFW118_B_0X0			(0x0u<<22)
#define	BSEC_SFSR3_SFW118_B_0X1			(0x1u<<22)
#define	BSEC_SFSR3_SFW117_B_0X0			(0x0u<<21)
#define	BSEC_SFSR3_SFW117_B_0X1			(0x1u<<21)
#define	BSEC_SFSR3_SFW116_B_0X0			(0x0u<<20)
#define	BSEC_SFSR3_SFW116_B_0X1			(0x1u<<20)
#define	BSEC_SFSR3_SFW115_B_0X0			(0x0u<<19)
#define	BSEC_SFSR3_SFW115_B_0X1			(0x1u<<19)
#define	BSEC_SFSR3_SFW114_B_0X0			(0x0u<<18)
#define	BSEC_SFSR3_SFW114_B_0X1			(0x1u<<18)
#define	BSEC_SFSR3_SFW113_B_0X0			(0x0u<<17)
#define	BSEC_SFSR3_SFW113_B_0X1			(0x1u<<17)
#define	BSEC_SFSR3_SFW112_B_0X0			(0x0u<<16)
#define	BSEC_SFSR3_SFW112_B_0X1			(0x1u<<16)
#define	BSEC_SFSR3_SFW111_B_0X0			(0x0u<<15)
#define	BSEC_SFSR3_SFW111_B_0X1			(0x1u<<15)
#define	BSEC_SFSR3_SFW110_B_0X0			(0x0u<<14)
#define	BSEC_SFSR3_SFW110_B_0X1			(0x1u<<14)
#define	BSEC_SFSR3_SFW109_B_0X0			(0x0u<<13)
#define	BSEC_SFSR3_SFW109_B_0X1			(0x1u<<13)
#define	BSEC_SFSR3_SFW108_B_0X0			(0x0u<<12)
#define	BSEC_SFSR3_SFW108_B_0X1			(0x1u<<12)
#define	BSEC_SFSR3_SFW107_B_0X0			(0x0u<<11)
#define	BSEC_SFSR3_SFW107_B_0X1			(0x1u<<11)
#define	BSEC_SFSR3_SFW106_B_0X0			(0x0u<<10)
#define	BSEC_SFSR3_SFW106_B_0X1			(0x1u<<10)
#define	BSEC_SFSR3_SFW105_B_0X0			(0x0u<<9)
#define	BSEC_SFSR3_SFW105_B_0X1			(0x1u<<9)
#define	BSEC_SFSR3_SFW104_B_0X0			(0x0u<<8)
#define	BSEC_SFSR3_SFW104_B_0X1			(0x1u<<8)
#define	BSEC_SFSR3_SFW103_B_0X0			(0x0u<<7)
#define	BSEC_SFSR3_SFW103_B_0X1			(0x1u<<7)
#define	BSEC_SFSR3_SFW102_B_0X0			(0x0u<<6)
#define	BSEC_SFSR3_SFW102_B_0X1			(0x1u<<6)
#define	BSEC_SFSR3_SFW101_B_0X0			(0x0u<<5)
#define	BSEC_SFSR3_SFW101_B_0X1			(0x1u<<5)
#define	BSEC_SFSR3_SFW100_B_0X0			(0x0u<<4)
#define	BSEC_SFSR3_SFW100_B_0X1			(0x1u<<4)
#define	BSEC_SFSR3_SFW99_B_0X0			(0x0u<<3)
#define	BSEC_SFSR3_SFW99_B_0X1			(0x1u<<3)
#define	BSEC_SFSR3_SFW98_B_0X0			(0x0u<<2)
#define	BSEC_SFSR3_SFW98_B_0X1			(0x1u<<2)
#define	BSEC_SFSR3_SFW97_B_0X0			(0x0u<<1)
#define	BSEC_SFSR3_SFW97_B_0X1			(0x1u<<1)
#define	BSEC_SFSR3_SFW96_B_0X0			(0x0u<<0)
#define	BSEC_SFSR3_SFW96_B_0X1			(0x1u<<0)

// SFSR4 Configuration

#define	BSEC_SFSR4_SFW159				(0x1u<<31)
#define	BSEC_SFSR4_SFW158				(0x1u<<30)
#define	BSEC_SFSR4_SFW157				(0x1u<<29)
#define	BSEC_SFSR4_SFW156				(0x1u<<28)
#define	BSEC_SFSR4_SFW155				(0x1u<<27)
#define	BSEC_SFSR4_SFW154				(0x1u<<26)
#define	BSEC_SFSR4_SFW153				(0x1u<<25)
#define	BSEC_SFSR4_SFW152				(0x1u<<24)
#define	BSEC_SFSR4_SFW151				(0x1u<<23)
#define	BSEC_SFSR4_SFW150				(0x1u<<22)
#define	BSEC_SFSR4_SFW149				(0x1u<<21)
#define	BSEC_SFSR4_SFW148				(0x1u<<20)
#define	BSEC_SFSR4_SFW147				(0x1u<<19)
#define	BSEC_SFSR4_SFW146				(0x1u<<18)
#define	BSEC_SFSR4_SFW145				(0x1u<<17)
#define	BSEC_SFSR4_SFW144				(0x1u<<16)
#define	BSEC_SFSR4_SFW143				(0x1u<<15)
#define	BSEC_SFSR4_SFW142				(0x1u<<14)
#define	BSEC_SFSR4_SFW141				(0x1u<<13)
#define	BSEC_SFSR4_SFW140				(0x1u<<12)
#define	BSEC_SFSR4_SFW139				(0x1u<<11)
#define	BSEC_SFSR4_SFW138				(0x1u<<10)
#define	BSEC_SFSR4_SFW137				(0x1u<<9)
#define	BSEC_SFSR4_SFW136				(0x1u<<8)
#define	BSEC_SFSR4_SFW135				(0x1u<<7)
#define	BSEC_SFSR4_SFW134				(0x1u<<6)
#define	BSEC_SFSR4_SFW133				(0x1u<<5)
#define	BSEC_SFSR4_SFW132				(0x1u<<4)
#define	BSEC_SFSR4_SFW131				(0x1u<<3)
#define	BSEC_SFSR4_SFW130				(0x1u<<2)
#define	BSEC_SFSR4_SFW129				(0x1u<<1)
#define	BSEC_SFSR4_SFW128				(0x1u<<0)

#define	BSEC_SFSR4_SFW159_B_0X0			(0x0u<<31)
#define	BSEC_SFSR4_SFW159_B_0X1			(0x1u<<31)
#define	BSEC_SFSR4_SFW158_B_0X0			(0x0u<<30)
#define	BSEC_SFSR4_SFW158_B_0X1			(0x1u<<30)
#define	BSEC_SFSR4_SFW157_B_0X0			(0x0u<<29)
#define	BSEC_SFSR4_SFW157_B_0X1			(0x1u<<29)
#define	BSEC_SFSR4_SFW156_B_0X0			(0x0u<<28)
#define	BSEC_SFSR4_SFW156_B_0X1			(0x1u<<28)
#define	BSEC_SFSR4_SFW155_B_0X0			(0x0u<<27)
#define	BSEC_SFSR4_SFW155_B_0X1			(0x1u<<27)
#define	BSEC_SFSR4_SFW154_B_0X0			(0x0u<<26)
#define	BSEC_SFSR4_SFW154_B_0X1			(0x1u<<26)
#define	BSEC_SFSR4_SFW153_B_0X0			(0x0u<<25)
#define	BSEC_SFSR4_SFW153_B_0X1			(0x1u<<25)
#define	BSEC_SFSR4_SFW152_B_0X0			(0x0u<<24)
#define	BSEC_SFSR4_SFW152_B_0X1			(0x1u<<24)
#define	BSEC_SFSR4_SFW151_B_0X0			(0x0u<<23)
#define	BSEC_SFSR4_SFW151_B_0X1			(0x1u<<23)
#define	BSEC_SFSR4_SFW150_B_0X0			(0x0u<<22)
#define	BSEC_SFSR4_SFW150_B_0X1			(0x1u<<22)
#define	BSEC_SFSR4_SFW149_B_0X0			(0x0u<<21)
#define	BSEC_SFSR4_SFW149_B_0X1			(0x1u<<21)
#define	BSEC_SFSR4_SFW148_B_0X0			(0x0u<<20)
#define	BSEC_SFSR4_SFW148_B_0X1			(0x1u<<20)
#define	BSEC_SFSR4_SFW147_B_0X0			(0x0u<<19)
#define	BSEC_SFSR4_SFW147_B_0X1			(0x1u<<19)
#define	BSEC_SFSR4_SFW146_B_0X0			(0x0u<<18)
#define	BSEC_SFSR4_SFW146_B_0X1			(0x1u<<18)
#define	BSEC_SFSR4_SFW145_B_0X0			(0x0u<<17)
#define	BSEC_SFSR4_SFW145_B_0X1			(0x1u<<17)
#define	BSEC_SFSR4_SFW144_B_0X0			(0x0u<<16)
#define	BSEC_SFSR4_SFW144_B_0X1			(0x1u<<16)
#define	BSEC_SFSR4_SFW143_B_0X0			(0x0u<<15)
#define	BSEC_SFSR4_SFW143_B_0X1			(0x1u<<15)
#define	BSEC_SFSR4_SFW142_B_0X0			(0x0u<<14)
#define	BSEC_SFSR4_SFW142_B_0X1			(0x1u<<14)
#define	BSEC_SFSR4_SFW141_B_0X0			(0x0u<<13)
#define	BSEC_SFSR4_SFW141_B_0X1			(0x1u<<13)
#define	BSEC_SFSR4_SFW140_B_0X0			(0x0u<<12)
#define	BSEC_SFSR4_SFW140_B_0X1			(0x1u<<12)
#define	BSEC_SFSR4_SFW139_B_0X0			(0x0u<<11)
#define	BSEC_SFSR4_SFW139_B_0X1			(0x1u<<11)
#define	BSEC_SFSR4_SFW138_B_0X0			(0x0u<<10)
#define	BSEC_SFSR4_SFW138_B_0X1			(0x1u<<10)
#define	BSEC_SFSR4_SFW137_B_0X0			(0x0u<<9)
#define	BSEC_SFSR4_SFW137_B_0X1			(0x1u<<9)
#define	BSEC_SFSR4_SFW136_B_0X0			(0x0u<<8)
#define	BSEC_SFSR4_SFW136_B_0X1			(0x1u<<8)
#define	BSEC_SFSR4_SFW135_B_0X0			(0x0u<<7)
#define	BSEC_SFSR4_SFW135_B_0X1			(0x1u<<7)
#define	BSEC_SFSR4_SFW134_B_0X0			(0x0u<<6)
#define	BSEC_SFSR4_SFW134_B_0X1			(0x1u<<6)
#define	BSEC_SFSR4_SFW133_B_0X0			(0x0u<<5)
#define	BSEC_SFSR4_SFW133_B_0X1			(0x1u<<5)
#define	BSEC_SFSR4_SFW132_B_0X0			(0x0u<<4)
#define	BSEC_SFSR4_SFW132_B_0X1			(0x1u<<4)
#define	BSEC_SFSR4_SFW131_B_0X0			(0x0u<<3)
#define	BSEC_SFSR4_SFW131_B_0X1			(0x1u<<3)
#define	BSEC_SFSR4_SFW130_B_0X0			(0x0u<<2)
#define	BSEC_SFSR4_SFW130_B_0X1			(0x1u<<2)
#define	BSEC_SFSR4_SFW129_B_0X0			(0x0u<<1)
#define	BSEC_SFSR4_SFW129_B_0X1			(0x1u<<1)
#define	BSEC_SFSR4_SFW128_B_0X0			(0x0u<<0)
#define	BSEC_SFSR4_SFW128_B_0X1			(0x1u<<0)

