hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SFSR5 Configuration

#define	BSEC_SFSR5_SFW191				(0x1u<<31)
#define	BSEC_SFSR5_SFW190				(0x1u<<30)
#define	BSEC_SFSR5_SFW189				(0x1u<<29)
#define	BSEC_SFSR5_SFW188				(0x1u<<28)
#define	BSEC_SFSR5_SFW187				(0x1u<<27)
#define	BSEC_SFSR5_SFW186				(0x1u<<26)
#define	BSEC_SFSR5_SFW185				(0x1u<<25)
#define	BSEC_SFSR5_SFW184				(0x1u<<24)
#define	BSEC_SFSR5_SFW183				(0x1u<<23)
#define	BSEC_SFSR5_SFW182				(0x1u<<22)
#define	BSEC_SFSR5_SFW181				(0x1u<<21)
#define	BSEC_SFSR5_SFW180				(0x1u<<20)
#define	BSEC_SFSR5_SFW179				(0x1u<<19)
#define	BSEC_SFSR5_SFW178				(0x1u<<18)
#define	BSEC_SFSR5_SFW177				(0x1u<<17)
#define	BSEC_SFSR5_SFW176				(0x1u<<16)
#define	BSEC_SFSR5_SFW175				(0x1u<<15)
#define	BSEC_SFSR5_SFW174				(0x1u<<14)
#define	BSEC_SFSR5_SFW173				(0x1u<<13)
#define	BSEC_SFSR5_SFW172				(0x1u<<12)
#define	BSEC_SFSR5_SFW171				(0x1u<<11)
#define	BSEC_SFSR5_SFW170				(0x1u<<10)
#define	BSEC_SFSR5_SFW169				(0x1u<<9)
#define	BSEC_SFSR5_SFW168				(0x1u<<8)
#define	BSEC_SFSR5_SFW167				(0x1u<<7)
#define	BSEC_SFSR5_SFW166				(0x1u<<6)
#define	BSEC_SFSR5_SFW165				(0x1u<<5)
#define	BSEC_SFSR5_SFW164				(0x1u<<4)
#define	BSEC_SFSR5_SFW163				(0x1u<<3)
#define	BSEC_SFSR5_SFW162				(0x1u<<2)
#define	BSEC_SFSR5_SFW161				(0x1u<<1)
#define	BSEC_SFSR5_SFW160				(0x1u<<0)

#define	BSEC_SFSR5_SFW191_B_0X0			(0x0u<<31)
#define	BSEC_SFSR5_SFW191_B_0X1			(0x1u<<31)
#define	BSEC_SFSR5_SFW190_B_0X0			(0x0u<<30)
#define	BSEC_SFSR5_SFW190_B_0X1			(0x1u<<30)
#define	BSEC_SFSR5_SFW189_B_0X0			(0x0u<<29)
#define	BSEC_SFSR5_SFW189_B_0X1			(0x1u<<29)
#define	BSEC_SFSR5_SFW188_B_0X0			(0x0u<<28)
#define	BSEC_SFSR5_SFW188_B_0X1			(0x1u<<28)
#define	BSEC_SFSR5_SFW187_B_0X0			(0x0u<<27)
#define	BSEC_SFSR5_SFW187_B_0X1			(0x1u<<27)
#define	BSEC_SFSR5_SFW186_B_0X0			(0x0u<<26)
#define	BSEC_SFSR5_SFW186_B_0X1			(0x1u<<26)
#define	BSEC_SFSR5_SFW185_B_0X0			(0x0u<<25)
#define	BSEC_SFSR5_SFW185_B_0X1			(0x1u<<25)
#define	BSEC_SFSR5_SFW184_B_0X0			(0x0u<<24)
#define	BSEC_SFSR5_SFW184_B_0X1			(0x1u<<24)
#define	BSEC_SFSR5_SFW183_B_0X0			(0x0u<<23)
#define	BSEC_SFSR5_SFW183_B_0X1			(0x1u<<23)
#define	BSEC_SFSR5_SFW182_B_0X0			(0x0u<<22)
#define	BSEC_SFSR5_SFW182_B_0X1			(0x1u<<22)
#define	BSEC_SFSR5_SFW181_B_0X0			(0x0u<<21)
#define	BSEC_SFSR5_SFW181_B_0X1			(0x1u<<21)
#define	BSEC_SFSR5_SFW180_B_0X0			(0x0u<<20)
#define	BSEC_SFSR5_SFW180_B_0X1			(0x1u<<20)
#define	BSEC_SFSR5_SFW179_B_0X0			(0x0u<<19)
#define	BSEC_SFSR5_SFW179_B_0X1			(0x1u<<19)
#define	BSEC_SFSR5_SFW178_B_0X0			(0x0u<<18)
#define	BSEC_SFSR5_SFW178_B_0X1			(0x1u<<18)
#define	BSEC_SFSR5_SFW177_B_0X0			(0x0u<<17)
#define	BSEC_SFSR5_SFW177_B_0X1			(0x1u<<17)
#define	BSEC_SFSR5_SFW176_B_0X0			(0x0u<<16)
#define	BSEC_SFSR5_SFW176_B_0X1			(0x1u<<16)
#define	BSEC_SFSR5_SFW175_B_0X0			(0x0u<<15)
#define	BSEC_SFSR5_SFW175_B_0X1			(0x1u<<15)
#define	BSEC_SFSR5_SFW174_B_0X0			(0x0u<<14)
#define	BSEC_SFSR5_SFW174_B_0X1			(0x1u<<14)
#define	BSEC_SFSR5_SFW173_B_0X0			(0x0u<<13)
#define	BSEC_SFSR5_SFW173_B_0X1			(0x1u<<13)
#define	BSEC_SFSR5_SFW172_B_0X0			(0x0u<<12)
#define	BSEC_SFSR5_SFW172_B_0X1			(0x1u<<12)
#define	BSEC_SFSR5_SFW171_B_0X0			(0x0u<<11)
#define	BSEC_SFSR5_SFW171_B_0X1			(0x1u<<11)
#define	BSEC_SFSR5_SFW170_B_0X0			(0x0u<<10)
#define	BSEC_SFSR5_SFW170_B_0X1			(0x1u<<10)
#define	BSEC_SFSR5_SFW169_B_0X0			(0x0u<<9)
#define	BSEC_SFSR5_SFW169_B_0X1			(0x1u<<9)
#define	BSEC_SFSR5_SFW168_B_0X0			(0x0u<<8)
#define	BSEC_SFSR5_SFW168_B_0X1			(0x1u<<8)
#define	BSEC_SFSR5_SFW167_B_0X0			(0x0u<<7)
#define	BSEC_SFSR5_SFW167_B_0X1			(0x1u<<7)
#define	BSEC_SFSR5_SFW166_B_0X0			(0x0u<<6)
#define	BSEC_SFSR5_SFW166_B_0X1			(0x1u<<6)
#define	BSEC_SFSR5_SFW165_B_0X0			(0x0u<<5)
#define	BSEC_SFSR5_SFW165_B_0X1			(0x1u<<5)
#define	BSEC_SFSR5_SFW164_B_0X0			(0x0u<<4)
#define	BSEC_SFSR5_SFW164_B_0X1			(0x1u<<4)
#define	BSEC_SFSR5_SFW163_B_0X0			(0x0u<<3)
#define	BSEC_SFSR5_SFW163_B_0X1			(0x1u<<3)
#define	BSEC_SFSR5_SFW162_B_0X0			(0x0u<<2)
#define	BSEC_SFSR5_SFW162_B_0X1			(0x1u<<2)
#define	BSEC_SFSR5_SFW161_B_0X0			(0x0u<<1)
#define	BSEC_SFSR5_SFW161_B_0X1			(0x1u<<1)
#define	BSEC_SFSR5_SFW160_B_0X0			(0x0u<<0)
#define	BSEC_SFSR5_SFW160_B_0X1			(0x1u<<0)

// SFSR6 Configuration

#define	BSEC_SFSR6_SFW223				(0x1u<<31)
#define	BSEC_SFSR6_SFW222				(0x1u<<30)
#define	BSEC_SFSR6_SFW221				(0x1u<<29)
#define	BSEC_SFSR6_SFW220				(0x1u<<28)
#define	BSEC_SFSR6_SFW219				(0x1u<<27)
#define	BSEC_SFSR6_SFW218				(0x1u<<26)
#define	BSEC_SFSR6_SFW217				(0x1u<<25)
#define	BSEC_SFSR6_SFW216				(0x1u<<24)
#define	BSEC_SFSR6_SFW215				(0x1u<<23)
#define	BSEC_SFSR6_SFW214				(0x1u<<22)
#define	BSEC_SFSR6_SFW213				(0x1u<<21)
#define	BSEC_SFSR6_SFW212				(0x1u<<20)
#define	BSEC_SFSR6_SFW211				(0x1u<<19)
#define	BSEC_SFSR6_SFW210				(0x1u<<18)
#define	BSEC_SFSR6_SFW209				(0x1u<<17)
#define	BSEC_SFSR6_SFW208				(0x1u<<16)
#define	BSEC_SFSR6_SFW207				(0x1u<<15)
#define	BSEC_SFSR6_SFW206				(0x1u<<14)
#define	BSEC_SFSR6_SFW205				(0x1u<<13)
#define	BSEC_SFSR6_SFW204				(0x1u<<12)
#define	BSEC_SFSR6_SFW203				(0x1u<<11)
#define	BSEC_SFSR6_SFW202				(0x1u<<10)
#define	BSEC_SFSR6_SFW201				(0x1u<<9)
#define	BSEC_SFSR6_SFW200				(0x1u<<8)
#define	BSEC_SFSR6_SFW199				(0x1u<<7)
#define	BSEC_SFSR6_SFW198				(0x1u<<6)
#define	BSEC_SFSR6_SFW197				(0x1u<<5)
#define	BSEC_SFSR6_SFW196				(0x1u<<4)
#define	BSEC_SFSR6_SFW195				(0x1u<<3)
#define	BSEC_SFSR6_SFW194				(0x1u<<2)
#define	BSEC_SFSR6_SFW193				(0x1u<<1)
#define	BSEC_SFSR6_SFW192				(0x1u<<0)

#define	BSEC_SFSR6_SFW223_B_0X0			(0x0u<<31)
#define	BSEC_SFSR6_SFW223_B_0X1			(0x1u<<31)
#define	BSEC_SFSR6_SFW222_B_0X0			(0x0u<<30)
#define	BSEC_SFSR6_SFW222_B_0X1			(0x1u<<30)
#define	BSEC_SFSR6_SFW221_B_0X0			(0x0u<<29)
#define	BSEC_SFSR6_SFW221_B_0X1			(0x1u<<29)
#define	BSEC_SFSR6_SFW220_B_0X0			(0x0u<<28)
#define	BSEC_SFSR6_SFW220_B_0X1			(0x1u<<28)
#define	BSEC_SFSR6_SFW219_B_0X0			(0x0u<<27)
#define	BSEC_SFSR6_SFW219_B_0X1			(0x1u<<27)
#define	BSEC_SFSR6_SFW218_B_0X0			(0x0u<<26)
#define	BSEC_SFSR6_SFW218_B_0X1			(0x1u<<26)
#define	BSEC_SFSR6_SFW217_B_0X0			(0x0u<<25)
#define	BSEC_SFSR6_SFW217_B_0X1			(0x1u<<25)
#define	BSEC_SFSR6_SFW216_B_0X0			(0x0u<<24)
#define	BSEC_SFSR6_SFW216_B_0X1			(0x1u<<24)
#define	BSEC_SFSR6_SFW215_B_0X0			(0x0u<<23)
#define	BSEC_SFSR6_SFW215_B_0X1			(0x1u<<23)
#define	BSEC_SFSR6_SFW214_B_0X0			(0x0u<<22)
#define	BSEC_SFSR6_SFW214_B_0X1			(0x1u<<22)
#define	BSEC_SFSR6_SFW213_B_0X0			(0x0u<<21)
#define	BSEC_SFSR6_SFW213_B_0X1			(0x1u<<21)
#define	BSEC_SFSR6_SFW212_B_0X0			(0x0u<<20)
#define	BSEC_SFSR6_SFW212_B_0X1			(0x1u<<20)
#define	BSEC_SFSR6_SFW211_B_0X0			(0x0u<<19)
#define	BSEC_SFSR6_SFW211_B_0X1			(0x1u<<19)
#define	BSEC_SFSR6_SFW210_B_0X0			(0x0u<<18)
#define	BSEC_SFSR6_SFW210_B_0X1			(0x1u<<18)
#define	BSEC_SFSR6_SFW209_B_0X0			(0x0u<<17)
#define	BSEC_SFSR6_SFW209_B_0X1			(0x1u<<17)
#define	BSEC_SFSR6_SFW208_B_0X0			(0x0u<<16)
#define	BSEC_SFSR6_SFW208_B_0X1			(0x1u<<16)
#define	BSEC_SFSR6_SFW207_B_0X0			(0x0u<<15)
#define	BSEC_SFSR6_SFW207_B_0X1			(0x1u<<15)
#define	BSEC_SFSR6_SFW206_B_0X0			(0x0u<<14)
#define	BSEC_SFSR6_SFW206_B_0X1			(0x1u<<14)
#define	BSEC_SFSR6_SFW205_B_0X0			(0x0u<<13)
#define	BSEC_SFSR6_SFW205_B_0X1			(0x1u<<13)
#define	BSEC_SFSR6_SFW204_B_0X0			(0x0u<<12)
#define	BSEC_SFSR6_SFW204_B_0X1			(0x1u<<12)
#define	BSEC_SFSR6_SFW203_B_0X0			(0x0u<<11)
#define	BSEC_SFSR6_SFW203_B_0X1			(0x1u<<11)
#define	BSEC_SFSR6_SFW202_B_0X0			(0x0u<<10)
#define	BSEC_SFSR6_SFW202_B_0X1			(0x1u<<10)
#define	BSEC_SFSR6_SFW201_B_0X0			(0x0u<<9)
#define	BSEC_SFSR6_SFW201_B_0X1			(0x1u<<9)
#define	BSEC_SFSR6_SFW200_B_0X0			(0x0u<<8)
#define	BSEC_SFSR6_SFW200_B_0X1			(0x1u<<8)
#define	BSEC_SFSR6_SFW199_B_0X0			(0x0u<<7)
#define	BSEC_SFSR6_SFW199_B_0X1			(0x1u<<7)
#define	BSEC_SFSR6_SFW198_B_0X0			(0x0u<<6)
#define	BSEC_SFSR6_SFW198_B_0X1			(0x1u<<6)
#define	BSEC_SFSR6_SFW197_B_0X0			(0x0u<<5)
#define	BSEC_SFSR6_SFW197_B_0X1			(0x1u<<5)
#define	BSEC_SFSR6_SFW196_B_0X0			(0x0u<<4)
#define	BSEC_SFSR6_SFW196_B_0X1			(0x1u<<4)
#define	BSEC_SFSR6_SFW195_B_0X0			(0x0u<<3)
#define	BSEC_SFSR6_SFW195_B_0X1			(0x1u<<3)
#define	BSEC_SFSR6_SFW194_B_0X0			(0x0u<<2)
#define	BSEC_SFSR6_SFW194_B_0X1			(0x1u<<2)
#define	BSEC_SFSR6_SFW193_B_0X0			(0x0u<<1)
#define	BSEC_SFSR6_SFW193_B_0X1			(0x1u<<1)
#define	BSEC_SFSR6_SFW192_B_0X0			(0x0u<<0)
#define	BSEC_SFSR6_SFW192_B_0X1			(0x1u<<0)

// SFSR7 Configuration

#define	BSEC_SFSR7_SFW255				(0x1u<<31)
#define	BSEC_SFSR7_SFW254				(0x1u<<30)
#define	BSEC_SFSR7_SFW253				(0x1u<<29)
#define	BSEC_SFSR7_SFW252				(0x1u<<28)
#define	BSEC_SFSR7_SFW251				(0x1u<<27)
#define	BSEC_SFSR7_SFW250				(0x1u<<26)
#define	BSEC_SFSR7_SFW249				(0x1u<<25)
#define	BSEC_SFSR7_SFW248				(0x1u<<24)
#define	BSEC_SFSR7_SFW247				(0x1u<<23)
#define	BSEC_SFSR7_SFW246				(0x1u<<22)
#define	BSEC_SFSR7_SFW245				(0x1u<<21)
#define	BSEC_SFSR7_SFW244				(0x1u<<20)
#define	BSEC_SFSR7_SFW243				(0x1u<<19)
#define	BSEC_SFSR7_SFW242				(0x1u<<18)
#define	BSEC_SFSR7_SFW241				(0x1u<<17)
#define	BSEC_SFSR7_SFW240				(0x1u<<16)
#define	BSEC_SFSR7_SFW239				(0x1u<<15)
#define	BSEC_SFSR7_SFW238				(0x1u<<14)
#define	BSEC_SFSR7_SFW237				(0x1u<<13)
#define	BSEC_SFSR7_SFW236				(0x1u<<12)
#define	BSEC_SFSR7_SFW235				(0x1u<<11)
#define	BSEC_SFSR7_SFW234				(0x1u<<10)
#define	BSEC_SFSR7_SFW233				(0x1u<<9)
#define	BSEC_SFSR7_SFW232				(0x1u<<8)
#define	BSEC_SFSR7_SFW231				(0x1u<<7)
#define	BSEC_SFSR7_SFW230				(0x1u<<6)
#define	BSEC_SFSR7_SFW229				(0x1u<<5)
#define	BSEC_SFSR7_SFW228				(0x1u<<4)
#define	BSEC_SFSR7_SFW227				(0x1u<<3)
#define	BSEC_SFSR7_SFW226				(0x1u<<2)
#define	BSEC_SFSR7_SFW225				(0x1u<<1)
#define	BSEC_SFSR7_SFW224				(0x1u<<0)

#define	BSEC_SFSR7_SFW255_B_0X0			(0x0u<<31)
#define	BSEC_SFSR7_SFW255_B_0X1			(0x1u<<31)
#define	BSEC_SFSR7_SFW254_B_0X0			(0x0u<<30)
#define	BSEC_SFSR7_SFW254_B_0X1			(0x1u<<30)
#define	BSEC_SFSR7_SFW253_B_0X0			(0x0u<<29)
#define	BSEC_SFSR7_SFW253_B_0X1			(0x1u<<29)
#define	BSEC_SFSR7_SFW252_B_0X0			(0x0u<<28)
#define	BSEC_SFSR7_SFW252_B_0X1			(0x1u<<28)
#define	BSEC_SFSR7_SFW251_B_0X0			(0x0u<<27)
#define	BSEC_SFSR7_SFW251_B_0X1			(0x1u<<27)
#define	BSEC_SFSR7_SFW250_B_0X0			(0x0u<<26)
#define	BSEC_SFSR7_SFW250_B_0X1			(0x1u<<26)
#define	BSEC_SFSR7_SFW249_B_0X0			(0x0u<<25)
#define	BSEC_SFSR7_SFW249_B_0X1			(0x1u<<25)
#define	BSEC_SFSR7_SFW248_B_0X0			(0x0u<<24)
#define	BSEC_SFSR7_SFW248_B_0X1			(0x1u<<24)
#define	BSEC_SFSR7_SFW247_B_0X0			(0x0u<<23)
#define	BSEC_SFSR7_SFW247_B_0X1			(0x1u<<23)
#define	BSEC_SFSR7_SFW246_B_0X0			(0x0u<<22)
#define	BSEC_SFSR7_SFW246_B_0X1			(0x1u<<22)
#define	BSEC_SFSR7_SFW245_B_0X0			(0x0u<<21)
#define	BSEC_SFSR7_SFW245_B_0X1			(0x1u<<21)
#define	BSEC_SFSR7_SFW244_B_0X0			(0x0u<<20)
#define	BSEC_SFSR7_SFW244_B_0X1			(0x1u<<20)
#define	BSEC_SFSR7_SFW243_B_0X0			(0x0u<<19)
#define	BSEC_SFSR7_SFW243_B_0X1			(0x1u<<19)
#define	BSEC_SFSR7_SFW242_B_0X0			(0x0u<<18)
#define	BSEC_SFSR7_SFW242_B_0X1			(0x1u<<18)
#define	BSEC_SFSR7_SFW241_B_0X0			(0x0u<<17)
#define	BSEC_SFSR7_SFW241_B_0X1			(0x1u<<17)
#define	BSEC_SFSR7_SFW240_B_0X0			(0x0u<<16)
#define	BSEC_SFSR7_SFW240_B_0X1			(0x1u<<16)
#define	BSEC_SFSR7_SFW239_B_0X0			(0x0u<<15)
#define	BSEC_SFSR7_SFW239_B_0X1			(0x1u<<15)
#define	BSEC_SFSR7_SFW238_B_0X0			(0x0u<<14)
#define	BSEC_SFSR7_SFW238_B_0X1			(0x1u<<14)
#define	BSEC_SFSR7_SFW237_B_0X0			(0x0u<<13)
#define	BSEC_SFSR7_SFW237_B_0X1			(0x1u<<13)
#define	BSEC_SFSR7_SFW236_B_0X0			(0x0u<<12)
#define	BSEC_SFSR7_SFW236_B_0X1			(0x1u<<12)
#define	BSEC_SFSR7_SFW235_B_0X0			(0x0u<<11)
#define	BSEC_SFSR7_SFW235_B_0X1			(0x1u<<11)
#define	BSEC_SFSR7_SFW234_B_0X0			(0x0u<<10)
#define	BSEC_SFSR7_SFW234_B_0X1			(0x1u<<10)
#define	BSEC_SFSR7_SFW233_B_0X0			(0x0u<<9)
#define	BSEC_SFSR7_SFW233_B_0X1			(0x1u<<9)
#define	BSEC_SFSR7_SFW232_B_0X0			(0x0u<<8)
#define	BSEC_SFSR7_SFW232_B_0X1			(0x1u<<8)
#define	BSEC_SFSR7_SFW231_B_0X0			(0x0u<<7)
#define	BSEC_SFSR7_SFW231_B_0X1			(0x1u<<7)
#define	BSEC_SFSR7_SFW230_B_0X0			(0x0u<<6)
#define	BSEC_SFSR7_SFW230_B_0X1			(0x1u<<6)
#define	BSEC_SFSR7_SFW229_B_0X0			(0x0u<<5)
#define	BSEC_SFSR7_SFW229_B_0X1			(0x1u<<5)
#define	BSEC_SFSR7_SFW228_B_0X0			(0x0u<<4)
#define	BSEC_SFSR7_SFW228_B_0X1			(0x1u<<4)
#define	BSEC_SFSR7_SFW227_B_0X0			(0x0u<<3)
#define	BSEC_SFSR7_SFW227_B_0X1			(0x1u<<3)
#define	BSEC_SFSR7_SFW226_B_0X0			(0x0u<<2)
#define	BSEC_SFSR7_SFW226_B_0X1			(0x1u<<2)
#define	BSEC_SFSR7_SFW225_B_0X0			(0x0u<<1)
#define	BSEC_SFSR7_SFW225_B_0X1			(0x1u<<1)
#define	BSEC_SFSR7_SFW224_B_0X0			(0x0u<<0)
#define	BSEC_SFSR7_SFW224_B_0X1			(0x1u<<0)

