hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// SFSR8 Configuration

#define	BSEC_SFSR8_SFW287				(0x1u<<31)
#define	BSEC_SFSR8_SFW286				(0x1u<<30)
#define	BSEC_SFSR8_SFW285				(0x1u<<29)
#define	BSEC_SFSR8_SFW284				(0x1u<<28)
#define	BSEC_SFSR8_SFW283				(0x1u<<27)
#define	BSEC_SFSR8_SFW282				(0x1u<<26)
#define	BSEC_SFSR8_SFW281				(0x1u<<25)
#define	BSEC_SFSR8_SFW280				(0x1u<<24)
#define	BSEC_SFSR8_SFW279				(0x1u<<23)
#define	BSEC_SFSR8_SFW278				(0x1u<<22)
#define	BSEC_SFSR8_SFW277				(0x1u<<21)
#define	BSEC_SFSR8_SFW276				(0x1u<<20)
#define	BSEC_SFSR8_SFW275				(0x1u<<19)
#define	BSEC_SFSR8_SFW274				(0x1u<<18)
#define	BSEC_SFSR8_SFW273				(0x1u<<17)
#define	BSEC_SFSR8_SFW272				(0x1u<<16)
#define	BSEC_SFSR8_SFW271				(0x1u<<15)
#define	BSEC_SFSR8_SFW270				(0x1u<<14)
#define	BSEC_SFSR8_SFW269				(0x1u<<13)
#define	BSEC_SFSR8_SFW268				(0x1u<<12)
#define	BSEC_SFSR8_SFW267				(0x1u<<11)
#define	BSEC_SFSR8_SFW266				(0x1u<<10)
#define	BSEC_SFSR8_SFW265				(0x1u<<9)
#define	BSEC_SFSR8_SFW264				(0x1u<<8)
#define	BSEC_SFSR8_SFW263				(0x1u<<7)
#define	BSEC_SFSR8_SFW262				(0x1u<<6)
#define	BSEC_SFSR8_SFW261				(0x1u<<5)
#define	BSEC_SFSR8_SFW260				(0x1u<<4)
#define	BSEC_SFSR8_SFW259				(0x1u<<3)
#define	BSEC_SFSR8_SFW258				(0x1u<<2)
#define	BSEC_SFSR8_SFW257				(0x1u<<1)
#define	BSEC_SFSR8_SFW256				(0x1u<<0)

#define	BSEC_SFSR8_SFW287_B_0X0			(0x0u<<31)
#define	BSEC_SFSR8_SFW287_B_0X1			(0x1u<<31)
#define	BSEC_SFSR8_SFW286_B_0X0			(0x0u<<30)
#define	BSEC_SFSR8_SFW286_B_0X1			(0x1u<<30)
#define	BSEC_SFSR8_SFW285_B_0X0			(0x0u<<29)
#define	BSEC_SFSR8_SFW285_B_0X1			(0x1u<<29)
#define	BSEC_SFSR8_SFW284_B_0X0			(0x0u<<28)
#define	BSEC_SFSR8_SFW284_B_0X1			(0x1u<<28)
#define	BSEC_SFSR8_SFW283_B_0X0			(0x0u<<27)
#define	BSEC_SFSR8_SFW283_B_0X1			(0x1u<<27)
#define	BSEC_SFSR8_SFW282_B_0X0			(0x0u<<26)
#define	BSEC_SFSR8_SFW282_B_0X1			(0x1u<<26)
#define	BSEC_SFSR8_SFW281_B_0X0			(0x0u<<25)
#define	BSEC_SFSR8_SFW281_B_0X1			(0x1u<<25)
#define	BSEC_SFSR8_SFW280_B_0X0			(0x0u<<24)
#define	BSEC_SFSR8_SFW280_B_0X1			(0x1u<<24)
#define	BSEC_SFSR8_SFW279_B_0X0			(0x0u<<23)
#define	BSEC_SFSR8_SFW279_B_0X1			(0x1u<<23)
#define	BSEC_SFSR8_SFW278_B_0X0			(0x0u<<22)
#define	BSEC_SFSR8_SFW278_B_0X1			(0x1u<<22)
#define	BSEC_SFSR8_SFW277_B_0X0			(0x0u<<21)
#define	BSEC_SFSR8_SFW277_B_0X1			(0x1u<<21)
#define	BSEC_SFSR8_SFW276_B_0X0			(0x0u<<20)
#define	BSEC_SFSR8_SFW276_B_0X1			(0x1u<<20)
#define	BSEC_SFSR8_SFW275_B_0X0			(0x0u<<19)
#define	BSEC_SFSR8_SFW275_B_0X1			(0x1u<<19)
#define	BSEC_SFSR8_SFW274_B_0X0			(0x0u<<18)
#define	BSEC_SFSR8_SFW274_B_0X1			(0x1u<<18)
#define	BSEC_SFSR8_SFW273_B_0X0			(0x0u<<17)
#define	BSEC_SFSR8_SFW273_B_0X1			(0x1u<<17)
#define	BSEC_SFSR8_SFW272_B_0X0			(0x0u<<16)
#define	BSEC_SFSR8_SFW272_B_0X1			(0x1u<<16)
#define	BSEC_SFSR8_SFW271_B_0X0			(0x0u<<15)
#define	BSEC_SFSR8_SFW271_B_0X1			(0x1u<<15)
#define	BSEC_SFSR8_SFW270_B_0X0			(0x0u<<14)
#define	BSEC_SFSR8_SFW270_B_0X1			(0x1u<<14)
#define	BSEC_SFSR8_SFW269_B_0X0			(0x0u<<13)
#define	BSEC_SFSR8_SFW269_B_0X1			(0x1u<<13)
#define	BSEC_SFSR8_SFW268_B_0X0			(0x0u<<12)
#define	BSEC_SFSR8_SFW268_B_0X1			(0x1u<<12)
#define	BSEC_SFSR8_SFW267_B_0X0			(0x0u<<11)
#define	BSEC_SFSR8_SFW267_B_0X1			(0x1u<<11)
#define	BSEC_SFSR8_SFW266_B_0X0			(0x0u<<10)
#define	BSEC_SFSR8_SFW266_B_0X1			(0x1u<<10)
#define	BSEC_SFSR8_SFW265_B_0X0			(0x0u<<9)
#define	BSEC_SFSR8_SFW265_B_0X1			(0x1u<<9)
#define	BSEC_SFSR8_SFW264_B_0X0			(0x0u<<8)
#define	BSEC_SFSR8_SFW264_B_0X1			(0x1u<<8)
#define	BSEC_SFSR8_SFW263_B_0X0			(0x0u<<7)
#define	BSEC_SFSR8_SFW263_B_0X1			(0x1u<<7)
#define	BSEC_SFSR8_SFW262_B_0X0			(0x0u<<6)
#define	BSEC_SFSR8_SFW262_B_0X1			(0x1u<<6)
#define	BSEC_SFSR8_SFW261_B_0X0			(0x0u<<5)
#define	BSEC_SFSR8_SFW261_B_0X1			(0x1u<<5)
#define	BSEC_SFSR8_SFW260_B_0X0			(0x0u<<4)
#define	BSEC_SFSR8_SFW260_B_0X1			(0x1u<<4)
#define	BSEC_SFSR8_SFW259_B_0X0			(0x0u<<3)
#define	BSEC_SFSR8_SFW259_B_0X1			(0x1u<<3)
#define	BSEC_SFSR8_SFW258_B_0X0			(0x0u<<2)
#define	BSEC_SFSR8_SFW258_B_0X1			(0x1u<<2)
#define	BSEC_SFSR8_SFW257_B_0X0			(0x0u<<1)
#define	BSEC_SFSR8_SFW257_B_0X1			(0x1u<<1)
#define	BSEC_SFSR8_SFW256_B_0X0			(0x0u<<0)
#define	BSEC_SFSR8_SFW256_B_0X1			(0x1u<<0)

// SFSR9 Configuration

#define	BSEC_SFSR9_SFW319				(0x1u<<31)
#define	BSEC_SFSR9_SFW318				(0x1u<<30)
#define	BSEC_SFSR9_SFW317				(0x1u<<29)
#define	BSEC_SFSR9_SFW316				(0x1u<<28)
#define	BSEC_SFSR9_SFW315				(0x1u<<27)
#define	BSEC_SFSR9_SFW314				(0x1u<<26)
#define	BSEC_SFSR9_SFW313				(0x1u<<25)
#define	BSEC_SFSR9_SFW312				(0x1u<<24)
#define	BSEC_SFSR9_SFW311				(0x1u<<23)
#define	BSEC_SFSR9_SFW310				(0x1u<<22)
#define	BSEC_SFSR9_SFW309				(0x1u<<21)
#define	BSEC_SFSR9_SFW308				(0x1u<<20)
#define	BSEC_SFSR9_SFW307				(0x1u<<19)
#define	BSEC_SFSR9_SFW306				(0x1u<<18)
#define	BSEC_SFSR9_SFW305				(0x1u<<17)
#define	BSEC_SFSR9_SFW304				(0x1u<<16)
#define	BSEC_SFSR9_SFW303				(0x1u<<15)
#define	BSEC_SFSR9_SFW302				(0x1u<<14)
#define	BSEC_SFSR9_SFW301				(0x1u<<13)
#define	BSEC_SFSR9_SFW300				(0x1u<<12)
#define	BSEC_SFSR9_SFW299				(0x1u<<11)
#define	BSEC_SFSR9_SFW298				(0x1u<<10)
#define	BSEC_SFSR9_SFW297				(0x1u<<9)
#define	BSEC_SFSR9_SFW296				(0x1u<<8)
#define	BSEC_SFSR9_SFW295				(0x1u<<7)
#define	BSEC_SFSR9_SFW294				(0x1u<<6)
#define	BSEC_SFSR9_SFW293				(0x1u<<5)
#define	BSEC_SFSR9_SFW292				(0x1u<<4)
#define	BSEC_SFSR9_SFW291				(0x1u<<3)
#define	BSEC_SFSR9_SFW290				(0x1u<<2)
#define	BSEC_SFSR9_SFW289				(0x1u<<1)
#define	BSEC_SFSR9_SFW288				(0x1u<<0)

#define	BSEC_SFSR9_SFW319_B_0X0			(0x0u<<31)
#define	BSEC_SFSR9_SFW319_B_0X1			(0x1u<<31)
#define	BSEC_SFSR9_SFW318_B_0X0			(0x0u<<30)
#define	BSEC_SFSR9_SFW318_B_0X1			(0x1u<<30)
#define	BSEC_SFSR9_SFW317_B_0X0			(0x0u<<29)
#define	BSEC_SFSR9_SFW317_B_0X1			(0x1u<<29)
#define	BSEC_SFSR9_SFW316_B_0X0			(0x0u<<28)
#define	BSEC_SFSR9_SFW316_B_0X1			(0x1u<<28)
#define	BSEC_SFSR9_SFW315_B_0X0			(0x0u<<27)
#define	BSEC_SFSR9_SFW315_B_0X1			(0x1u<<27)
#define	BSEC_SFSR9_SFW314_B_0X0			(0x0u<<26)
#define	BSEC_SFSR9_SFW314_B_0X1			(0x1u<<26)
#define	BSEC_SFSR9_SFW313_B_0X0			(0x0u<<25)
#define	BSEC_SFSR9_SFW313_B_0X1			(0x1u<<25)
#define	BSEC_SFSR9_SFW312_B_0X0			(0x0u<<24)
#define	BSEC_SFSR9_SFW312_B_0X1			(0x1u<<24)
#define	BSEC_SFSR9_SFW311_B_0X0			(0x0u<<23)
#define	BSEC_SFSR9_SFW311_B_0X1			(0x1u<<23)
#define	BSEC_SFSR9_SFW310_B_0X0			(0x0u<<22)
#define	BSEC_SFSR9_SFW310_B_0X1			(0x1u<<22)
#define	BSEC_SFSR9_SFW309_B_0X0			(0x0u<<21)
#define	BSEC_SFSR9_SFW309_B_0X1			(0x1u<<21)
#define	BSEC_SFSR9_SFW308_B_0X0			(0x0u<<20)
#define	BSEC_SFSR9_SFW308_B_0X1			(0x1u<<20)
#define	BSEC_SFSR9_SFW307_B_0X0			(0x0u<<19)
#define	BSEC_SFSR9_SFW307_B_0X1			(0x1u<<19)
#define	BSEC_SFSR9_SFW306_B_0X0			(0x0u<<18)
#define	BSEC_SFSR9_SFW306_B_0X1			(0x1u<<18)
#define	BSEC_SFSR9_SFW305_B_0X0			(0x0u<<17)
#define	BSEC_SFSR9_SFW305_B_0X1			(0x1u<<17)
#define	BSEC_SFSR9_SFW304_B_0X0			(0x0u<<16)
#define	BSEC_SFSR9_SFW304_B_0X1			(0x1u<<16)
#define	BSEC_SFSR9_SFW303_B_0X0			(0x0u<<15)
#define	BSEC_SFSR9_SFW303_B_0X1			(0x1u<<15)
#define	BSEC_SFSR9_SFW302_B_0X0			(0x0u<<14)
#define	BSEC_SFSR9_SFW302_B_0X1			(0x1u<<14)
#define	BSEC_SFSR9_SFW301_B_0X0			(0x0u<<13)
#define	BSEC_SFSR9_SFW301_B_0X1			(0x1u<<13)
#define	BSEC_SFSR9_SFW300_B_0X0			(0x0u<<12)
#define	BSEC_SFSR9_SFW300_B_0X1			(0x1u<<12)
#define	BSEC_SFSR9_SFW299_B_0X0			(0x0u<<11)
#define	BSEC_SFSR9_SFW299_B_0X1			(0x1u<<11)
#define	BSEC_SFSR9_SFW298_B_0X0			(0x0u<<10)
#define	BSEC_SFSR9_SFW298_B_0X1			(0x1u<<10)
#define	BSEC_SFSR9_SFW297_B_0X0			(0x0u<<9)
#define	BSEC_SFSR9_SFW297_B_0X1			(0x1u<<9)
#define	BSEC_SFSR9_SFW296_B_0X0			(0x0u<<8)
#define	BSEC_SFSR9_SFW296_B_0X1			(0x1u<<8)
#define	BSEC_SFSR9_SFW295_B_0X0			(0x0u<<7)
#define	BSEC_SFSR9_SFW295_B_0X1			(0x1u<<7)
#define	BSEC_SFSR9_SFW294_B_0X0			(0x0u<<6)
#define	BSEC_SFSR9_SFW294_B_0X1			(0x1u<<6)
#define	BSEC_SFSR9_SFW293_B_0X0			(0x0u<<5)
#define	BSEC_SFSR9_SFW293_B_0X1			(0x1u<<5)
#define	BSEC_SFSR9_SFW292_B_0X0			(0x0u<<4)
#define	BSEC_SFSR9_SFW292_B_0X1			(0x1u<<4)
#define	BSEC_SFSR9_SFW291_B_0X0			(0x0u<<3)
#define	BSEC_SFSR9_SFW291_B_0X1			(0x1u<<3)
#define	BSEC_SFSR9_SFW290_B_0X0			(0x0u<<2)
#define	BSEC_SFSR9_SFW290_B_0X1			(0x1u<<2)
#define	BSEC_SFSR9_SFW289_B_0X0			(0x0u<<1)
#define	BSEC_SFSR9_SFW289_B_0X1			(0x1u<<1)
#define	BSEC_SFSR9_SFW288_B_0X0			(0x0u<<0)
#define	BSEC_SFSR9_SFW288_B_0X1			(0x1u<<0)

// SFSR10 Configuration

#define	BSEC_SFSR10_SFW351				(0x1u<<31)
#define	BSEC_SFSR10_SFW350				(0x1u<<30)
#define	BSEC_SFSR10_SFW349				(0x1u<<29)
#define	BSEC_SFSR10_SFW348				(0x1u<<28)
#define	BSEC_SFSR10_SFW347				(0x1u<<27)
#define	BSEC_SFSR10_SFW346				(0x1u<<26)
#define	BSEC_SFSR10_SFW345				(0x1u<<25)
#define	BSEC_SFSR10_SFW344				(0x1u<<24)
#define	BSEC_SFSR10_SFW343				(0x1u<<23)
#define	BSEC_SFSR10_SFW342				(0x1u<<22)
#define	BSEC_SFSR10_SFW341				(0x1u<<21)
#define	BSEC_SFSR10_SFW340				(0x1u<<20)
#define	BSEC_SFSR10_SFW339				(0x1u<<19)
#define	BSEC_SFSR10_SFW338				(0x1u<<18)
#define	BSEC_SFSR10_SFW337				(0x1u<<17)
#define	BSEC_SFSR10_SFW336				(0x1u<<16)
#define	BSEC_SFSR10_SFW335				(0x1u<<15)
#define	BSEC_SFSR10_SFW334				(0x1u<<14)
#define	BSEC_SFSR10_SFW333				(0x1u<<13)
#define	BSEC_SFSR10_SFW332				(0x1u<<12)
#define	BSEC_SFSR10_SFW331				(0x1u<<11)
#define	BSEC_SFSR10_SFW330				(0x1u<<10)
#define	BSEC_SFSR10_SFW329				(0x1u<<9)
#define	BSEC_SFSR10_SFW328				(0x1u<<8)
#define	BSEC_SFSR10_SFW327				(0x1u<<7)
#define	BSEC_SFSR10_SFW326				(0x1u<<6)
#define	BSEC_SFSR10_SFW325				(0x1u<<5)
#define	BSEC_SFSR10_SFW324				(0x1u<<4)
#define	BSEC_SFSR10_SFW323				(0x1u<<3)
#define	BSEC_SFSR10_SFW322				(0x1u<<2)
#define	BSEC_SFSR10_SFW321				(0x1u<<1)
#define	BSEC_SFSR10_SFW320				(0x1u<<0)

#define	BSEC_SFSR10_SFW351_B_0X0		(0x0u<<31)
#define	BSEC_SFSR10_SFW351_B_0X1		(0x1u<<31)
#define	BSEC_SFSR10_SFW350_B_0X0		(0x0u<<30)
#define	BSEC_SFSR10_SFW350_B_0X1		(0x1u<<30)
#define	BSEC_SFSR10_SFW349_B_0X0		(0x0u<<29)
#define	BSEC_SFSR10_SFW349_B_0X1		(0x1u<<29)
#define	BSEC_SFSR10_SFW348_B_0X0		(0x0u<<28)
#define	BSEC_SFSR10_SFW348_B_0X1		(0x1u<<28)
#define	BSEC_SFSR10_SFW347_B_0X0		(0x0u<<27)
#define	BSEC_SFSR10_SFW347_B_0X1		(0x1u<<27)
#define	BSEC_SFSR10_SFW346_B_0X0		(0x0u<<26)
#define	BSEC_SFSR10_SFW346_B_0X1		(0x1u<<26)
#define	BSEC_SFSR10_SFW345_B_0X0		(0x0u<<25)
#define	BSEC_SFSR10_SFW345_B_0X1		(0x1u<<25)
#define	BSEC_SFSR10_SFW344_B_0X0		(0x0u<<24)
#define	BSEC_SFSR10_SFW344_B_0X1		(0x1u<<24)
#define	BSEC_SFSR10_SFW343_B_0X0		(0x0u<<23)
#define	BSEC_SFSR10_SFW343_B_0X1		(0x1u<<23)
#define	BSEC_SFSR10_SFW342_B_0X0		(0x0u<<22)
#define	BSEC_SFSR10_SFW342_B_0X1		(0x1u<<22)
#define	BSEC_SFSR10_SFW341_B_0X0		(0x0u<<21)
#define	BSEC_SFSR10_SFW341_B_0X1		(0x1u<<21)
#define	BSEC_SFSR10_SFW340_B_0X0		(0x0u<<20)
#define	BSEC_SFSR10_SFW340_B_0X1		(0x1u<<20)
#define	BSEC_SFSR10_SFW339_B_0X0		(0x0u<<19)
#define	BSEC_SFSR10_SFW339_B_0X1		(0x1u<<19)
#define	BSEC_SFSR10_SFW338_B_0X0		(0x0u<<18)
#define	BSEC_SFSR10_SFW338_B_0X1		(0x1u<<18)
#define	BSEC_SFSR10_SFW337_B_0X0		(0x0u<<17)
#define	BSEC_SFSR10_SFW337_B_0X1		(0x1u<<17)
#define	BSEC_SFSR10_SFW336_B_0X0		(0x0u<<16)
#define	BSEC_SFSR10_SFW336_B_0X1		(0x1u<<16)
#define	BSEC_SFSR10_SFW335_B_0X0		(0x0u<<15)
#define	BSEC_SFSR10_SFW335_B_0X1		(0x1u<<15)
#define	BSEC_SFSR10_SFW334_B_0X0		(0x0u<<14)
#define	BSEC_SFSR10_SFW334_B_0X1		(0x1u<<14)
#define	BSEC_SFSR10_SFW333_B_0X0		(0x0u<<13)
#define	BSEC_SFSR10_SFW333_B_0X1		(0x1u<<13)
#define	BSEC_SFSR10_SFW332_B_0X0		(0x0u<<12)
#define	BSEC_SFSR10_SFW332_B_0X1		(0x1u<<12)
#define	BSEC_SFSR10_SFW331_B_0X0		(0x0u<<11)
#define	BSEC_SFSR10_SFW331_B_0X1		(0x1u<<11)
#define	BSEC_SFSR10_SFW330_B_0X0		(0x0u<<10)
#define	BSEC_SFSR10_SFW330_B_0X1		(0x1u<<10)
#define	BSEC_SFSR10_SFW329_B_0X0		(0x0u<<9)
#define	BSEC_SFSR10_SFW329_B_0X1		(0x1u<<9)
#define	BSEC_SFSR10_SFW328_B_0X0		(0x0u<<8)
#define	BSEC_SFSR10_SFW328_B_0X1		(0x1u<<8)
#define	BSEC_SFSR10_SFW327_B_0X0		(0x0u<<7)
#define	BSEC_SFSR10_SFW327_B_0X1		(0x1u<<7)
#define	BSEC_SFSR10_SFW326_B_0X0		(0x0u<<6)
#define	BSEC_SFSR10_SFW326_B_0X1		(0x1u<<6)
#define	BSEC_SFSR10_SFW325_B_0X0		(0x0u<<5)
#define	BSEC_SFSR10_SFW325_B_0X1		(0x1u<<5)
#define	BSEC_SFSR10_SFW324_B_0X0		(0x0u<<4)
#define	BSEC_SFSR10_SFW324_B_0X1		(0x1u<<4)
#define	BSEC_SFSR10_SFW323_B_0X0		(0x0u<<3)
#define	BSEC_SFSR10_SFW323_B_0X1		(0x1u<<3)
#define	BSEC_SFSR10_SFW322_B_0X0		(0x0u<<2)
#define	BSEC_SFSR10_SFW322_B_0X1		(0x1u<<2)
#define	BSEC_SFSR10_SFW321_B_0X0		(0x0u<<1)
#define	BSEC_SFSR10_SFW321_B_0X1		(0x1u<<1)
#define	BSEC_SFSR10_SFW320_B_0X0		(0x0u<<0)
#define	BSEC_SFSR10_SFW320_B_0X1		(0x1u<<0)

// SFSR11 Configuration

#define	BSEC_SFSR11_SFW383				(0x1u<<31)
#define	BSEC_SFSR11_SFW382				(0x1u<<30)
#define	BSEC_SFSR11_SFW381				(0x1u<<29)
#define	BSEC_SFSR11_SFW380				(0x1u<<28)
#define	BSEC_SFSR11_SFW379				(0x1u<<27)
#define	BSEC_SFSR11_SFW378				(0x1u<<26)
#define	BSEC_SFSR11_SFW377				(0x1u<<25)
#define	BSEC_SFSR11_SFW376				(0x1u<<24)
#define	BSEC_SFSR11_SFW375				(0x1u<<23)
#define	BSEC_SFSR11_SFW374				(0x1u<<22)
#define	BSEC_SFSR11_SFW373				(0x1u<<21)
#define	BSEC_SFSR11_SFW372				(0x1u<<20)
#define	BSEC_SFSR11_SFW371				(0x1u<<19)
#define	BSEC_SFSR11_SFW370				(0x1u<<18)
#define	BSEC_SFSR11_SFW369				(0x1u<<17)
#define	BSEC_SFSR11_SFW368				(0x1u<<16)
#define	BSEC_SFSR11_SFW367				(0x1u<<15)
#define	BSEC_SFSR11_SFW366				(0x1u<<14)
#define	BSEC_SFSR11_SFW365				(0x1u<<13)
#define	BSEC_SFSR11_SFW364				(0x1u<<12)
#define	BSEC_SFSR11_SFW363				(0x1u<<11)
#define	BSEC_SFSR11_SFW362				(0x1u<<10)
#define	BSEC_SFSR11_SFW361				(0x1u<<9)
#define	BSEC_SFSR11_SFW360				(0x1u<<8)
#define	BSEC_SFSR11_SFW359				(0x1u<<7)
#define	BSEC_SFSR11_SFW358				(0x1u<<6)
#define	BSEC_SFSR11_SFW357				(0x1u<<5)
#define	BSEC_SFSR11_SFW356				(0x1u<<4)
#define	BSEC_SFSR11_SFW355				(0x1u<<3)
#define	BSEC_SFSR11_SFW354				(0x1u<<2)
#define	BSEC_SFSR11_SFW353				(0x1u<<1)
#define	BSEC_SFSR11_SFW352				(0x1u<<0)

#define	BSEC_SFSR11_SFW383_B_0X0		(0x0u<<31)
#define	BSEC_SFSR11_SFW383_B_0X1		(0x1u<<31)
#define	BSEC_SFSR11_SFW382_B_0X0		(0x0u<<30)
#define	BSEC_SFSR11_SFW382_B_0X1		(0x1u<<30)
#define	BSEC_SFSR11_SFW381_B_0X0		(0x0u<<29)
#define	BSEC_SFSR11_SFW381_B_0X1		(0x1u<<29)
#define	BSEC_SFSR11_SFW380_B_0X0		(0x0u<<28)
#define	BSEC_SFSR11_SFW380_B_0X1		(0x1u<<28)
#define	BSEC_SFSR11_SFW379_B_0X0		(0x0u<<27)
#define	BSEC_SFSR11_SFW379_B_0X1		(0x1u<<27)
#define	BSEC_SFSR11_SFW378_B_0X0		(0x0u<<26)
#define	BSEC_SFSR11_SFW378_B_0X1		(0x1u<<26)
#define	BSEC_SFSR11_SFW377_B_0X0		(0x0u<<25)
#define	BSEC_SFSR11_SFW377_B_0X1		(0x1u<<25)
#define	BSEC_SFSR11_SFW376_B_0X0		(0x0u<<24)
#define	BSEC_SFSR11_SFW376_B_0X1		(0x1u<<24)
#define	BSEC_SFSR11_SFW375_B_0X0		(0x0u<<23)
#define	BSEC_SFSR11_SFW375_B_0X1		(0x1u<<23)
#define	BSEC_SFSR11_SFW374_B_0X0		(0x0u<<22)
#define	BSEC_SFSR11_SFW374_B_0X1		(0x1u<<22)
#define	BSEC_SFSR11_SFW373_B_0X0		(0x0u<<21)
#define	BSEC_SFSR11_SFW373_B_0X1		(0x1u<<21)
#define	BSEC_SFSR11_SFW372_B_0X0		(0x0u<<20)
#define	BSEC_SFSR11_SFW372_B_0X1		(0x1u<<20)
#define	BSEC_SFSR11_SFW371_B_0X0		(0x0u<<19)
#define	BSEC_SFSR11_SFW371_B_0X1		(0x1u<<19)
#define	BSEC_SFSR11_SFW370_B_0X0		(0x0u<<18)
#define	BSEC_SFSR11_SFW370_B_0X1		(0x1u<<18)
#define	BSEC_SFSR11_SFW369_B_0X0		(0x0u<<17)
#define	BSEC_SFSR11_SFW369_B_0X1		(0x1u<<17)
#define	BSEC_SFSR11_SFW368_B_0X0		(0x0u<<16)
#define	BSEC_SFSR11_SFW368_B_0X1		(0x1u<<16)
#define	BSEC_SFSR11_SFW367_B_0X0		(0x0u<<15)
#define	BSEC_SFSR11_SFW367_B_0X1		(0x1u<<15)
#define	BSEC_SFSR11_SFW366_B_0X0		(0x0u<<14)
#define	BSEC_SFSR11_SFW366_B_0X1		(0x1u<<14)
#define	BSEC_SFSR11_SFW365_B_0X0		(0x0u<<13)
#define	BSEC_SFSR11_SFW365_B_0X1		(0x1u<<13)
#define	BSEC_SFSR11_SFW364_B_0X0		(0x0u<<12)
#define	BSEC_SFSR11_SFW364_B_0X1		(0x1u<<12)
#define	BSEC_SFSR11_SFW363_B_0X0		(0x0u<<11)
#define	BSEC_SFSR11_SFW363_B_0X1		(0x1u<<11)
#define	BSEC_SFSR11_SFW362_B_0X0		(0x0u<<10)
#define	BSEC_SFSR11_SFW362_B_0X1		(0x1u<<10)
#define	BSEC_SFSR11_SFW361_B_0X0		(0x0u<<9)
#define	BSEC_SFSR11_SFW361_B_0X1		(0x1u<<9)
#define	BSEC_SFSR11_SFW360_B_0X0		(0x0u<<8)
#define	BSEC_SFSR11_SFW360_B_0X1		(0x1u<<8)
#define	BSEC_SFSR11_SFW359_B_0X0		(0x0u<<7)
#define	BSEC_SFSR11_SFW359_B_0X1		(0x1u<<7)
#define	BSEC_SFSR11_SFW358_B_0X0		(0x0u<<6)
#define	BSEC_SFSR11_SFW358_B_0X1		(0x1u<<6)
#define	BSEC_SFSR11_SFW357_B_0X0		(0x0u<<5)
#define	BSEC_SFSR11_SFW357_B_0X1		(0x1u<<5)
#define	BSEC_SFSR11_SFW356_B_0X0		(0x0u<<4)
#define	BSEC_SFSR11_SFW356_B_0X1		(0x1u<<4)
#define	BSEC_SFSR11_SFW355_B_0X0		(0x0u<<3)
#define	BSEC_SFSR11_SFW355_B_0X1		(0x1u<<3)
#define	BSEC_SFSR11_SFW354_B_0X0		(0x0u<<2)
#define	BSEC_SFSR11_SFW354_B_0X1		(0x1u<<2)
#define	BSEC_SFSR11_SFW353_B_0X0		(0x0u<<1)
#define	BSEC_SFSR11_SFW353_B_0X1		(0x1u<<1)
#define	BSEC_SFSR11_SFW352_B_0X0		(0x0u<<0)
#define	BSEC_SFSR11_SFW352_B_0X1		(0x1u<<0)

