hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_bsec.h
// OTPCR Configuration

#define	BSEC_OTPCR_LASTCID				(0x7u<<19)
#define	BSEC_OTPCR_LASTCID_0			(0x1u<<19)
#define	BSEC_OTPCR_PPLOCK				(0x1u<<14)
#define	BSEC_OTPCR_PROG					(0x1u<<13)
#define	BSEC_OTPCR_ADDR					(0x1FFu<<0)
#define	BSEC_OTPCR_ADDR_0				(0x1u<<0)

#define	BSEC_OTPCR_PPLOCK_B_0X0			(0x0u<<14)
#define	BSEC_OTPCR_PPLOCK_B_0X1			(0x1u<<14)
#define	BSEC_OTPCR_PROG_B_0X0			(0x0u<<13)
#define	BSEC_OTPCR_PROG_B_0X1			(0x1u<<13)

// WDR Configuration

#define	BSEC_WDR_WRDATA					(0xFFFFFFFFu<<0)
#define	BSEC_WDR_WRDATA_0				(0x1u<<0)

// SCRATCHR0 Configuration

#define	BSEC_SCRATCHR0_SDATA			(0xFFFFFFFFu<<0)
#define	BSEC_SCRATCHR0_SDATA_0			(0x1u<<0)

// SCRATCHR1 Configuration

#define	BSEC_SCRATCHR1_SDATA			(0xFFFFFFFFu<<0)
#define	BSEC_SCRATCHR1_SDATA_0			(0x1u<<0)

// SCRATCHR2 Configuration

#define	BSEC_SCRATCHR2_SDATA			(0xFFFFFFFFu<<0)
#define	BSEC_SCRATCHR2_SDATA_0			(0x1u<<0)

// SCRATCHR3 Configuration

#define	BSEC_SCRATCHR3_SDATA			(0xFFFFFFFFu<<0)
#define	BSEC_SCRATCHR3_SDATA_0			(0x1u<<0)

// LOCKR Configuration

#define	BSEC_LOCKR_HKLOCK				(0x1u<<2)
#define	BSEC_LOCKR_GWLOCK				(0x1u<<0)

#define	BSEC_LOCKR_HKLOCK_B_0X0			(0x0u<<2)
#define	BSEC_LOCKR_HKLOCK_B_0X1			(0x1u<<2)
#define	BSEC_LOCKR_GWLOCK_B_0X0			(0x0u<<0)
#define	BSEC_LOCKR_GWLOCK_B_0X1			(0x1u<<0)

// JTAGINR Configuration

#define	BSEC_JTAGINR_JDATAIN			(0xFFFFFFFFu<<0)
#define	BSEC_JTAGINR_JDATAIN_0			(0x1u<<0)

// JTAGOUTR Configuration

#define	BSEC_JTAGOUTR_JDATAOUT			(0xFFFFFFFFu<<0)
#define	BSEC_JTAGOUTR_JDATAOUT_0		(0x1u<<0)

// UNMAPR Configuration

#define	BSEC_UNMAPR_UNMAP				(0xFFFFFFFFu<<0)
#define	BSEC_UNMAPR_UNMAP_0				(0x1u<<0)

// SR Configuration

#define	BSEC_SR_NVSTATE					(0x3Fu<<26)
#define	BSEC_SR_NVSTATE_0				(0x1u<<26)
#define	BSEC_SR_DBGREQ					(0x1u<<16)
#define	BSEC_SR_HVALID					(0x1u<<1)

#define	BSEC_SR_NVSTATE_B_0X16			(0x16u<<26)
#define	BSEC_SR_NVSTATE_B_0X0D			(0xDu<<26)
#define	BSEC_SR_NVSTATE_B_0X7			(0x7u<<26)
#define	BSEC_SR_NVSTATE_B_0X23			(0x23u<<26)
#define	BSEC_SR_DBGREQ_B_0X0			(0x0u<<16)
#define	BSEC_SR_DBGREQ_B_0X1			(0x1u<<16)
#define	BSEC_SR_HVALID_B_0X0			(0x0u<<1)
#define	BSEC_SR_HVALID_B_0X1			(0x1u<<1)

// OTPSR Configuration

#define	BSEC_OTPSR_AMEF					(0x1u<<22)
#define	BSEC_OTPSR_PPLMF				(0x1u<<21)
#define	BSEC_OTPSR_PPLF					(0x1u<<20)
#define	BSEC_OTPSR_SECF					(0x1u<<19)
#define	BSEC_OTPSR_DEDF					(0x1u<<18)
#define	BSEC_OTPSR_DISTURBF				(0x1u<<17)
#define	BSEC_OTPSR_PROGFAIL				(0x1u<<16)
#define	BSEC_OTPSR_OTPSEC				(0x1u<<6)
#define	BSEC_OTPSR_OTPERR				(0x1u<<5)
#define	BSEC_OTPSR_OTPNVIR				(0x1u<<4)
#define	BSEC_OTPSR_HIDEUP				(0x1u<<2)
#define	BSEC_OTPSR_INIT_DONE			(0x1u<<1)
#define	BSEC_OTPSR_BUSY					(0x1u<<0)

#define	BSEC_OTPSR_BUSY_B_0X0			(0x0u<<0)
#define	BSEC_OTPSR_BUSY_B_0X1			(0x1u<<0)

// EPOCHR0 Configuration

#define	BSEC_EPOCHR0_EPOCH				(0xFFFFFFFFu<<0)
#define	BSEC_EPOCHR0_EPOCH_0			(0x1u<<0)

// EPOCHR1 Configuration

#define	BSEC_EPOCHR1_EPOCH				(0xFFFFFFFFu<<0)
#define	BSEC_EPOCHR1_EPOCH_0			(0x1u<<0)

// EPOCH_SELR Configuration

#define	BSEC_EPOCH_SELR_EPSEL			(0x1u<<0)

#define	BSEC_EPOCH_SELR_EPSEL_B_0X0		(0x0u<<0)
#define	BSEC_EPOCH_SELR_EPSEL_B_0X1		(0x1u<<0)

// DBGCR Configuration

#define	BSEC_DBGCR_AUTH_SEC				(0xFFu<<24)
#define	BSEC_DBGCR_AUTH_SEC_0			(0x1u<<24)
#define	BSEC_DBGCR_AUTH_HDPL			(0xFFu<<16)
#define	BSEC_DBGCR_AUTH_HDPL_0			(0x1u<<16)
#define	BSEC_DBGCR_UNLOCK				(0xFFu<<8)
#define	BSEC_DBGCR_UNLOCK_0				(0x1u<<8)

#define	BSEC_DBGCR_AUTH_SEC_B_0XB4		(0xB4u<<24)
#define	BSEC_DBGCR_AUTH_HDPL_B_0XB4		(0xB4u<<16)
#define	BSEC_DBGCR_AUTH_HDPL_B_0X51		(0x51u<<16)
#define	BSEC_DBGCR_AUTH_HDPL_B_0X8A		(0x8Au<<16)
#define	BSEC_DBGCR_AUTH_HDPL_B_0X6F		(0x6Fu<<16)
#define	BSEC_DBGCR_UNLOCK_B_0XB4		(0xB4u<<8)

// AP_UNLOCK Configuration

#define	BSEC_AP_UNLOCK_UNLOCK			(0xFFu<<0)
#define	BSEC_AP_UNLOCK_UNLOCK_0			(0x1u<<0)

#define	BSEC_AP_UNLOCK_UNLOCK_B_0XB4	(0xB4u<<0)

// HDPLSR Configuration

#define	BSEC_HDPLSR_HDPL				(0xFFu<<0)
#define	BSEC_HDPLSR_HDPL_0				(0x1u<<0)

#define	BSEC_HDPLSR_HDPL_B_0XB4			(0xB4u<<0)
#define	BSEC_HDPLSR_HDPL_B_0X51			(0x51u<<0)
#define	BSEC_HDPLSR_HDPL_B_0X8A			(0x8Au<<0)
#define	BSEC_HDPLSR_HDPL_B_0X6F			(0x6Fu<<0)

// HDPLCR Configuration

#define	BSEC_HDPLCR_INCR_HDPL			(0xFFFFFFFFu<<0)
#define	BSEC_HDPLCR_INCR_HDPL_0			(0x1u<<0)

// NEXTLR Configuration

#define	BSEC_NEXTLR_INCR				(0x3u<<0)
#define	BSEC_NEXTLR_INCR_0				(0x1u<<0)

// WOSCR0 Configuration

#define	BSEC_WOSCR0_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR0_WOSDATA_0			(0x1u<<0)

// WOSCR1 Configuration

#define	BSEC_WOSCR1_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR1_WOSDATA_0			(0x1u<<0)

// WOSCR2 Configuration

#define	BSEC_WOSCR2_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR2_WOSDATA_0			(0x1u<<0)

// WOSCR3 Configuration

#define	BSEC_WOSCR3_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR3_WOSDATA_0			(0x1u<<0)

// WOSCR4 Configuration

#define	BSEC_WOSCR4_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR4_WOSDATA_0			(0x1u<<0)

// WOSCR5 Configuration

#define	BSEC_WOSCR5_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR5_WOSDATA_0			(0x1u<<0)

// WOSCR6 Configuration

#define	BSEC_WOSCR6_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR6_WOSDATA_0			(0x1u<<0)

// WOSCR7 Configuration

#define	BSEC_WOSCR7_WOSDATA				(0xFFFFFFFFu<<0)
#define	BSEC_WOSCR7_WOSDATA_0			(0x1u<<0)

// HRCR Configuration

#define	BSEC_HRCR_HRC					(0xFFFFFFFFu<<0)
#define	BSEC_HRCR_HRC_0					(0x1u<<0)

// WRCR Configuration

#define	BSEC_WRCR_WRC					(0xFFFFFFFFu<<0)
#define	BSEC_WRCR_WRC_0					(0x1u<<0)
